{ "version": "https://jsonfeed.org/version/1.1", "title": "Elect Socialist for Scarborough", "language": "en", "home_page_url": "https://kiri-vadivelu.ca", "feed_url": "https://kiri-vadivelu.ca/feed.json", "description": "Official website for Kiri Vadivelu of Scarborough", "author": { "name": "Kiri Vadivelu", "url": "https://kiri-vadivelu.ca/about/" }, "items": [{ "id": "https://kiri-vadivelu.ca/blog/mullivaikkal-massacre-in-may-2009/", "url": "https://kiri-vadivelu.ca/blog/mullivaikkal-massacre-in-may-2009/", "title": "Mullivaikkal Massacre in May 2009", "content_html": "<p>Of course, International courts headed by United States and the apartheid Israel did not have enough evidence to prove genocide or use of chemical weapons during the final phase of War in Sri Lanka. A classic conclusion of court case in a corporate capitalist society where money talks bullshit walks. Please exercise caution before viewing the images as they may be extremely disturbing to some.</p>\n<img alt=\"Tents in Mullivaikkal where civilians where staying before chemical explosion\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/hH3tbzzEtH-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/hH3tbzzEtH-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/hH3tbzzEtH-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Execution of captured rebel fighters in Sri Lanka\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/TmH5UDmMx0-300.jpeg\" width=\"600\" height=\"442\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/TmH5UDmMx0-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/TmH5UDmMx0-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Use of cluster bombs against civilians in Sri Lanka\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/BGcDSmYPxn-300.jpeg\" width=\"600\" height=\"401\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/BGcDSmYPxn-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/BGcDSmYPxn-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Bodies of Tamil civilians after death due to toxicity\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/dysBIXyHjh-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/dysBIXyHjh-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/dysBIXyHjh-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Body of Tamil female civilians after death due to toxicity\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/leN0RB0bzg-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/leN0RB0bzg-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/leN0RB0bzg-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Shell casing of exploded cluster bomb in Sri Lanka\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/EXPrrK6Z3V-300.jpeg\" width=\"600\" height=\"360\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/EXPrrK6Z3V-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/EXPrrK6Z3V-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<img alt=\"Body of LTTE rebel figher with burned skins due to chemical exposures\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/i9UsOo31rH-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/i9UsOo31rH-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/i9UsOo31rH-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>After all, ruthless capitalist governments have no interest in human rights or international law, that is why history repeats. Justice will not matter in a society where profit is the first priority.</p>\n<p>The Indian news channel 'News X' broadcast footage of a Sri Lankan army officer reportedly boasting of the use of chemical weapons against Tamil fighters and civilians during the final stages of the armed conflict in Sri Lanka.<a href=\"https://www.tamilguardian.com/content/video-sri-lankan-soldier-describing-use-chemical-weapons-indias-news-x\">Read More</a>.</p>\n", "date_published": "2020-03-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/canadian-garbage-trapped-in-philippines/", "url": "https://kiri-vadivelu.ca/blog/canadian-garbage-trapped-in-philippines/", "title": "Canadian Garbage Trapped in Philippines", "content_html": "<p>The Canadian containers arrived in the Philippines in 2013 and 2014 falsely labelled as being full of recycling plastics. Philippine customs authorities inspected the containers and discovered about two-thirds of them to be ordinary household garbage, including electronic waste and used diapers.</p>\n<img alt=\"Canadian garbage ship in the Philippines\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/X_3lbjROYt-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/X_3lbjROYt-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/X_3lbjROYt-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The Liberals have been negotiating with the Philippines about the garbage for 3½ years, finally agreeing to bring the remaining waste back and pay for the shipments in April, after Duterte threatened to &quot;declare war&quot; on Canada. When a May 15 deadline for the trash to leave passed without action, the Philippines recalled its ambassador and consuls general until the trash was gone. <a href=\"https://www.cbc.ca/news/science/canadian-garbage-from-philippines-departure-1.5156007\">Read More</a></p>\n<p>The key take away is that developed countries must stop exploiting poor countries. Capitalist governments, both Liberal and Conservatives only care about profit margins and have no regards for human lives on this planet except for themselves.</p>\n", "date_published": "2020-03-23T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/tabor-hill-scarborough-feast-of-the-dead/", "url": "https://kiri-vadivelu.ca/blog/tabor-hill-scarborough-feast-of-the-dead/", "title": "Tabor Hill Scarborough, Feast of the Dead", "content_html": "<p>In Scarborough, the Tabor Hill Site is the most well known archeological site. This section will refocus our attention to an important moment in Scarborough history and outcomes of the excavation conducted by archaeologist Walter Kenyon. Under the scholarship of University of Toronto Professor Walter Kenyon, an Indigenous burial site dating to the 13th century was discovered. Excerpt from Scarborough Historical Society.</p>\n<img alt=\"Feast of the dead ceremony chief in 1960\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/oWNu4Sc0Sh-300.jpeg\" width=\"600\" height=\"732\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/oWNu4Sc0Sh-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/oWNu4Sc0Sh-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The site contained an ossuary as well as the mass burial of approximately 472 individuals. According to Walter Kenyon and James Lovekins, the burial ritual were in accordance to Iroquois tradition (More information available in Archival – A023). Through the Feast of the Dead ceremony, Iroquois community members would wait 10 to 12 year intervals to bury their dead in a mass burial.</p>\n<p>In August of 1956, The Tabor Hill site was officially discovered by developer Gordon McBride near Bellamy and Lawrence. The McBride development was halted indefinitely, only to be expropriated by the provincial government years later. The years prior to the official expropriation, the site was left untouched and in a “neglected state”(More information available in Archival Guide – A027). Public pressure to address the condition of the site, resulted in the Township of Scarborough creating a three acre park with the financial support of the Provincial government.</p>\n<p>This discovery caused an uproar within the Indigenous community, as the disturbance of a burial site is forbidden in the culture and traditions. Moreover, the importance of this site derives from Indigenous communities from across the nation gathering for the reburial ceremony. The official ceremony, referred to as the ‘Feast of the Dead’, took place during June 1961. Although there are many archaeological sites within Scarborough, there is significance of the Tabor Hill site, through how well known it is and its importance to the Indigenous community.</p>\n<img alt=\"Then Scarborough Mayor at Feast of the dead ceremony in 1960\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/zt5Ot-uZMy-300.jpeg\" width=\"600\" height=\"912\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/zt5Ot-uZMy-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/zt5Ot-uZMy-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Unlike any other archeological site in the history Scarborough, the Tabor Hill site garnered international and national attention. The Feast of the Dead brought Indigenous representatives from all over such as the Six Nations Confederation, the Onondagas, the Mohawks, the Cayugas, the Senecas, the Oneidas and the Tuscaroras as well as representatives Branford Reserve. Minister of Immigration described the ritual as an example of happier relations for the future. The Feast of the Dead marked the re-burial and rectification of the earlier disturbance of the excavation. Below there are new articles that discuss the event and its history, as well as other images of significance in relation to the Ceremony. <a href=\"http://scarboroughhistorical.ca/archives-2/the-archives-collection/tabor-hill/\">Learn More</a>.</p>\n", "date_published": "2020-04-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-tamil-genocide-by-sri-lanka/", "url": "https://kiri-vadivelu.ca/blog/the-tamil-genocide-by-sri-lanka/", "title": "The Tamil Genocide by Sri Lanka", "content_html": "<p>Sri Lanka’s government declared victory in May, 2009, in one of the world’s most intractable wars after a series of battles in which it killed the leader of the Tamil Tigers, who had been fighting to create a separate homeland for the country’s ethnic Tamil minority. The United Nations said the conflict had killed between 80,000 and 100,000 people in Sri Lanka since full-scale civil war broke out in 1983. The global failure to protect Tamil rights under International Law and the extraordinary silence of the Holocaust survivers must be questioned.</p>\n<img alt=\"Tamil genocide by Sri Lanka in May 2009\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/yEZ3lH5u2P-300.jpeg\" width=\"600\" height=\"346\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/yEZ3lH5u2P-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/yEZ3lH5u2P-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>A US State Department report offered a grisly catalogue of alleged abuses, including the killing of captives or combatants seeking surrender, the abduction and in some cases murder of Tamil civilians, and dismal humanitarian conditions in camps for displaced persons. Human Rights Watch said the U.S. report should dispel any doubts that serious abuses were committed during the final months of the 26-year civil war. The report gains added significance since, during these five months, the Sri Lankan Government denied independent observers, including the media and human rights organizations, access to the war zone, and conducted a “war without witnesses.”</p>\n<p>This book traces the ongoing engagement of international lawyer Francis A. Boyle during the last years of the conflict. Boyle was among the very few addressing the international legal implications of the Sri Lankan Government’s grave and systematic violations of Tamil human rights while the conflict was taking place. This is the first book to develop an authoritative case for genocide against the Government of Sri Lanka under international law.</p>\n", "date_published": "2020-05-18T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/zionist-devil-consume-palestine-lands/", "url": "https://kiri-vadivelu.ca/blog/zionist-devil-consume-palestine-lands/", "title": "Zionist Devil Consume Palestine Lands", "content_html": "<p>The Palestine Israel conflict began since creation of Israel in the occupied land of Palestine. Zionist Israel used all evil means to divide humanity and control freedom of speech to achieve a false democracy. There is no freedom of speech or freedom to move for those who disapprove the genocide of Palestine people. People of Israel are victim of political propaganda to accept the genocide of Palestine while reject holocaust. If terrorization of Palestine people is justified, why so much outcry about gas chambers?</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/DuEpgzSyIG-300.jpeg\" width=\"600\" height=\"591\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/DuEpgzSyIG-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/DuEpgzSyIG-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>A prudent person would likely to believe the conspiracy that holocaust is a political propaganda to create apartheid regime. Unfortunately, the treatment of Palestine people by the Israel makes one wonder whether Zionists would ever speak truth? History is written by winners to justify oppression while disregarding the voices of the victims. Listening to victims is the step in the right direction to seek truth on any context. Failure to side with Palestine people would be closing the door to know the dark history of Zionist land grabs.</p>\n<p>The Israel is the only state where every citizen must serve in military. Those mandatory service laws enable the State to brainwash everyone with Zionist terror ideologies. Because of such early exposure to hate, Jewish population in Israel continue to hold discriminatory views on Palestine people. Ultimately, brainwashed Zionists Jews not only hold elected offices but also ensure people remain misinformed in order to carry out atrocities against Palestine. What keep nationless Jews in Israel together is the united hate against Palestine people; not love, culture or tradition amongst them. No country will never achieve peace under the ruling of apartheid regimes.</p>\n", "date_published": "2020-06-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-pandemic-story-of-workers/", "url": "https://kiri-vadivelu.ca/blog/the-pandemic-story-of-workers/", "title": "The Pandemic Story of Workers", "content_html": "<p>Life was not fair to workers even before the pandemic. We worked multiple jobs to feed and pay rent so few can get rich when food and shelter was a basic human need. As a frontline employee, I paid my dues while billionaires were going to space and laugh at us on their way back during the lock-down. Our capitalist leaders were protecting the big corporations while people were dying of disease that was manufactured through greed, ignorance and cruelty to humanity.</p>\n<img alt=\"Struggles of workers during the pandemic\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/i7amqWziQ9-300.jpeg\" width=\"600\" height=\"335\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/i7amqWziQ9-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/i7amqWziQ9-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>In 2020, I lost my livelihood and then had my family evicted from home but still going strong to inspire, change and build a better future for next generation. My community guarded me at the most difficult time and now I am privileged to lead the change that we all want to see changed. Join the conversation, let us be the change makers. We can break free from the capitalism induced materialism to build better community and preserve our planet. All workers face the same struggle. Let us walk together.</p>\n<p>Contribute to the conversation, be the unicorn in your social circle. We do not have to agree on everything but we got to protect each other from the evils of capitalism, imperialism and colonialism. Be engaged, you are a divine being, that is all what matters.</p>\n", "date_published": "2021-02-21T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/left-and-right-to-connect-the-dots/", "url": "https://kiri-vadivelu.ca/blog/left-and-right-to-connect-the-dots/", "title": "Left and Right to Connect the Dots", "content_html": "<p>The left and the right connect the dots. We can build back better but not this way. It is not democracy, equality or justice. Absolute fascism and plain dictatorship of political dissents. The famous line, &quot;We were just following the orders&quot;.</p>\n<img alt=\"Police assaulting an elderly freedom convey protester\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/plafzqvcKT-300.jpeg\" width=\"600\" height=\"715\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/plafzqvcKT-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/plafzqvcKT-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-02-24T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/canadians-are-not-totalitarians-joe/", "url": "https://kiri-vadivelu.ca/blog/canadians-are-not-totalitarians-joe/", "title": "Canadians are Not Totalitarians Joe", "content_html": "<p>Of course Canada is in the centre stage in the global media for unpleasant reasons. Most corporate media will do whatever necessary to amplify the freedom convey issues. Those who live outside the Canadian borders believe Canadian truckers are fighting for better employment, wages and benefits but we know that is far from reality.</p>\n<img alt=\"Joe Rogan vs Justin Trudeau\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/igkeNkefDN-300.jpeg\" width=\"600\" height=\"315\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/igkeNkefDN-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/igkeNkefDN-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>I do not support liberal nor I voted for them in the last election; however, I do not believe Justin Trudeau is a totalitarian. Yes, he did come out too strong to criticize the protesters who were disconnected from the local community. However, I believe that he has let the protest carry on for far too long before taking any action. Nonetheless, who knew everything would be this way? It is a mess that we all need to learn to live with it.</p>\n<p>For instance, all employees are ok with having a totalitarian employer but not ok with government that have different opinions. Liberals are not anti-capitalist government nor care about human right violations in Palestine or other poor countries with socialist views. If we are really concerned citizens, we need to boot capitalism out of the system in order to have a balanced government.</p>\n<p>Joe Rogan supports corporate exploitation of labour; therefore, he lacks any credibility to criticize Trudeau as a communist dictator. Even if he does have any, he is absolutely incorrect because the correct classification is Trudeau like any Liberal or Conservative leaders, is a corporate dictator. Sadly, wrong diagnosis does not help prescribe right medicine. In reality, Canadians are victim of social genocide.</p>\n", "date_published": "2021-02-24T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/ruling-class-far-greater-threat/", "url": "https://kiri-vadivelu.ca/blog/ruling-class-far-greater-threat/", "title": "Ruling Class, Far Greater Threat", "content_html": "<p>There’s no gentle way to say it, but the truth is that a lot of us hate our elites far more than we hate some foreign dictator because ruling class is far greater threat to Canada and the United States than a foreign dictator.</p>\n<img alt=\"We cannot feed the poor but we can fund war\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/sLzmQ513Eb-300.jpeg\" width=\"300\" height=\"358\" />\n<p>The Ruling Class Is A Far Greater Threat To Americans Than Russia Is. <a href=\"https://thefederalist.com/2022/02/25/the-ruling-class-is-a-far-greater-threat-to-americans-than-russia-is/?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-ruling-class-is-a-far-greater-threat-to-americans-than-russia-is&amp;utm_term=2022-02-25\">Read More</a></p>\n", "date_published": "2021-02-25T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/greatest-failures-of-human-civilization/", "url": "https://kiri-vadivelu.ca/blog/greatest-failures-of-human-civilization/", "title": "Greatest Failures of Human Civilization", "content_html": "<p>The bankers will ensure we stay in debt. The pharmaceutical companies will ensure we stay sick. The weapons manufacturers will ensure we keep going to war. The media will ensure we are prevented from knowing the truth. The government will ensure all of this is done legally. Sad.</p>\n<img alt=\"Corrupt corporate banks\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/DFdRDW7-Yj-300.jpeg\" width=\"600\" height=\"683\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/DFdRDW7-Yj-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/DFdRDW7-Yj-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-02-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/some-children-are-more-important/", "url": "https://kiri-vadivelu.ca/blog/some-children-are-more-important/", "title": "Some Children are More Important", "content_html": "<p>Before you reserve all your sympathy to children of Ukraine, please know that 67 innocent Palestinian children slaughtered by the Israeli bombing of Gaza last May, but no sanctions: nothing but a handshake. Clearly, they do not look like terrorists. Why are they not important?</p>\n<img alt=\"67 children murdered by apartheid State in 2020\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/36Bvlnyde5-300.jpeg\" width=\"600\" height=\"599\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/36Bvlnyde5-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/36Bvlnyde5-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-02-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/double-standards-of-heroism-in-hypocrisy/", "url": "https://kiri-vadivelu.ca/blog/double-standards-of-heroism-in-hypocrisy/", "title": "Double Standards of Heroism in Hypocrisy", "content_html": "<p>So if you fight your freedom in Ukraine, you are hero but if you do the same in Palestine, you are a terrorist. We need to find out who is setting the standards.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/yAeruhwPRb-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/yAeruhwPRb-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/yAeruhwPRb-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-02-28T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/stand-with-ukraine-people-not-nato/", "url": "https://kiri-vadivelu.ca/blog/stand-with-ukraine-people-not-nato/", "title": "Stand with Ukraine People; Not NATO", "content_html": "<p>No war is good except class war. However, we do not always get to hear the full story in the mainstream media. Our corporate media and elites have an agenda that undermine our democracy and wellbeing of everyone except rulers and corporates.</p>\n<img alt=\"NATO war machine in Ukraine\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/rbLe5Bx04J-300.jpeg\" width=\"600\" height=\"365\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/rbLe5Bx04J-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/rbLe5Bx04J-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>People are kept divided so it makes the life of ruling class easier. It is always the working class majority suffer the most in crisis. Indeed, all workers have many things in common with each other than the rulers, media and the elites. Working class unity is the most threat that fake democratic and elected dictatorship countries are concerned.</p>\n<p>Love your neighbours, love your coworker and know that another worker is not your enemy. Let us build class solidarity. We want to lead by majority representation not the ruling class minority with white supremacy agenda to sell weapons and continue war that destroys all lives on our planet.</p>\n<p>Real people of Ukraine and Russia are the victims of evil supremacy war. Let us not fall for manipulation anymore. If we are united, we can minimize the suffering. Let us build class solidarity, be vigilant and prepare to free all oppressed from the evils. <a href=\"http://www.chinatoday.com.cn/ctenglish/2018/commentaries/202204/t20220402_800281213.html\">Read More</a>.</p>\n", "date_published": "2021-02-28T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/hypocrisy-out-democracy-in/", "url": "https://kiri-vadivelu.ca/blog/hypocrisy-out-democracy-in/", "title": "Hypocrisy OUT, Democracy IN", "content_html": "<p>European Commission sending weapons to Ukraine instead of peace and Israel endorsing the Nazi party are the pinnacle of any hypocrisy can reach.</p>\n<img alt=\"EU Russia hypocrisy\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/8NLaoSH95N-300.jpeg\" width=\"300\" height=\"336\" />\n<p>Do not jump ahead of the line to demand justice for Ukraine over Palestine or people of Donbas.</p>\n<p>Hold all war criminals accountable including Israel and US. Dismantle NATO expansion and nuclear weapons once for all of humanity. We are not gullible anymore.</p>\n", "date_published": "2021-02-28T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-cash-cow-in-action/", "url": "https://kiri-vadivelu.ca/blog/the-cash-cow-in-action/", "title": "The Cash Cow in Action", "content_html": "<p>Over the years, public distrust in our government and big corporations was declining at a rapid rate. As always, elected governments were not representing the majority; instead, advocated for the agenda of the elites and the few at the top. Meanwhile workers were left to die at the frontline to earn poverty wages; squeezed between high cost of food and greedy bankers.</p>\n<img alt=\"Cash cow being milked by big pharma\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/9a7fpcfEIe-300.jpeg\" width=\"600\" height=\"459\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/9a7fpcfEIe-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/9a7fpcfEIe-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>As COVID was pounding on the workers, big Pharma used every tool available at the arsenal to collude with the government to empty our tax dollars. Big Pharma was really concerned with public safety because their eyes were locked onto the jackpot. Rather than using the tax money to properly fund our education, public services and improve the lives of vulnerable people, government handed the jackpot to big Pharma so they can live happily ever after while our lives become more miserable.</p>\n<p>Whenever government give away our tax payer dollars to corporations and war, no one asked who is paying for it?</p>\n<p>Endless vaccines, who is paying for it? Weapon donations, who is paying for it? People have all the reason to be outraged and they did through peaceful demonstrations. Sadly, our government arrested, charged and demonized people. All for what? So they can keep big Pharma happy and launch more rockets to space instead of funding our hospitals.</p>\n<p>When people ask government to pay for education and social programs, the response is no but they had all the money for endless vaccines and destruction of our planet. People are not gullible anymore. We do not trust that ruling party has any interest in protecting the working people. The greatest transformation and reorganization of our society is necessary to protect everyone. Let us not fight each other, let us unite to protect each other from the common enemy.</p>\n", "date_published": "2021-03-01T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/victims-of-lies-deception-and-cruelty/", "url": "https://kiri-vadivelu.ca/blog/victims-of-lies-deception-and-cruelty/", "title": "Victims of Lies, Deception and Cruelty", "content_html": "<p>What we know is very little compared to what we do not know. Without COVID and Putin, we may never have known the real face of our corporate media, government and the lies. The pandemic driven social awakening was elegantly silenced through redistributing hate against Russia. Without corporate media support and the black suites, our capitalist government would be illegitimate.</p>\n<img alt=\"Extreme difference between reality and mass media\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/_y_S0DFBzf-300.jpeg\" width=\"600\" height=\"454\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/_y_S0DFBzf-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/_y_S0DFBzf-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-03-02T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/hidden-agenda-of-ukraine-crisis/", "url": "https://kiri-vadivelu.ca/blog/hidden-agenda-of-ukraine-crisis/", "title": "Hidden Agenda of Ukraine Crisis", "content_html": "<p>After failing to stop Russia from invading Ukraine, the western countries and their media outlets have unleashed a propaganda war that involves sharing old pictures from past conflicts to demonise Russia and lavishing praises on Ukrainian leadership for standing its ground against the invasion, seemingly to paper over their own inadequacies.</p>\n<img alt=\"Putin replaced COVID\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/LEAQINjzym-300.jpeg\" width=\"600\" height=\"494\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/LEAQINjzym-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/LEAQINjzym-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Winning ‘hearts’ and PR war, but Ukraine has a “Nazi” problem that NATO and USA do not talk about. <a href=\"https://www.opindia.com/2022/02/ukraine-dalliance-with-nazi-forces-problem-that-nato-and-usa-do-not-talk-about/\">Read More</a></p>\n", "date_published": "2021-03-02T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-politics-of-divide-and-conquer/", "url": "https://kiri-vadivelu.ca/blog/the-politics-of-divide-and-conquer/", "title": "The Politics of Divide and Conquer", "content_html": "<p>Racism exists because we accept racist standards. Due to imbalance of power, the oppressed cannot challenge the oppressor. After 2000 years, we still have government officials in Poland not shamed to admit racist decisions that were used to deny muslims and African refugees of Ukraine. The ruling class does very little to address racism because division and conquer is the pillars of modern politics. Do we need a class war to free all those oppressed?</p>\n<img alt=\"Political divide in human empathy\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/R-U_0Sf7kZ-300.jpeg\" width=\"600\" height=\"374\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/R-U_0Sf7kZ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/R-U_0Sf7kZ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2021-03-03T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/believe-the-lies-to-avoid-prison/", "url": "https://kiri-vadivelu.ca/blog/believe-the-lies-to-avoid-prison/", "title": "Believe the Lies to Avoid Prison", "content_html": "<p>Western media hypocrisy has reached new levels. No one is allowed to speak the truth, if you do, expect to be labelled Russian or communist. It beg the question, what is wrong with Russian or communism? If a communist nation was able to defeat the Hitler Nazis, they must have something better than what capitalism offers.</p>\n<img alt=\"Corporate media misinformation\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/RuajjQruZF-300.jpeg\" width=\"600\" height=\"436\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/RuajjQruZF-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/RuajjQruZF-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Instead of being grateful for the sacrifices of great Russian working class soldiers, western media has been building hate and misinformation toward the Russians. While portraying Russians as evils in the Hollywood and video games, US have been committing the worst crimes against humanity in the poorest parts of the world. Apartheid state Israel and US have been killing civilians overseas using advanced military drone system violating every international rule of law.</p>\n<p>When a capitalist country such as US uses the word “Democracy, Freedom or Justice” every citizen needs to be outraged. Democracy means elected dictatorship to commit violence. Freedom means social manipulation to feed lies. Justice means legalized cruelty to humanity and our planet. That is how our colonial system works.</p>\n<p>Colonial capitalism falls apart when people start to ask questions.</p>\n", "date_published": "2021-03-04T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/demons-of-peace-sri-lanka-to-ukraine/", "url": "https://kiri-vadivelu.ca/blog/demons-of-peace-sri-lanka-to-ukraine/", "title": "Demons of Peace - Sri Lanka to Ukraine", "content_html": "<p>In 1947, when the last colonizer British left Ceylon, they handed the power over to the majority of the country. The majority 85% were Sinhalese while less than 15% were Tamils. British favoured Tamils over the majority Sinhalese to lead the country for variety of reasons; however, abruptly left without any framework to run the country with 20 million people. During British occupation, Tamils enjoyed close connections to British administrations and were employed in high ranking roles. That embroiled bitter taste in the majority Sinhalese administrations. The ring wing Sinhalese majority seized power and began crushing the Tamil minority through all legal means to make Tamils secondary citizens.</p>\n<img alt=\"Comrade Theepan on Hunger Strike\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/d3e1teNshJ-300.jpeg\" width=\"600\" height=\"405\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/d3e1teNshJ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/d3e1teNshJ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Out of frustrations, Tamils took to the streets and protested against all illegal laws. In 1983, named black July after thousands of peaceful Tamil protesters were shot and killed by the Sinhalese military forces. While the unrest was in progress, cities were on fire, Tamils were mass prisoned, tortured and killed in the prisons. The cruel Sinhalese government stripped clothes, fed poisoned food, pulled eyes out, raped women, cut off testicles, burnt children and disabled many Tamil protesters while in the prison camps similar to Hitler treatment of Jewish in Germany. Many died in the prison camps which expanded civil unrest and Tamils formed military out of necessity.</p>\n<p>In the midst of civil war, as a young student of University of Jaffna, Thileepan Rasaih aka comrade Theepan took to the street to protest against apartheid Sri Lanka government. He resisted peacefully and placed his life on the line through hunger strike to seek fair negation with the ruling party. He positioned himself in the city where I was born, played and grow up to live free one day. Unlike he desired, justice did not prevail, he was left to die on the street and I was not able to live free either. On September 26, 1987, his death ended the hunger strike without any solution to the civil unrest. I was a toddler at the time and did not know anything. It pains to imagine his loss through my parents.</p>\n<p>Comrade Theepan demanded the following five demands in order to end the hunger strike.</p>\n<ol>\n<li>\n<p>withdraw Sinhalese army camps from Tamil areas,</p>\n</li>\n<li>\n<p>suspend all rehabilitation work until the formation of an interim (Tamil) government for the Tamil homelands,</p>\n</li>\n<li>\n<p>stop the continuing Sinhala colonization in the Tamil homeland,</p>\n</li>\n<li>\n<p>halt the setting up of Sinhala-manned police stations in Tamil areas and</p>\n</li>\n<li>\n<p>release all detainees held under the Prevention of Terrorism Act</p>\n</li>\n</ol>\n<p>None of his demands were addressed. Day after day his health declined which made him quieter. He refused to drink even water till colonizer act on compassion. He fought till the last breath while holding the mic in front of thousands.</p>\n<p>Comrade Theepan lost fighting the holiest battle any man can fight to liberate the oppressed from the evils. He lives forever in my heart to remind that the best of any humans for do for others. Christ may have died for all but I know Theepan died for me.</p>\n<p>Unlike what you are being told, Comrade Theepan did not ask for ammunition nor provoked any violence against the Sinhalese colonizers. What happened afterwards is what imperialist wants to talk about; yes, I regret that as well. My heart breaks every time when I think about his sacrifice, he is my hero.</p>\n<p>Tamils were unable to win on compassionate grounds against Sinhalese colonizers and were forced to rebel at any means necessary to protect the life and liberty. After 30 years of guerrilla warfare, the Tamil liberation was overpowered in May 2009 using international coalition of nine imperial governments most notably apartheid.</p>\n<p>I do not endorse war or violence; however, history indicates that colonizers of all kinds do not loosen the grip until knife is placed on their neck. Remember, Nelson Mandela was once a terrorist till the label became inconvenient for the imperialist agenda. No one free till all the oppressed are free.</p>\n", "date_published": "2021-03-06T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/rise-of-palestine-against-apartheid-state/", "url": "https://kiri-vadivelu.ca/blog/rise-of-palestine-against-apartheid-state/", "title": "Rise of Palestine Against Apartheid State", "content_html": "<p>When apartheid state is getting caught with pants down, I am not complaining. Viva viva Palestine. Kudos to the Irish MP Richard Boyd Barrett exposing the crimes.</p>\n<img alt=\"Irish MP Richard Boyd Barrett\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/D9wuDv95rS-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/D9wuDv95rS-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/D9wuDv95rS-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Watch the speech on Youtube. <a href=\"https://www.youtube.com/watch?v=R4Pd4Yt2buc&amp;t=3s\">video</a>.</p>\n", "date_published": "2021-03-06T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/root-of-all-conflicts-apartheid/", "url": "https://kiri-vadivelu.ca/blog/root-of-all-conflicts-apartheid/", "title": "Root of All Conflicts ‘Apartheid’", "content_html": "<p>Apartheid is the Afrikaans word for ‘apartness’, originally used to describe the system of racial discrimination that existed in South Africa until 1994. The term apartheid is not only a reference to South Africa’s former regime; it is used in international law to describe a category of regime, defined in the United Nations (UN) International Convention on the Suppression and Punishment of the Crime of Apartheid (1973), to which more than 100 states are a party.</p>\n<img alt=\"No jab no job apartheid system\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/qQi6Z4u3F8-300.jpeg\" width=\"600\" height=\"596\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/qQi6Z4u3F8-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/qQi6Z4u3F8-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The Rome Statute defines the Crime of apartheid as: “inhumane acts...committed in the context of an institutionalized regime of systematic oppression and domination by one racial group over any other racial group or groups and committed with the intention of maintaining that regime.”</p>\n<p>What are some misconceptions of Apartheid?</p>\n<p>Apartheid laws are the root of all evils. And, all conflicts are interconnected from Palestine to Ukraine. Basic knowledge and awareness are key to fight against injustice and to build peace at home and abroad.</p>\n<p>Anti-Semitism is a law that protect Jewish people against hate crimes. When we oppose zionism and apartheid, we must be clear not to prejudice Jewish people. Indeed, most Jewish people are oppose to zionism and apartheid but refrain from speaking out due to repercussions from their own kind.</p>\n<p>We need to be careful not to let opportunists such as US and NATO to further escalate the tensions in Ukraine for profit. The western media has been the biggest tool of war propaganda that needs to be trashed to gain factual information.</p>\n<p>What are example of apartheid manipulation?</p>\n<p>We must take sides instead of exercising the privilege to be neutral. Wise to stand with the oppressed; not the one oppressing in order to seek truth.</p>\n<p>To call for peace in Ukraine over Palestine is another apartheid; that we should be cautious. To call for vaccination passport over the pandemic vaccination is also apartheid; that we should be cautious.</p>\n<p>People of Palestine have been fighting against apartheid State and we all need to support or at least recognize the legitimacy of the sacrifices of Palestine people. Until all people of Palestine win back their lands against the criminal state and seize all the means of production at Israel, the fight for justice continues.</p>\n<p>Apartheid state Israel is a bad influence to all evil rulers such as zionist leader Zelensky to commit atrocities in Donbass regions of Ukraine which lead to Russian invasion. Taking Palestine lands back from Apartheid state is the beginning of world peace.</p>\n<p>Why do we refer to Israel as an apartheid state?</p>\n<p>There is overwhelming evidence that the system instituted by the Israeli government against the Palestinian people meets the UN definition of apartheid.</p>\n<p>In effect, Israel and the occupied Palestinian territory constitute one territorial unit under full Israeli control. Palestinians constitute around half of the total population inside Israel, yet under Israeli law, and in practice, Jewish Israelis and Palestinians are treated differently in almost every aspect of life: housing, education, health, employment, family life, residence, and freedom of movement. Dozens of Israeli laws and policies institutionalize this prevailing system of racial discrimination and domination.</p>\n<p>Segregation is carried out by implementing separate legal regimes for Jewish Israelis and Palestinians living in the same area. In the occupied West Bank, Jewish Israeli settlers living in illegal settlements are governed by Israeli civil law, while Palestinians also living in the West Bank are governed by Israeli military law.</p>\n<p>Israel carries out various acts that are prohibited by the UN Apartheid Convention including:</p>\n<p>Forcible transfer of Palestinians to make way for illegal Israeli settlements.</p>\n<p>Preventing Palestinians from returning to their homes and lands (including millions of refugees living in exile).</p>\n<p>Systematic and severe deprivation of fundamental human rights of Palestinians based on their identity.</p>\n<p>Denying Palestinians their right to freedom of movement and residence (especially, but not limited to Palestinians in the Gaza Strip).</p>\n<p>Murder, torture, unlawful imprisonment and other severe deprivation of physical liberty.</p>\n<p>Persecution of Palestinians because of their opposition to apartheid.</p>\n<p>Remember to use the term ‘apartheid’, ‘apartheid state’ or ‘apartheid state Israel’ to describe Israel. The criminal nature of apartheid Israel exists even in the naming convention to confuse and diffuse attention. If you find the name difficult to spell or mind boggling, feel free to use the short form ‘Apartheid’.</p>\n<p>If school or workplace penalize you, educate them. None of us are comfortable with the treatment of women and children in Palestine. If you read to the last line, please know, you are beautiful.</p>\n", "date_published": "2021-03-07T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/what-is-the-nature-of-zionism/", "url": "https://kiri-vadivelu.ca/blog/what-is-the-nature-of-zionism/", "title": "What is the Nature of Zionism?", "content_html": "<p>Anti-Semitism is a law that protect Jewish people against hate crimes. When we oppose zionism and apartheid, we must be clear not to prejudice Jewish people. Indeed, most Jewish people are oppose to zionism and apartheid but refrain from speaking out due to repercussions from their own kind.</p>\n<img alt=\"Criminal nature of Zionist movement\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/vpzBkq2hEW-300.jpeg\" width=\"300\" height=\"232\" />\n<p>Zionism employs apartheid laws, that are the root of all evils. And, all conflicts are interconnected from Palestine to Ukraine, manufactured based on lies. Basic knowledge and awareness of Zionism is key to fight against injustice and to build peace at home and abroad.</p>\n<p>Zionism ensure masses are incapable of finding the roots of lies. Like any onion layers, principles of Zionism appears to be something but when one start to analyze, all are just layers without any content. Indeed, the layers made up of lies are the actual content.</p>\n<p>Zionists silence all critics legally, economically and politically. And; therefore, apartheid laws can be passed without any push back. The story of holocaust is often repeated when criticism surface even though all minorities faced genocide at some point and still continues in the hands of their oppressors.</p>\n<p>Advocates of Zionists are often ill motivated to pursue and guard their apartheid agenda at all cost. Zionists do not engage directly but operate in the shadow. The darkest nature of Zionism does not evolve with rest of the society but always remain a mystery.</p>\n", "date_published": "2021-03-08T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/mutation-of-toxic-racism-in-ukraine-crisis/", "url": "https://kiri-vadivelu.ca/blog/mutation-of-toxic-racism-in-ukraine-crisis/", "title": "Mutation of Toxic Racism in Ukraine Crisis", "content_html": "<p>According to Oxford, racism is a prejudice, discrimination or antagonism directed against someone of a different race based on the belief that one’s own race is superior.</p>\n<img alt=\"Racism evolves to become toxic racism\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/m3qm61dAdl-300.jpeg\" width=\"600\" height=\"588\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/m3qm61dAdl-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/m3qm61dAdl-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>In most parts of the world, humans have evolved to know that racism is false believe system based on lack of social and cultural awareness. But, why does racism continue to exist and influence personal and policy decisions? Like COVID, racism mutates.</p>\n<p>The racism does not always have to originate from negative connotation. Indeed, the racism exists because of positive mutation. Racism mutates to exist in more acceptable, subtle and unconscious manner in modern society.</p>\n<p>An example of positive mutation of toxic racism is selective expression of empathy. For instance, expressing condolences to loss of lives in Ukraine over Palestine, Iraq, Syria, Libya or Yemen is a positive mutation of racist behaviours.</p>\n<p>The real change comes from understanding the root cause of racism. Racism is an integral part of violent colonial capitalist economy. The key is that we need to be careful when someone compliments or express grief, elements of racism needs to be sanitized before interaction.</p>\n", "date_published": "2021-03-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/real-definition-of-under-developed-phrase/", "url": "https://kiri-vadivelu.ca/blog/real-definition-of-under-developed-phrase/", "title": "Real Definition of &#39;Under Developed&#39; Phrase", "content_html": "<p>The term “developed” to describe Europe and North American countries undermine the human advancement in Asia, Middle East and African countries. Due to repeat colonization and wars, those countries did not have the opportunity to protect the development or advance civilization. To use the word “developing” without accompanying exploitation is an act of discrimination.</p>\n<img alt=\"Under developed or over exploited countries\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/XT4uTeKYdp-300.jpeg\" width=\"600\" height=\"742\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/XT4uTeKYdp-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/XT4uTeKYdp-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The picture illustrate the difference between democracy before and after United States dropped diplomacy from the sky. Iraq, Libya, Yemen and Syria were pushed back 100 years of human advancement due to US democracy installation. People of North America and Europe would never have allowed such cruelty to poorest parts of the world had they knew.</p>\n", "date_published": "2021-03-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/racism-in-modern-policing-culture/", "url": "https://kiri-vadivelu.ca/blog/racism-in-modern-policing-culture/", "title": "Racism in Modern Policing Culture", "content_html": "<p>The woman who works as cashier to earn minimum wage in order to feed the kid that police view as criminal is set to struggle; not overcome. If Toronto Police really care about the well being of women lead families, do the right thing, stop treating blacks and minority as criminals.</p>\n<img alt=\"Toronto Police on women's day recruitment\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ymuRR2FET8-300.jpeg\" width=\"600\" height=\"778\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ymuRR2FET8-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ymuRR2FET8-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Poor remain poor because resources are misplaced intentionally. Do not misplace your judgement, actively combat racism everyday, otherwise nothing will change for the better. The uniform you wear starting to stink since COVID evictions.</p>\n", "date_published": "2021-03-11T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/what-is-hypocrisy-in-social-media/", "url": "https://kiri-vadivelu.ca/blog/what-is-hypocrisy-in-social-media/", "title": "What is Hypocrisy in Social Media?", "content_html": "<p>Hypocrisy is the practice of claiming to have higher standards or more noble believes than is the case. Simply put, a self serving false believe system of positive, negative and neutral positions. Often, hypocrisy goes unchallenged but closely associated with lies and rumours.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/JWz5qQ1svg-300.jpeg\" width=\"600\" height=\"542\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/JWz5qQ1svg-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/JWz5qQ1svg-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Due to constant exposure to hypocrisy in media and social situations that fit the narrative, most people tend to accept the hypocrisy as a way of life. Like junk food, individuals need to be intentional about rejecting hypocrisy in order to preserve sanity.</p>\n<p>An example of positive hypocrisy is calling to free Ukraine while wanting to lockdown unvaccinated neighbours. Just because collective public safety out weighs the individual choice, that does not mean individual rights can be compromised.</p>\n<p>An example of negative hypocrisy is calling to free Ukraine while justifying countless war crimes of United States. Just because war is evil in Ukraine does not mean war is good, acceptable or necessary elsewhere.</p>\n<p>An example of neutral hypocrisy is supporting the individual right to un-vaccination while denying the right to abortion. Just because neutral hypocrisy is socially acceptable, that does not mean hypocrisy is not harmful to the wellbeing of all.</p>\n<p>The ideal is to investigate the narratives and then to stand with the oppressed everywhere.</p>\n", "date_published": "2021-03-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/human-rights-if-you-can-afford/", "url": "https://kiri-vadivelu.ca/blog/human-rights-if-you-can-afford/", "title": "Human Rights if You Can Afford", "content_html": "<p>If human rights whether employment, housing or any in Ontario, do not waste time with Ontario Human Rights Tribunal (OHRT). The best solution is to go public if you can and join a movement. OHRT exist to protect the interest of the political party in power, not your human rights. They are appointed through elected government to play the game according to instructions.</p>\n<img alt=\"Ontario Human Rights Tribunal system\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Ov8ZV1dUcp-300.jpeg\" width=\"600\" height=\"778\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Ov8ZV1dUcp-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Ov8ZV1dUcp-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>If you feel human rights no longer exist in housing or employment, you are not alone and you are correct. Rights exists to those who can afford for variety of reasons.</p>\n<p>If you seek free lawyers or legal aid, you do not get representations, you get advice that makes you feel sick. The system is designed that way so no real change can happen.</p>\n<p>If you are lucky and end up getting a representation for free, do not expect much. The license of lawyers, paralegals and other sectors are used to ensure no real change is demanded.</p>\n<p>If the license holder demands real change or expose corruption in the system, their livelihood is in jeopardy. Mostly no one except license holders are allowed to represent in tribunal.</p>\n<p>Since low income people cannot afford real representation, employers and housing system exploit the vulnerable population without worrying about potential legal consequences.</p>\n<p>Now and then some headlines in the mainstream media makes everyone feel as human rights exist and our system is working for everyone. Do not be fooled, listen to your inner voice.</p>\n<p>I was subject to harassment at workplace and forced to register with OHRT in March 2020, against manager Marc Eskander and Radko Radkov supervisor at Securitas Canada (Mobile) where I was employed for 10 years. After complaint, company retaliated by not providing any safety equipments such as masks and gloves to work during the COVID lock-down.</p>\n<p>I exercised my right and I was terminated. My union was so weak and refused to provide any help or process the grievance. The Labour Relations Board and Occupational Health and Safety administration made sure my employer does not get caught.</p>\n<p>Instead of using my case to improve my workplace, OHRT dismissed my case. I did not abandon my case, I simply did not accept their intent to dismiss my case. My former coworkers are still upset nothing improved after 2 years of misery.</p>\n<p>I will be sharing all evidences and details of my case in the near future. From electoral system to public administration, all services are corrupted, not all individuals but system.</p>\n<p>Our tax dollars are used to deny services to those in need and punish those who demand change. Do not be too naive like me, listen to your inner voice.</p>\n<p>I learnt the truth the hard way, that if you belong to working class, you have no rights in Ontario. If you want change, you must fight. No one should suffer the consequences I suffered for standing up to do the right thing, thats why I share my story.</p>\n<p>Note: If you cannot help, thats understandable but do not hurt those who speak up without knowing the elements of social and economical privilege under any circumstances.</p>\n", "date_published": "2021-03-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/reality-of-how-people-get-rich/", "url": "https://kiri-vadivelu.ca/blog/reality-of-how-people-get-rich/", "title": "Reality of How People Get Rich", "content_html": "<p>The perspective of how people get rich is completely misunderstood but no one wants to challenge the norm. Statistically, an average person cannot work to become millionaire; yet, we believe the false narrative because it feels good.</p>\n<img alt=\"Illustration of how people get rich\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/atKUypCUDi-300.jpeg\" width=\"600\" height=\"593\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/atKUypCUDi-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/atKUypCUDi-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>At the same time, if one was to question the quality of narrative, that leads to social awkwardness; therefore, we are coerced to accept the argument in face value.</p>\n<p>According to rich people, the secret is hard-work, gumption and can do positive mindset. In reality, individuals are born into wealth or merciless exploitation of the working class.</p>\n<p>So, what should we do about it? We must reject the false narrative. When we passively accept the myth to avoid social discomfort, in return, that make us feel less contributing members and submit to the oppressing class of society.</p>\n<p>The subconscious mind plays an important role in our health, happiness and outlook of life.</p>\n", "date_published": "2021-03-14T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/white-advantage-of-the-holocaust/", "url": "https://kiri-vadivelu.ca/blog/white-advantage-of-the-holocaust/", "title": "White Advantage of the Holocaust", "content_html": "<p>When apartheid Israel restricted Ukraine refugees fleeing war, the inhumane decision not only received international condemnation but also encouraged to revisit the era of holocaust.</p>\n<img alt=\"White privilege on stolen land\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/2Rj6RUUfHU-300.jpeg\" width=\"600\" height=\"799\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/2Rj6RUUfHU-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/2Rj6RUUfHU-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The reality of 80 million blacks murdered in United States during the civil war is gruesome if not more, than the 6 million Jews killed in Germany. Unlike Jews, the black community continue to experience the repercussion of racial discrimination.</p>\n<p>Many scholars did not challenge the narratives of holocaust theoretically. To minimize unintended consequences, all of the claims were accepted as claimed at face value even in international court cases. Historically, when people suffer injustice, compassion is shared mutually without conditions.</p>\n<p>However, the choice to accept all Jews with cap on non-Jews from Ukraine reveal that apartheid state only have compassion for their own kind. Furthermore, the attitude of zionist Jews toward black and the minority community echoes the similar sentiments.</p>\n<p>White people enjoy white privilege; precisely, zionist jews enjoy white privilege and use holocaust to suppress all voice of injustice. Therefore, the zionist Jews must have lot of white privilege balls to stand on this stolen and occupied continent and to complain about immigration.</p>\n", "date_published": "2021-03-16T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-rapid-rise-of-fascism-in-india/", "url": "https://kiri-vadivelu.ca/blog/the-rapid-rise-of-fascism-in-india/", "title": "The Rapid Rise of Fascism in India", "content_html": "<p>Unlike what is believed to be, Hinduism is not a religion, it is a way of life. Eventually, the practice of Hinduism became a disciplined religion. Not only Hinduism is the oldest religion in the world but many advancement of modern civilization roots back to Hindu way of life.</p>\n<img alt=\"Rising fascism in India\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/6-zLWyuR4d-300.jpeg\" width=\"600\" height=\"399\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/6-zLWyuR4d-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/6-zLWyuR4d-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>While early doctrine of Hinduism was promising for the eternity of lives; it also revealed the potential to demise and destruct the nature of humanity. The human interpretation of god and drafting variation of Hindu gods among different regions and tribes could be seen as the path of demise.</p>\n<p>From the beginning of civilization, the practice of Hinduism mandated the harmony relationship among different faith, believes and systems. Although, individual and group conflicts existed among Hindus, the universal and harmony nature of Hinduism ensured all to exist peacefully.</p>\n<p>Indeed, Hindus admire other religions such as Islam, Christianity, Buddhism and Judaism even though forced conversions existed in the early colonization period. In the span of last 500 years, some Hindus chose to practice Islam during Mogul Empire and later Christianity during British Empire.</p>\n<p>The term “developed” to describe Europe and North American countries undermine the human advancement in Asian countries such as India. Due to repeat colonization and wars, Asian countries did not have the opportunity to protect the development. To use the word “developing” to describe India without accompanying colonization is a discrimination.</p>\n<p>Since over 80 percent of population were Hindus, the woke Hindus formed nationalistic movement to seize power. Religion is a powerful tool; which can be used both right and wrong ways in politics - Hinduism is not immune from misapplication. Today, the Hindu national movement plays the British Empire playbook to divide and conquer because it works.</p>\n<p>The birthplace of Hinduism is facing the threat of extinction at the hands of Hindu nationalism. The island known as Ceylon just 32 km south of India lost the grip of the country after electing Sinhalese nationalistic government. The Hindu nationalistic movement driven by the ambition to eradicate minorities; particularly Muslims from India is a betrayal to all people of India.</p>\n<p>The toxic movement even casted shadow on the former rebel leaders of Tamil Eelam to discriminate Muslims in Sri Lanka. A terrible mistake that rebel leaders quickly realized and issued apology to Muslim communities. Likewise, the fascist Hindu national movement is an existential threat to democracy in India.</p>\n", "date_published": "2021-03-18T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/deception-is-disgust-not-intelligence/", "url": "https://kiri-vadivelu.ca/blog/deception-is-disgust-not-intelligence/", "title": "Deception is Disgust; Not Intelligence", "content_html": "<p>Deception is an action of deceiving someone for one’s benefit. Historically, legal system is created to make sure those cannot speak to have their voices heard and rights protected. Today, justice system is built on deception to protect the criminals; hence, criminal justice system.</p>\n<img alt=\"Edward Snowden and Julian Assange\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ULv7gJumiZ-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ULv7gJumiZ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ULv7gJumiZ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Court is a place where victim go for justice; however, colonial courts do not preserve justice. The entirety of legal system that thrives on deception and violence is a disgrace to democratic society. Truth does not win cases; nor judge knowing lies protect the innocent.</p>\n<p>To study law, one does not require intelligence but the ability to deceive opponent or tinker colonialism for the benefit of corporate interest. Only one universal language that provides such tools of deception is English. Without English, legal framework built on the core of zionism would fall apart.</p>\n<p>For instance, an American citizen Edward Snowden concerned about civil liberties of fellow Americans is considered a criminal. Likewise, an Australian citizen Julian Assange exposed the crime as evil. No one is free till both innocent global citizens are freed from actual criminals.</p>\n", "date_published": "2021-03-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/exploring-social-class-in-warfare/", "url": "https://kiri-vadivelu.ca/blog/exploring-social-class-in-warfare/", "title": "Exploring Social Class in Warfare", "content_html": "<p>All wars are evil expression of human kind. The military complex of any nation is a well organized and operated structure of destruction employing modern weapons and trained to kill combatants. A relentless of pursuit of worst of humanity can achieve disguised as protection of civilization.</p>\n<img alt=\"War is evil but class is not\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/hA5EWvdft3-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/hA5EWvdft3-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/hA5EWvdft3-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The war between Ukraine and Russia helps analyze the thinking process of social class in modern society. The actual winners and losers of warfare can be understood through the lens of owner class, ruling class and working class. Owner class does not fight any battle but reaps all the benefits of conflicts. Those who own shares in weapon industry can be classified as the owner class.</p>\n<p>The ruling class, who are in political power, ensure the interest of the owner class is protected at all cost and working class submit to all demands of the system. Meanwhile, the working class are the majority who are obligated to work and earn pay cheque for living. Only exception is that police are traitors of working class; both earn pay-cheque and take orders from the ruling class to oppress the working class.</p>\n<p>Based on the classification system, ruling class does not benefit directly from the wars. However, ruling class require expressing the interest of the owner class to remain in power. For instance, Deputy Prime minister of Canada, Chrystia Freeland attending Ukraine support rally to carry Ukraine flag is an expression of owner class interest; instead of anti-poverty flag.</p>\n<p>Although, true solution to the Ukraine Russia war is on the table, ruling class of all nations would advocate for war mongering efforts. For instance, sending weapons to conflict zone under the banner of peace and democracy to promote war is the perfect irony of all rather than de-escalation through peaceful resolutions.</p>\n<p>Since owner class and ruling class of Ukraine are protected, imperial war is beneficial even for the losing side in the conflict. Of course, such structure requires the preservation of cult cultures and predatory characteristics of individuals. Is that the best humans can achieve collectively after 2000 years of civilization? There is no pride left to admit the shame and guilt of any conscious mind.</p>\n", "date_published": "2021-03-21T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/thinking-process-of-political-hierarchy/", "url": "https://kiri-vadivelu.ca/blog/thinking-process-of-political-hierarchy/", "title": "Thinking Process of Political Hierarchy", "content_html": "<p>The war between Ukraine and Russia helps analyze the thinking process of social class in modern society. The actual winners and losers of warfare can be understood through the lens of owner class, ruling class and working class. Owner class does not fight any battle but reaps all the benefits of conflicts. Those who own shares in weapon industry can be classified as the owner class.</p>\n<img alt=\"Corporate solutions to economic inequality\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/uM__IxuSUv-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/uM__IxuSUv-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/uM__IxuSUv-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The ruling class, who are in political power, ensure the interest of the owner class is protected at all cost and working class submit to all demands of the system. Meanwhile, the working class are the majority who are obligated to work and earn pay cheque for living. Only exception is that police are traitors of working class; both earn pay-cheque and take orders from the ruling class to oppress the working class.</p>\n<p>Unfortunately, corporate solutions to economic inequality is far worse than communist tyranny.</p>\n", "date_published": "2021-03-22T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/apologies-to-freedom-convey-canada/", "url": "https://kiri-vadivelu.ca/blog/apologies-to-freedom-convey-canada/", "title": "Apologies to Freedom Convey Canada", "content_html": "<p>As a left wing activist, I joined the mainstream narrative to discredit the legitimate concerns of the freedom convey movement. I am offended at my stupidity and regret my actions. I want to say that I am really sorry to all those I treated with disrespect for not taking vaccinations. Indeed, I was mocking at the people who were defending my interest.</p>\n<img alt=\"Toronto assaulting a peaceful protester\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/wIPSzTZFsi-300.jpeg\" width=\"600\" height=\"382\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/wIPSzTZFsi-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/wIPSzTZFsi-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Because of the ideological differences, I demonized the people who thought differently and did not understand the concerns completely. Vaccination should be a choice; not a control mechanism. I am not shamed to admit that I was misled by the mainstream media, for profit corporations and elected tyrants of our country.</p>\n<p>On the first few days of the protest, I hated the movement. As days went on, I was able to reflect on my experience of COVID eviction at the hands of greedy corporate landlord. My family had to face the consequence of COVID while corporations only cared about profit. I was moved when I saw the old man; who was like my father, holding freedom sign being bruised by police.</p>\n<p>Not only I felt shame and regret, I realized we have the common enemy. The enemy of people are elected tyrants working for the interests of the big corporations. We do not have to agree with each other but we can help each other achieve the best of humanity. Let us unite and fight against the common enemy of people.</p>\n", "date_published": "2021-03-23T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/god-is-in-the-details/", "url": "https://kiri-vadivelu.ca/blog/god-is-in-the-details/", "title": "God is in the Details", "content_html": "<p>As they say, devil is in the details so do god. Our social pragmatics fail at the interpretation of god, miserably. The path to heaven paved with misinterpretation to false preaching and skewed perspective of the creator. No spiritual journey can be accomplished without right information at disposal. People united can never be defeated; that is the real insecurity of all power that intend to keep everyone divided.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/klevO2F-MT-300.jpeg\" width=\"600\" height=\"445\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/klevO2F-MT-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/klevO2F-MT-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>When one step out of the rituals, understanding the direction of the crowd become easier. Ancestors never demanded anyone to stop thinking or evolve with the nature. Never a sin to build relationship with god based on trust and respect; instead of fear alone. One shall rest on god for things that cannot be controlled but free from fear on things under one’s control.</p>\n<p>The mighty god do not have labels though humans had to divide in order to conquer such as Hindu, Islam or Christian. Nonetheless, humanity was the ultimate religion but the interpretation have caused the conflict everywhere. When one is ready to take off the glasses, the true meaning of god is to be experienced. Religion help the rulers but unity help everyone to liberate from the oppression.</p>\n<p>A true believer is more valuable than a thousand blind followers. Freedom to practice a religion also mean to ask questions. To seek truth, one require freedom to understand new perspectives. That means to ask questions in order to become true followers of any practice. No tyranny will come to free us but only we can liberate ourselves for freedom, equality and justice on a muddy ground.</p>\n", "date_published": "2021-03-24T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/canada-get-out-of-nato-war-machine/", "url": "https://kiri-vadivelu.ca/blog/canada-get-out-of-nato-war-machine/", "title": "Canada Get Out of NATO War Machine", "content_html": "<p>Real solution to the Ukraine Russia war is on the table; yet, ruling class of all NATO nations are advocating for war. For instance, sending weapons to conflict zone under the banner of peace and democracy is the perfect irony of all.</p>\n<img alt=\"Canada out of NATO\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/HtH_Z7w1Ju-300.jpeg\" width=\"300\" height=\"332\" />\n<p>Rather than de-escalation through peaceful resolutions as China and India suggest, NATO is promoting WW3 in Europe. NATO is a war mongering agency that needs to be dismantled before a nuclear countries go head to head.</p>\n<p>Blood thirsty Americans do not care about human lives, track record reveals. NATO is not formed to protect but to kill the planet under the impression of diplomacy. NATO is the new Hitler.</p>\n", "date_published": "2021-03-25T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/bollywood-politics-to-real-democracy/", "url": "https://kiri-vadivelu.ca/blog/bollywood-politics-to-real-democracy/", "title": "Bollywood Politics to Real Democracy", "content_html": "<p>During the free fall of British Empire, the visionary Mahatma Gandhi helped liberate India from the British colonizer in 1947. After 70 years of democracy, India is yet to find a place on the map other than population statistics. Imperial socialist China was able to lift Chinese out of the darkness utilizing the greed of American corporations. While the hostile nature of big American corporations continue to bring enormous opportunity to India; India’s ability to harvest the greed would dictate the future.</p>\n<img alt=\"Bollywood to politics in India\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/cSm5Vl3_z8-300.jpeg\" width=\"600\" height=\"429\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/cSm5Vl3_z8-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/cSm5Vl3_z8-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\nFor long time, Bollywood and cricket has been a distraction tool for the Indian political elites to rule the country. However, COVID19 has disrupted the status quo of cinema sports glamorization. After 50 years, caste and religion, that fuelled the Brahmin’s joyride to public office have reached the melting point. Therefore, India need another visionary to stir way from potential corruption without falling into fascism. Simultaneously, India’s ability to cultivate the greed of American corporations would be a greater victory.\n", "date_published": "2021-03-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/rest-in-peace-ndp-labour-party/", "url": "https://kiri-vadivelu.ca/blog/rest-in-peace-ndp-labour-party/", "title": "Rest in Peace NDP Labour Party", "content_html": "<p>New Democratic Party of Canada (NDP) represented more than 85 percent of Canadians who were wage earners in the country. The orange colour even visible at night became a household symbol in early 1960 when workers were building the country after double world wars.</p>\n<img alt=\"Liberal NDP unification\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/5cp83p_Ujq-300.jpeg\" width=\"600\" height=\"448\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/5cp83p_Ujq-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/5cp83p_Ujq-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Officially, Canada has lost one and only left political party that suppose to represent the issues of all workers. NDP Singh propped up the failing Liberal Party at the most crucial times in Canadian history. The joint venture achieved nothing for Canadians but betrayal of working class people.</p>\n<p>The extraordinary silence of NDP during COVID19 crisis made many workers be exploited at the hands of big corporations. Challenges were compounded when those workers lost income only to be dragged through legal system to face eviction. Not only NDP lost its roots but revealed where the party stood the whole time, politically.</p>\n<p>More than 85 percent of the Canadians depends on paycheque while the one percent owns everything; guarded by the 4 percent ruling class. Where did people go wrong and why have all workers left to hold the bag? Politics. Divide and conquer, a strategy that never failed to be tested.</p>\n", "date_published": "2021-03-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/radical-change-is-necessary-to-save-humanity/", "url": "https://kiri-vadivelu.ca/blog/radical-change-is-necessary-to-save-humanity/", "title": "Radical Change is Necessary to Save Humanity", "content_html": "<p>No one would disagree that our social, economical and political system is rigged. From school to workplace, the two faced appropriate conversation is filled with inappropriate intentions. No problem can be solved without first acknowledging the existence of problem and intent to be resolved. The real toxicity exist inside the subculture where appropriateness is the protective layer. Radical change would mean to break the wall of appropriateness in order to identify, expose and eradicate the subculture.</p>\n<img alt=\"Corporate crime in the office\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/tAGKM7aF7A-300.jpeg\" width=\"300\" height=\"252\" />\n<p>Socially, the most cruel and dirty culture is embedded in the leadership structure of organizational hierarchies. For instance, a financial institution have layers and layers of management personnels with vague job titles. An unspoken culture would exist among managers on how the organization should operate under normal conditions. As such social secrecy is toxic for employees and require inclusiveness; not exclusiveness. Without radical shift of power, workplace subculture cannot be detoxified.</p>\n", "date_published": "2021-03-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/intelligence-drought-of-american-corporations/", "url": "https://kiri-vadivelu.ca/blog/intelligence-drought-of-american-corporations/", "title": "Intelligence Drought of American Corporations", "content_html": "<p>Greed of corporate America to accumulate wealth for few while 80 percent of Americans fight for 20 percent of resources within American border is the beginning of greatest failures. After 2000 years of civilization, humans reached the moon, made nuclear bombs and installed puppet governments in every country or destroyed when refused; yet could not solve wealth inequality, homeless deaths and food shortages.</p>\n<img alt=\"Earth revolution due to human destruction\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/XJJBj7yZKM-300.jpeg\" width=\"600\" height=\"575\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/XJJBj7yZKM-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/XJJBj7yZKM-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Trillion dollar BlackRock bankers are the key financial advisors of elected American presidents. No wonder why majority of North Americans are mortgage hostages. American military is the tool of the corporate bankers to exercise violence on any nation in the planet. While, all corporate scams are sold as investment opportunity to end human foot print on earth.</p>\n<p>American Empire has been occupying every part of the continent since WW2. However, America was miserable in sharing the wealth among fellow Americans and continents. The weakest part of a chain is its link. Corporate American culture prevented people from knowing the basics of evolutionary sciences and law of universe. Any species that cannot share resources, co-exist and live peacefully are doomed to face extinction.</p>\n", "date_published": "2021-03-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/stop-wars-de-fund-military-complex/", "url": "https://kiri-vadivelu.ca/blog/stop-wars-de-fund-military-complex/", "title": "Stop Wars, De-fund Military Complex", "content_html": "<p>According to War Statistics, America is the enemy of peace and prosperity everywhere. Those who live outside of United States knows more about America than actual Americans. When actor Will Smith slapped comedian Chris Rock on the stage, Americans debated while non Americans laughed and confirmed the truth about American culture. While Americans wave the flag and believe America as the symbol of peace, rest of the world disgusted at the reminder of all crime against humanity committed by American military.</p>\n<img alt=\"Stop war, defund military\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/LY7xqiAcx1-300.jpeg\" width=\"600\" height=\"457\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/LY7xqiAcx1-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/LY7xqiAcx1-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\nA common elementary schooler argument is that everyone wants to come to America because America is a free and peaceful country. In reality, foreigners are escaping from war and sanctions that are directly or indirectly linked to American weapon manufactures. The profit of war is like a Christmas to American politicians, military complex and banking investors but nightmare for everyone. People realize that only place to escape war consequence is coming into America and they do at means necessary.\n<p>United States is the only place where everything can be commodified and made profit from basic necessities to human rights everywhere. American people forgot what is like to live in peace since America started declaring wars to reboot the failing capitalist economy. Today, the friendship of United States and Europe built on the principle of world peace is the primary reason for war everywhere. The friendship is at stake so do humanity.</p>\n", "date_published": "2021-04-02T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/are-you-still-paying-taxes-to-monarchy/", "url": "https://kiri-vadivelu.ca/blog/are-you-still-paying-taxes-to-monarchy/", "title": "Are You Still Paying Taxes to Monarchy?", "content_html": "<p>The ancient voluntary taxation system was created to ensure all people have access to food, medicine and basic humanitarian needs. However, the corrupted kings used the tax dollars to organize military, protect monarchy and build tools to kill people. When people realized the misuse of hard earned dollars; people refused to pay taxes. What rational mind would pay money to kill innocent people?</p>\n<img alt=\"Don't Look Up Movie Screenshot\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/72OcG5laRd-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/72OcG5laRd-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/72OcG5laRd-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Hence, the practice of collecting taxes involved use of force; eventually, adopted into a law to ensure social order and accountability of monarchy. Today, monarchy is replaced with corporate hierarchies, all working slaves are required to pay taxes and no option to opt out. Indeed, corporate structure operate under the illusion of democracy; which only serves billionaire class through illegal transfer of wealth from poor to the rich.</p>\n<p>Authoritative regimes around the world now seek to collect every penny from everyone using variety of control and enforcement mechanisms. The digital identification system is another tool for tax collectors to further oppress the working class people to pay taxes. Since humans are driven to live in peace instead of constant war, people are less like to support military complex, mass weapons and fake wars.</p>\n<p>The tax dollars only consented to be used to fund education, healthcare and social security; however, over 75 percent of tax revenue is used to police the poor, support military complex and create enemies abroad under false passport. Ultimately, the endless campaign for war profit require manufacturing of lies, deception and predatory cultures that are inhuman to democracy.</p>\n<p>The search for government documents would only return misleading facts. Do not look up. Yes, exercise your right to vote and choose your choice of poison but none are worthy of your trust or tax dollars. Sadly, the western culture, once portrayed to be the most civilized is the least civil by all standards.</p>\n", "date_published": "2021-04-03T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/progress-of-brainwashing-culture-in-america/", "url": "https://kiri-vadivelu.ca/blog/progress-of-brainwashing-culture-in-america/", "title": "Progress of Brainwashing Culture in America", "content_html": "<p>The special vocabulary, greenwashing and greenscamming are reserved for corporations that acknowledge the importance of environment preservation, yet, continue to cultivate the predatory culture for profit. Big corporations have adequate financial resources at disposal to create bogus jobs in order to skim more public tax dollars from government.</p>\n<img alt=\"Brain washing culture of mass media\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Y3eXY8z6yZ-300.jpeg\" width=\"600\" height=\"582\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Y3eXY8z6yZ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Y3eXY8z6yZ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>A local example of greenwashing is McDonald spending thousands of dollars to advertise paper straws meaninglessly so that all cost can be used for tax reimbursement. Likewise, an example of greenscamming is Exxon; where, a fossil fuel industry funding bogus non-profit organizations since to disprove the legitimacy of climate emergency.</p>\n<p>Without shame, unelected public servants at the top of the food chain knowingly collude with elected government and corporate executives to ensure the crime is legalized so no one can be held accountable. The zionist cult culture requires like minded people to legitimize the financial crimes through legalization of criminal acts.</p>\n<p>Under taxation system, corporations are viewed as individuals but none of the criminal activity can be questioned. Like drug addicts, profit is an addiction that would motivate anyone to operate malice without guilt. If you feel that you do not fit in such culture, that is probably because you are person with conscience and moral decency.</p>\n", "date_published": "2021-04-03T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/stand-with-ukraine-cancel-the-debt/", "url": "https://kiri-vadivelu.ca/blog/stand-with-ukraine-cancel-the-debt/", "title": "Stand with Ukraine, Cancel the Debt", "content_html": "<p>The war mongering European Nations (EU) have been providing significant humanitarian aids but all come at significant cost under the carpet. All of the sentiment to support Ukraine is successfully rewarding the pockets of bankers in Europe and North America. Across the world, the voice to support Ukraine is genuine; however, financial industries have not waved any interest payment that could be used to support the people in crisis. World sympathy, particularly American sympathy is going to be too expensive for Ukraine people to bear in the aftermaths of war.</p>\n<img alt=\"IMF cancel debt\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/_SbzUwYW8z-300.jpeg\" width=\"600\" height=\"424\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/_SbzUwYW8z-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/_SbzUwYW8z-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Ukraine, deeply troubled financially even before the war at 95 billion debt to Independent Monetary Funds (IMF), has been maintaining financial debt through giving free pass to North American Treaty Organization (NATO) to run biochemical weapon labs throughout the country. While Prime Minister Justin Trudeau and his Finance Minister Chrystia Freeland have been standing with Ukraine since day one; the NATO company is refusing to cancel the debt for Ukraine.</p>\n<p>Big bankers and weapon manufacturers are continuing to profit from the misery of people in the name of aid. Ukraine war may be over soon but people of Ukraine is unlikely to recover from the debt trap diplomacy of United States and the NATO allies. To really stand with Ukraine is to demand IMF to cancel all debts immediately so that children of Ukraine can one day live free in the country without being sold for American oligarchy.</p>\n", "date_published": "2021-04-04T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/what-is-real-challenge-in-democracy/", "url": "https://kiri-vadivelu.ca/blog/what-is-real-challenge-in-democracy/", "title": "What is Real Challenge in Democracy?", "content_html": "<p>Elections in capitalist countries always risk that the majority employees will vote to end the income and wealth inequalities produced by capitalism. So capitalists buy parties, politicians, mass media, etc. It’s their self defense against real democracy. Memorize the line and repeat every time when the alarm clock goes.</p>\n<img alt=\"Amazon workers organize union\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/_igCRVj5I1-300.jpeg\" width=\"600\" height=\"336\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/_igCRVj5I1-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/_igCRVj5I1-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Those who are woke in the left and right do not have all answers but know enough to investigate the problem. Of course, problem is power in the form of tyranny, dictatorship and corruption, simply put power corrupt. Instead of antagonizing each other; both can work together once to eliminate the problem.</p>\n<p>Keeping both left and right divided is the mastery of ruling class. However, that challenge is an opportunity for new leaders to close the division and unite the people. Ruling class is always always always the enemy of the working class. Police are traitors by default. True democracy, freedom and liberty only come from collective efforts of anti-imperialistic projects.</p>\n<p>One solution is to organize at grassroots, select leaders locally and hold a leash on his/her neck left, right, front and back to ensure they deliver without falling for bread tube. Against all odds, the victory of Amazon Worker Union in New York is the indicator of potential success for democracy.</p>\n", "date_published": "2021-04-04T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/contribution-of-jeffrey-epstein-to-philanthropy/", "url": "https://kiri-vadivelu.ca/blog/contribution-of-jeffrey-epstein-to-philanthropy/", "title": "Contribution of Jeffrey Epstein to Philanthropy", "content_html": "<p>One primary reason American people are blind to injustice everywhere is because no one invaded America over a century. Instead of building relationship, American elites have been burning bridges internationally. Only way to have friendship with the elites of United States is to participate to commit crime against humanity such as philanthropy work; best defined as private pedophile projects (P3).</p>\n<img alt=\"Jeffrey Epstein with British Royal Family\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/EB0a3bzaWN-300.jpeg\" width=\"600\" height=\"419\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/EB0a3bzaWN-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/EB0a3bzaWN-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The case of Jeffrey Epstein is the prime example of corrupted powers of American Empire. The ability of Jeffrey to build close relationship with ruling elites of United States, British Monarchy and big corporate executives across Europe is unimaginable in a country known for law and order. Rather than deflecting, American people can save America through holding those in power accountable, refuse to participate in war, violence and destruction.</p>\n<p>Everyone knows Jeffrey died by hanging but law enforcement is incapable of investigating truthfully due to political conflicts. Some know all clients of Jeffrey but no media have the courage to report empire corruption. Just because Jeffery is died, that does not mean the pedophile empire is vanished. Today, the systematic inability of average Americans to relate to a homeless American means the cult culture is live and well.</p>\n<p>A simple method to debug any private cult system is to be skeptical of those in power and ones with enormous wealth. Indeed, the cult system require wearing of business attire, appearing charismatic in public, speaking neutral words and showing faith to criminal system. Those are essential skills to build cult empire of any sorts. In the great America, criminals can walk free but those expose crimes such as Snowden or Assange are guaranteed to be demonized and prisoned.</p>\n<p>Not all Americans are free in a country that they love except the elites but average Americans are too naive to understand the basics of power and politics. Only when American elites are under threat of invasion, they would likely to value human lives and world peace. When average Americans rise, we all rise, only a homeless American can understand.</p>\n", "date_published": "2021-04-05T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/hidden-truth-about-financial-investment/", "url": "https://kiri-vadivelu.ca/blog/hidden-truth-about-financial-investment/", "title": "Hidden Truth About Financial Investment", "content_html": "<p>As revolutionary economist and German philosopher , Karl Marxist is a harsh critique of capitalist economic system. As a humanitarian, he felt that the capitalist system is unsustainable model, cruel to humanity and evil that thrives on the organized violence against people. He advocated for better society that would preserve economy, humanity and planet; though his vision was never fully implemented in practice due to variety of conflicts. His prominent work “The Communist Manifesto” was even inspired his opponents to create “The Capitalist Manifesto” a copycat version.</p>\n<img alt=\"Legitimacy of financial investment systems\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/X1V6wdo7U2-300.jpeg\" width=\"300\" height=\"419\" />\n<p>Since material wealth was an uninspiring trait of his type, he pursued a working class lifestyle. In return, he reaped the benefit of most accurate predictions of capitalist system without illicit personal profit hinderance. As he predicted, the new world order is inevitable due to backward system of capitalism. Surprisingly, the big corporate actors seeking to steer the ship to control the destiny would only accelerate the transition of new social, economical and political order due to civil unrest. Some 200 hundred years ago, he argued that capitalism will not share wealth but must be seized by the people ultimately, that holds true even today.</p>\n<p>Due to high exposure to political propaganda with low intelligence to challenge the narrative resulted in misinformed population. Today, the United States, gold dollar turned into energy dollar, finally lost its value. American military has missed the opportunity to control the outcome when Russia reacted to NATO terrorism. Nuclear war is a no go zone; therefore, global defeat of capitalism is accepted. Investing in Yuan and Ruble is the future for those holding dollars at the moment. Unless, everyone come to realize that religions are fairy tales with primary role is to support corporate capitalism.</p>\n", "date_published": "2021-04-05T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/expertise-method-of-money-laundering/", "url": "https://kiri-vadivelu.ca/blog/expertise-method-of-money-laundering/", "title": "Expertise Method of Money Laundering", "content_html": "<p>Money laundering is a serious financial crime. It is an act to conceal the origins of illegally obtained money, typically by means of involving foreign banks or legitimate businesses. Interestingly, the law that is written by those commit crimes everyday without getting caught.</p>\n<img alt=\"Zionists lie Americans die protest\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ZMsd7pC026-300.jpeg\" width=\"600\" height=\"386\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ZMsd7pC026-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ZMsd7pC026-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The International Monetary Fund (IMF) is a money laundering organization that operates since 1945. Although, IMF was initially created to balance economic inequality and reduce poverty, the organization achieved neither of any. Today, IMF transitioned into a powerful organization to topple any national government financially.</p>\n<p>The ability of IMF to fund terrorist organizations that serve the interest of United States is worth mentioning. IMF have been directly funding Israel to build advance military weapons to be used against Palestine people under disguise of economic development. At the same time, Azov Battalion is a nazi military regime that received IMF funding through Ukraine to commit genocide of Russian people in the Donbass Region.</p>\n<p>Likewise, the weapon manufactures are not only good at concealing the financial crimes but also generate profit without any public disapproval. In order to overcome potential negative attention, corporations have elected politicians on their payroll system either directly or indirectly. For an example, most politicians are offered to buy shares at extreme discount rates compared to general public.</p>\n<p>The truth is real criminals are closer to us than we think. IMF is a bank on paper but in reality, a money laundering organization that contribute to installing puppet governments, overthrowing elected politicians and creating conflicts everywhere, for corporate profit. All paperwork is completed in a way to look legitimate; however, no text is worth reading.</p>\n<p>The act of producing any document upon request is the expertise of criminals to deceive public inquiries. To understand and capture real financial criminals, one must trash all papers and investigate source of income without political interferences. Smart Zionists lie on the paper, poor Americans die in the field.</p>\n", "date_published": "2021-04-06T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/american-eagle-is-on-guard-for-thee/", "url": "https://kiri-vadivelu.ca/blog/american-eagle-is-on-guard-for-thee/", "title": "American Eagle is on Guard for Thee", "content_html": "<p>Every empire in the history fought wars to steal but America has perfected the art of boosting the economy through war, consistently. For the credit of war driven economy, American corporations have looted the planet for profit because war is a profitable business. In order for the America to operate without loosing credibility, Hollywood maintained the status quo culture of violence through feeding lies to Americans and to those fans of American violence.</p>\n<img alt=\"5 top American billionaires\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/mJ322Nn3xl-300.jpeg\" width=\"600\" height=\"663\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/mJ322Nn3xl-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/mJ322Nn3xl-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>From social, economical to political system, American culture built on capitalism is always in search for ruthless violence. The political system controlled by the military and the elites only need an excuse to exercise violence; that is evidenced through treatment of poor Americans during COVID and notable Will Smith and Chris Rock slapping incident. Although America is a racist, violent and dishonest country, colour or character does not matter once wealth is acquired.</p>\n<p>The bogus symbolic image of America is crumbling as the real issues of pandemic and climate crisis are emerging. Ukraine war may be over soon but people of Ukraine are unlikely to recover from the debt trap diplomacy of United States. To really stand with Ukraine is to demand IMF to cancel all debts immediately so that children of Ukraine are protected from American oligarchy.</p>\n", "date_published": "2021-04-07T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/two-types-of-negros-house-and-field/", "url": "https://kiri-vadivelu.ca/blog/two-types-of-negros-house-and-field/", "title": "Two Types of Negros - House and Field", "content_html": "<p>“There were two kinds of slaves, the house Negro and the field Negro. The house Negroes--they lived in the house with master, they dressed pretty good, they ate good because they ate his food--what he left. They lived in the attic or the basement, but still they lived near their master; and they loved their master more than their master loved himself. They would give their life to save their master's house--quicker than the master would. If the master said, &quot;We got a good house here,&quot; the house Negro would say, &quot;Yeah, we got a good house here.&quot; Whenever the master said &quot;we,&quot; he said &quot;we.&quot; That's how you can tell a house Negro.</p>\n<img alt=\"Negro who love their masters\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/DgXvCvqSdJ-300.jpeg\" width=\"600\" height=\"759\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/DgXvCvqSdJ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/DgXvCvqSdJ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>If the master's house caught on fire, the house Negro would fight harder to put the blaze out than the master would. If the master go sick, the house Negro would say, &quot;What's the matter, boss, we sick?&quot; We sick! He identified himself with his master, more than his master identified with himself. And if you came to the house Negro and said, &quot;Let's run away, let's escape, let's separate.&quot; The house Negro would look at you and say, &quot;Man, you crazy. What you mean, separate? Where is there a better house than this? Where can I wear better clothes than this? Where can I eat better food than this?&quot; That was that house Negro. In those days he was called a &quot;house nigger.&quot; And that's what we call them today, because we've still got some house niggers running around here.</p>\n<p>This modern house Negro loves his master. He wants to live near him. He'll pay three times as much as the house is worth just to live near his master, and then brag about &quot;I'm the only Negro out here.&quot; &quot;I'm the only one on my job.&quot; &quot;I'm the only one in this school.&quot; You're nothing but a house Negro. And if someone comes to you right now and says, &quot;Let's separate,&quot; you say the same thing that the house Negro said on the plantation. &quot;What you mean, separate? From America, this good white man? Where you going to get a better job than you get here?&quot; I mean, this is what you say. &quot;I ain't left nothing in Africa,&quot; that's what you say. Why, you left your mind in Africa.”</p>\n<ul>\n<li>Malcolm X: “Message to the Grass Roots.&quot;</li>\n</ul>\n<p>Northern Negro Grass Roots Leadership Conference. Group on Advanced Leadership. King Solomon Baptist Church, Detroit. 10 November 1963.</p>\n", "date_published": "2021-04-08T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/pandemic-exposure-of-canadian-double-standards/", "url": "https://kiri-vadivelu.ca/blog/pandemic-exposure-of-canadian-double-standards/", "title": "Pandemic Exposure of Canadian Double Standards", "content_html": "<p>As the COVID emergency slammed the brake on the world economy, a radical action was forced to protect the people. Unexpectedly, the impact of pandemic death toll driven lock downs coerced even the capitalist countries to roll out emergency assistance. Without a choice, Canadian liberal government rolled out temporary $2000 paycheque for all Canadians. The program made Liberal government to appear as the most radical left humanitarian government; but, the reality is the opposite.</p>\n<img alt=\"Prime Minister Justin Trudeau and Finance Minister Chrystia Freeland\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/KijPkGRv4t-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/KijPkGRv4t-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/KijPkGRv4t-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Although, lock down saved lives and kept the hospitalizations under control, it exposed the long standing cracks in the capitalist system. The hospitals were underfunded and frontline workers were exploited; while being praised as heroes. Most frontline workers had their bravery bonus seized back within months of rolling out. Immediately after, the COVID assistance stopped and coerced vulnerable workers to return to work without even implementing living wage or addressing housing crisis.</p>\n<p>Most conservative Canadians were critical of emergency assistance to workers. However, the harsh critiques refrained from calling out the large number of emergency fund recipients; both wealthy Canadians and even hundreds of millionaires. Those cheques were quietly returned to the government without penalty. No one asked how they were eligible to collect the life saving money that supposed to go to the most vulnerable population in the first place.</p>\n<p>The secret answer is the broken taxation system that favoured the rich for hundreds of years. All three levels of government and mainstream parties knew the loophole in the system; but, never addressed the real problem. Vocal critiques are in complicit with the capitalist system to further oppress the working people; which makes Canada a perfect capitalist country. All parliamentarians happily accepted a pay increase while downgrading frontline workers to non essential within few months.</p>\n<p>Canadian liberals are not left but protectors of corrupted, tyrannical and violent capitalist system. Freedom convey had the potential to demand real change but quickly squashed by the iron fist of the liberal tyranny. Instead of hate, uniting the real left and right may bring the revolutionary change every patriotic Canadian wants.</p>\n", "date_published": "2021-04-08T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/no-pride-in-american-show-business/", "url": "https://kiri-vadivelu.ca/blog/no-pride-in-american-show-business/", "title": "No Pride in American Show Business", "content_html": "<p>While most American friends of colour are proud about the nomination of first black woman Ketanji Brown Jackson to Supreme Court of United States, the great personal achievement may not translate into meaningful change for average Americans; basing on the recent history of show business in politics. Outside of media glamorization, there is nothing black about Obama, Harris or Jackson.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Sgc8wQ1qGW-300.jpeg\" width=\"600\" height=\"750\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Sgc8wQ1qGW-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Sgc8wQ1qGW-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>When Barrack Obama entered the white house as 44th president, the whole world hoped for positive change in and out of America; to be liberated from oppression. However, the double term president was far worse, with charismatic smile dropped bombs and killed thousands of innocent people in Middle East without facing any consequence.</p>\n<p>A notable achievement was repealable Obamacare. Meanwhile, Obama untouched the private medical industry, prison profiteers and slavery waging system that exploited most vulnerable. Indeed, Americans were so outraged and elected a most right wing nationalistic billionaire republican Donald J. Trump to save America in January 2017.</p>\n<p>Next hype came around the nomination of first Southeast Asian female Vice President Kamala Harris. Under the longest serving president Joe Biden, Kamala is just different in colour and name and that serves visual purposes only. She replaced previous colonizers; if not worst than expected in delivering to Americans at the bottom of the food chain. Police violence against people of colour not only increased but also justified.</p>\n<p>When Amazon workers in New York voted to form largest union in a century, all of Americans, Canadians and Mexicans celebrated; however, not a single politician in power supported or even joined the victory. Sadly, real Americans are consumers of misinformation and political propaganda. After all, Obama, Clinton and Bush are fierce defenders of capitalism. Interestingly, the difference between Hollywood and politics are razor thin.</p>\n<p>Based on recent history, future impact of Judge Ketanji is not difficult to predict. Her entry has already shaken the grounds of existing black supreme court judge Clarence Thomas. Sadly, the real purpose of American capitalist government is to protect the share holders of corporations. Nothing for Americans to celebrate except for news worthiness of media content for show business. Without doubt, accomplishment of Judge Ketanji help draft future movie plot for Hollywood directors to sell more violence or justify the existence of military complex on the back of poorest Americans.</p>\n", "date_published": "2021-04-09T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/great-decline-of-human-empathy-in-society/", "url": "https://kiri-vadivelu.ca/blog/great-decline-of-human-empathy-in-society/", "title": "Great Decline of Human Empathy in Society", "content_html": "<p>Empathy is a special trait of human species, the ability to understand and share the feelings of another irrespective of the circumstances. Accordingly to evolutionary psychology, the emotional intelligences of humans do have the capacity to imagine and connect with another even when the crisis is not seen, heard or experienced directly.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/eQlAOq5dRv-300.jpeg\" width=\"600\" height=\"771\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/eQlAOq5dRv-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/eQlAOq5dRv-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The unique ability to connect based on humanity mechanism is what separates humans from predatory animals. Unfortunately, not all humans have the emotional traits of humans; instead, posses narcissistic personality traits that only belongs to predatory animals. Any humans with such dark traits shall be in the jungle with animals only; for the best interest of both human and animal species.</p>\n<p>But, predatory humans live among human population and either resist human tendency to understand the suffering of others or do not possess the human trait at all. Sadly, all such individuals are living among the population under the human skin; which makes the safety of everyone in jeopardy. Regretfully, the existence of ideologies such as Zionism validate the predatory nature of humans.</p>\n<p>Most narcissistic individuals tend to express narcissistic traits without being called out. For instance, the included picture was originally created to show false narrative of Russia against people of Ukraine; however, the deliberate act of apartheid state Israel to kill Palestine people for over 50 years is disregarded. A perfect example of narcissistic human traits in action with Zionistic ideology.</p>\n<p>Ironically, the predatory element of narcissistic individuals are rewarded with wealth and material success at the expense of emotional connections. Sadly, the inability of predatory humans to connect with other humans not only dangerous for society but also make those individuals live an empty life till the end regardless of hoarded material wealth.</p>\n", "date_published": "2021-04-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/and-then-they-came-for-me-journalist/", "url": "https://kiri-vadivelu.ca/blog/and-then-they-came-for-me-journalist/", "title": "And then, They Came for Me, Journalist", "content_html": "<p>The ethnic minority Tamils have been fighting for social, economical and political equality since the independence of Ceylon from British in 1947. The Northern part of Island was home to Tamils, a 15 percent population, while southern part was occupied by 80 percent Sinhalese; meanwhile, east and west were home to Muslim and other minorities.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/3uiV8Nc3yD-300.jpeg\" width=\"300\" height=\"420\" />\n<p>The ruling elites immediately renamed Ceylon to Sri Lanka and declared Sinhalese as the primary official language of the country; although, Sinhalese, Tamil and English were three official languages. As consequence, corrupted fascist rulers enacted a 30 year civil war in the country, that ended at Mullivaikkal in May 2009. Ruling Mahinda Rajapaksa family rejected all claims of genocide and refused to cooperate with international calls for justice. The dictatorship lasted over 20 years where every high ranking roles were occupied by the members of the same family.</p>\n<p>The media was under full control and only anti-Tamil propaganda was broadcasted in chorus to gain public compliance for ethnic cleansing. Prominent journalists were kidnapped, tortured and murdered; while, opposing party members were executed using the mafia of the ruling party. The January 2009 daylight murder of journalist Lasantha Wickrematunge who questioned corruption sent a shockwave to everyone across the country. The mafia consisted of extreme Sinhalese fascist military members who loyal to Rajapaksa family, were paid more than double the salary.</p>\n<p>During Tamil resistance, the fascist rulers blamed all social problems on Tamil rebels while accumulating wealth. To defeat Tamil rebels, Rajapaksa family purchased enormous military weapons from overseas; only to pocket large amount of public money. All trading relationship overseas were mysterious. The international humanitarian aids supplied to Tamils were stolen and sold to Sinhalese population lived outside of war zone for cheap in exchange for votes.</p>\n<p>Nearly 15 years after the genocidal war, country is at much worse condition than the era of civil war. Ethnic minority Tamils and Muslims are continue to be kidnapped, tortured and murdered without justice. Now, all people of Sri Lanka are outraged; demand Rajapaksa dictatorship be gone for the good.</p>\n", "date_published": "2021-04-11T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/circus-of-hitler-nazi-to-nato-america/", "url": "https://kiri-vadivelu.ca/blog/circus-of-hitler-nazi-to-nato-america/", "title": "Circus of Hitler NAZI to NATO America", "content_html": "<p>Although Europe civilization was evolving much faster than other regions, the people of Germany were not immune from political misfortunes. Since average household is already in constant battle to make ends meet while managing social politics within the family, the eager to participate in the community welfare is the last option for many. Hence, the lack of community participation from contributing members creates a vacuum for illegitimate political leadership. Unfortunately, the fascist leaders often the real opportunists to benefit from social, economical and political crisis.</p>\n<img alt=\"Nazi NATO Soldier with American Flag\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/sEWoadJL3P-300.jpeg\" width=\"600\" height=\"517\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/sEWoadJL3P-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/sEWoadJL3P-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Unlike Nelson Mandela or Mahatma Ghandhi, Adolf Hitler did not have a vision but enormous greed for wealth and power. As a brainwashed Zionist, his ability to start at lowest rank of military to become the fascist leader in politics is an unbelievable achievement. Today, colonial capitalism have produced mass number of Hitlers in variety of sectors; particularly financial institutions. For instance, David McKay, president and CEO of Royal Bank of Canada alone earns 15 million in annual salary while $15/ hr is the minimum wage for Canadians.</p>\n<p>The unsustainable model of capitalistic driven market is based on greed and threat of violence underneath the coat suite. When Germany was faced with national economical uncertainly, Hitler weaponized the fear of people to invade the Europe and lead military to commit atrocities till defeated in Russia. In reality, people of Germany were victims of nazi corporate system of capitalism. Saddest of all is the repetition of colonial history of Hitler Nazi roles in the form of NATO American imperialism. Ultimately, the failure of NATO dissolution after the collapse of Soviet Union is the primary cause of modern crisis.</p>\n<p>As Mark Twain said, history does not repeat but it often rhymes. Both Democrats and Republic parties of America have colluded to lie to public about the war crimes of American military to serve the corporate interest of the few. The irony of making peace around the world while pointing gun at the weakest opponent is the outdated strategy of colonization. Only a defeat of American military and NATO would allow American public to know their fate, seek truth and unite all.</p>\n", "date_published": "2021-04-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/faith-business-in-the-name-of-christ/", "url": "https://kiri-vadivelu.ca/blog/faith-business-in-the-name-of-christ/", "title": "Faith Business in the Name of Christ", "content_html": "<p>The great old saying is “money talks, bullshit walks”. The statement is so brief often get overlooked after the initial conversation. But, the four words shall not only be memorized but must be applied on day to day interactions with authorities should one concerned about knowing the truth of any subject matter. All religious services; particularly churches operate based on donations; one shall follow the money to the destination.</p>\n<img alt=\"Mark Twain Quote with picture\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/keqC6EsJsa-300.jpeg\" width=\"600\" height=\"601\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/keqC6EsJsa-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/keqC6EsJsa-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Majority of the faith service recipients are at the bottom of the food chain and bring a fraction of value to the church. However, those at the top of the food chain bring largest amount of donations and consume least amount of services. Reasoning as to why rich donates can vary; motivational factors include but not limited to tax break, social status and individual satisfaction.</p>\n<p>Although, tax breaks, volunteers and expenditure relieves are available, faith based system requires consistent income to compensate employees and offer services to public. Since faith service also operate as a business, attempt to be sustainable if not profitable for the least. Maintaining the status quo is better than demanding change or seek solution to the social problems such as living wage. Simultaneously, no church leaders would desire to upset the large business donors and political powers.</p>\n<p>Interestingly, the only campaign all churches participate in chorus is the anti-abortion. Reason being, abortion is considered immoral and does not irritate political powers or businesses but in return even bring more donations to the churches. The one and only evergreen anti-abortion church advocacy does not move an inch toward preventing child labour, poverty, rape or even murder at the hands of the authority. Retail chain Walmart exploitation of underage workers in overseas were rejected.</p>\n<p>Ironically, the worst the social condition gets, the better is for the churches. The ongoing misery would bring more members and that would justify the need of faith based businesses. Systematically, churches tend to shift all blames to individual; which keeps complainants out of local constituent offices. Therefore, not only churches but all faith based system that require income to operate do benefit from the misfortunes of people as much as corrupted politicians.</p>\n", "date_published": "2021-04-13T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/good-samaritans-are-the-escape-goats/", "url": "https://kiri-vadivelu.ca/blog/good-samaritans-are-the-escape-goats/", "title": "Good Samaritans are the Escape Goats", "content_html": "<p>Early pioneers of democratic system really had good intention to preserve the humanity; however, the ruling class did not. Political rulers seize power using variety of social manipulation in order to serve the few and themselves in the process. Regretfully, lies are manufactured, humanity is sacrificed and people are divided in the most free world.</p>\n<img alt=\"Political injustice to Edward Snowden\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/0hjmS6dNkS-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/0hjmS6dNkS-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/0hjmS6dNkS-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Today, the ruling class owns everything from life saving science to truth seeking journalism. Ruling leaders have perfectly exploited the weakness of the system to protect the interest of the corporations. An American intelligence officer Edward Snowden who exposed crimes against humanity is expected to be viewed as criminal. Did our pioneers fail Snowden or people failed as a society to seek truth?</p>\n<p>The picture attached contain Obama, Netanyahu and Snowden. One of them killed the most people overseas using advanced military technology with a charismatic smile and won Nobel peace prize. The next one excelled at dividing people using lies, misinformation and special standards in the legal system to protect one group while mercilessly kill another without accountability and be glorified in the mainstream media.</p>\n<p>At last, a good samaritan concerned about liberty, democracy and justice, is portrayed as evil; by the first two. Shockingly, real criminals are in front of us and their actions speak louder than words; yet they are not being held accountable.</p>\n", "date_published": "2021-04-14T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/greed-is-ugly-lets-not-glorify/", "url": "https://kiri-vadivelu.ca/blog/greed-is-ugly-lets-not-glorify/", "title": "Greed is Ugly, Lets not Glorify", "content_html": "<p>Greed is an intense and selfish desire for something, particularly wealth, power or status. However, most people tend not to criticize the greed of another due to potential jealousy portrayals. Interestingly, jealousy is manageable but greed is not. For the purpose of simplicity, greed can be understood as excessive desire based on the context of survival necessity to co-exist within given society.</p>\n<img alt=\"RBC Bank CEO David McKay on Phone\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/gobBQ4DeUh-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/gobBQ4DeUh-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/gobBQ4DeUh-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Today, colonial capitalism have produced mass amount of greedy leaders in variety of sectors. For instance, David McKay, president and CEO of Royal Bank of Canada alone earns 15 million in annual salary while $15/ hr is the minimum wage for Canadians. Ironically, David does not work that hard to justify the earning while most working Canadians do not have adequate to eat and pay rent at the same time.</p>\n<p>Sadly, the excessive greed of David is glorified instead of being disgusted. The mainstream narrative is that hard working people can earn anything in a free society. The reality is that David is not working hard enough to earn 15 Million nor society is free for everyone. The social silence and complicit is what keeps David stealing through the crack while those who work hard mentally and physically are degraded.</p>\n<p>Of course, David is not making decision directly to exploit the unskilled labour for his benefit; but, his job of pushing the button may be the real unskilled labour. Existence of glorified so called skilled labour titles ridicule those actually earn living through meaningful contribution to society. Clearly, David is greedy, likely have a questionable lifestyle where large amount of money is necessary.</p>\n", "date_published": "2021-04-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/theft-without-stigma-society-without-answers/", "url": "https://kiri-vadivelu.ca/blog/theft-without-stigma-society-without-answers/", "title": "Theft without Stigma, Society without Answers", "content_html": "<p>The surplus value is an excess profit of wealth produced by the labour. Under capitalism, 100 percent of the profit goes directly to the owner. But, under communism, 100 percent of the profit goes directly to the government. When a society is either only capitalism or communism, the catastrophe is created. Individuals are greedy and power is corrupt; therefore, society suffers.</p>\n<img alt=\"Labour Theft in Modern Society\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/xcVAgh5UtF-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/xcVAgh5UtF-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/xcVAgh5UtF-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Though surplus value of labour belongs to the community, the owner greed and corrupt powers interfere with social welfare. Capitalism breeds inequality through hoarding of wealth; therefore, crime is legalized against poverty. Simultaneously, social despair is innovated through worker oppression to resist exploitation. Being held hostage to a pay-cheque is not freedom and not a pride worth sharing with ruling powers.</p>\n<p>Capitalism is a colonial system of violence based on greed, unfortunately. An idea that socialism is evil comes from the fear driven politics without knowing the principle of community sharing. Promoting worker oppression of slavery wages support the billionaire philanthropy for private pedophile islands. Simply put, inflation is mass corporate greed. Everyone have an obligation to uplift humanity and any space is a privilege to do good.</p>\n<p>Current system makes landlords rich while screw small businesses. After 2000 years, inequality remains the highest without living wage.</p>\n<p>Unlike the rich, when workers have money, they will spend on local businesses. Money in the hands of few ends in offshore accounts; not in our economy. Current political system does not help but fail entire economy. Sadly, workers are scapegoats for fear driven politics.</p>\n<p>Instead of advocating for economical violence to maintain the status quo so few can continue to exploit everyone based on false historical understanding of civilization, we can build a profit sharing community in harmony with nature. Demanding living wage is not radical but absolute necessity; however, allowing corporations to terrorize the most vulnerable is radically and disgracefully complicit.</p>\n", "date_published": "2021-04-16T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/vaccination-save-corporate-lives/", "url": "https://kiri-vadivelu.ca/blog/vaccination-save-corporate-lives/", "title": "Vaccination Save Corporate Lives", "content_html": "<p>Scientific studies were highly respected in academic world due to the potential to save humanity. However, profit driven science do not have the same principles. When the true motivation of humanity is replaced with profit, science is nothing but another marketing scheme.</p>\n<img alt=\"Corporate vaccination for profit gains\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/gsvhKmle1U-300.jpeg\" width=\"600\" height=\"750\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/gsvhKmle1U-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/gsvhKmle1U-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Capitalist society composed of billionaires, politicians and boot licking professionals; have degraded science to unimaginable depth. Only credit worth mentioning is the ability of politicians to continue to deceive the public that science can do no harm to the humanity.</p>\n<p>For example, race to build atomic bomb to save humanity was the biggest lie evidenced after the Hiroshima and Nagasaki destruction. Obviously, science community did not save humans or environment. Morality was eroded enough to serve the interest of corporate warfare.</p>\n<p>At the same time, science community and ruling powers did not pay attention to the social welfare of Americans. The importance of basic necessity such as food, medicine and housing are held hostage from workers in a so called free country. Do they really care about the welfare of people? No evidence to support the claim.</p>\n<p>Credibility of science community funded by the corporations is not high. Politicians were the middle man to transfer tax dollars into the hands of largest pharmaceutical companies and implement coerced vaccinations to mask money laundering; all while under funding social programs.</p>\n<p>A nation run by bankers will never be out of debt. A nation owned by weapon manufactures will never know peace. A nation that allows a small segment of its citizens to write laws will never know justice. And if these elements own the media, no one will ever know the truth.</p>\n", "date_published": "2021-04-17T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/american-strategy-to-mobile-wealth-upwards/", "url": "https://kiri-vadivelu.ca/blog/american-strategy-to-mobile-wealth-upwards/", "title": "American Strategy to Mobile Wealth Upwards", "content_html": "<p>What separate America from previous empires is the economical strategy to mobilize wealth upwards, consistently. World economy contribute to the wealth of America through making all transactions in American dollars. After the fall of British Pounds, American dollar is considered to be the most reliable currency; that directly correspond to the military capacity of America to inflict violence against any sovereign nation.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/s1SktytJRg-300.jpeg\" width=\"600\" height=\"599\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/s1SktytJRg-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/s1SktytJRg-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Unlike the British, American economy strategists also known as Central Intelligence Agency (CIA) have a plan in place. Regardless of the type of political administrations, American economy wheels would only keep rolling in one direction. Elections can change the speed of economy wheels; however, none can change the direction of the journey.</p>\n<p>Without surprise, the elections are just ceremonies to make Americans and the people around the world believe in democracy; however, politicians have no real purpose in governance of the country. The obsolete elected politicians are only responsible to sign documents and act as a protective layer for big corporations to mobile wealth upwards without making the greedy hands dirty.</p>\n<p>While, CIA went from defending democracy to planting evidence on opponents in order to exercise violence; toilet paper is more useful to Americans than economy strategists. When Intelligence Officer, Edward Snowden exposed the scandals of American democracy, he knew he would not be safe in his country so do all good Americans.</p>\n", "date_published": "2021-04-18T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/united-snakes-keep-americans-broke/", "url": "https://kiri-vadivelu.ca/blog/united-snakes-keep-americans-broke/", "title": "United Snakes Keep Americans Broke", "content_html": "<p>The corporate welfare system implemented by the CIA ensures that American tax dollars do not go into the hands of people. By keeping the money in the hands of big corporations, America can continue to dominate the world economy. Sadly, the economical dominance must also be backed with the ability to commit political violence in the name of war for peace to maintain the status quo.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/w1YWr-2EOP-300.jpeg\" width=\"300\" height=\"220\" />\n<p>The crooked American economists only believe in the trickle down economics; which everyone know is the real scam to siphon out all tax dollars. Failures of such cruel system is evidenced through the lack of funding to programs that are directly beneficial to American people. Bankers of America ensure that US is at constant war with the world to accumulate wealth at expense of peace, humanity and order. Every 10 year, the American economy must be revived through warfare.</p>\n<p>Today, the famous playbook of winning wars to maintaining war driven economy is in the hands of Russia. Meanwhile, American economical monopoly has finally come to face real competition from China. Real victims of systematically organized corporate violence are Americans working at the dead end jobs, young Americans that fall for Hollywood propaganda and defenseless innocent people overseas. The combination of Zionist wealth and American military is the recipe for disaster that anyone would have ever imagined.</p>\n<p>America is the only country that would invade another country with no access to clean water to install oil pumps. The violence and cruelty is the primary culture of America; that is evidenced through the treatment of most vulnerable Americans in homeless towns of New York. Socially and psychologically, America is the poorest country in the world.</p>\n", "date_published": "2021-04-21T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-corporate-welfare-bums/", "url": "https://kiri-vadivelu.ca/blog/the-corporate-welfare-bums/", "title": "The Corporate Welfare Bums", "content_html": "<p>The corporate welfare bums are also knowns as capitalist death cult is a threat to health and wellbeing of all labour. A death cult can be understood as vicious, dark and evil chain of thinking, acting and behaving to destruct natural life cycles. Bank is an example of structural capitalism to colonize labour wealth at the expense of humanity to benefit corporate bums.</p>\n<img alt=\"Corporate Welfare Bums Dressed in Black Suit\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/gkDaKTNhTe-300.jpeg\" width=\"600\" height=\"430\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/gkDaKTNhTe-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/gkDaKTNhTe-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Social capitalism is a western creation of socialized version of death cult; where, cruel motives of cult is glorified rather than disgusted. From Europe to America, death cult is fashionable in corporate environment. No banker would ever handle money without dressing to deceive customers. Western bank industry is disastrous for humanity; is an understatement. No one will ever free till abolishment of all predatory system.</p>\n<p>According to corporate death cult, everything is a commodity. From birth to death, all living elements can be made profitable. Every joy and misery of human experience is a business opportunity. That is a predatory nature of wilderness that humans shall not practice. However, capitalism is packaged and socialized in a manner to be appealing to everyone. Labour is godly but for corporate welfare bums is a profit machine.</p>\n<p>Birth of a child is a great opportunity for many businesses and potential exploitation venues. Subsequently, the child becomes an adult to consume products of capitalist society at different stages of life. Eventually, the funeral industry is patiently waiting to capitalize the death of a life. The faster the birth to death cycle runs, more profitable for the death cult. Every life is just a digit to corporate death cult.</p>\n<p>The corporate welfare bums who are advocates of modern capitalist war and destruction do not contribute to society in anyway but operate in ways to exploit all the wealth of the society. Secrets of corporate death cult are automation and mass production for infinite profit, in order to benefit few greedy bums who never sweat a day at work.</p>\n", "date_published": "2021-04-21T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-real-enemy-of-free-speech/", "url": "https://kiri-vadivelu.ca/blog/the-real-enemy-of-free-speech/", "title": "The Real Enemy of Free Speech", "content_html": "<p>Free speech is the cornerstone of democracy. Whether our political stand is on the right, left or centre, defending the right to free speech is the most important civil duty. Over the years, the right to free speech has been eliminated using variety of legal apparatus.</p>\n<img alt=\"Hands off Assange: Don't Shoot the Messenger\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/szRs0fy8vx-300.jpeg\" width=\"600\" height=\"358\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/szRs0fy8vx-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/szRs0fy8vx-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>For an example, anti-semitism is a law specially drafted to protect Jewish people from hate crime. Although, existing laws were more than adequate to protect everyone against hate crime; the Zionist Jews were deceitful enough to slice out special privilege under the law. Ironically, butchers of free speech are drafting laws to protect free speech.</p>\n<p>Unlike Jews, Black people were slaves in America 50 years ago; however, civil rights advocates such as Martin Luther King did not demand special law to protect black people from slavery. All working black and white Americans were united to eliminate slavery. Zionists do not contribute to democracy but consume democracy for existence.</p>\n<p>Zionist laws does not acknowledge the right of others but Jews. Apartheid policies does not protect free speech but eradicate humanity, completely. Creator of zionism, Theodor Herzl and his sympathizers are devils of equality and freedom. Zionists are cowards but masters of manipulation, a fact that cannot be undermined.</p>\n<p>Even when loaded gun is pointed to the head, Palestinians are bravely defending free speech in Palestine. Like Palestinians, we must all assert our rights against Zionists or we have none; blatantly obvious through the fate of Julian Assange extradition to United States.</p>\n", "date_published": "2021-04-22T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/eradicate-zionists-to-save-humanity/", "url": "https://kiri-vadivelu.ca/blog/eradicate-zionists-to-save-humanity/", "title": "Eradicate Zionists to Save Humanity", "content_html": "<p>As progress is the real purpose, human rights activists including Malcolm X fought for free speech and to eradicate slavery for the good of humanity. However, Zionist Jews were able to use lies and deception to destroy democracy through creating illegitimate laws to ruin free speech.</p>\n<img alt=\"John F Kennedy on zionist movement\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/xrM2hHVlEz-300.jpeg\" width=\"600\" height=\"328\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/xrM2hHVlEz-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/xrM2hHVlEz-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The real intent of laws such as anti-semitism is to silence all critiques of anti-Zionism; particularly Palestine people from demanding justice. Since people of Palestine were systematically oppressed without any ability to fightback apartheid regime, all illegitimate laws were passed without push-back in the occupied land.</p>\n<p>Without critical perspectives, democracy becomes one sided tyranny. Those with all the wealth and power ultimately control the narrative of the free speech. Sadly, American democracy fell for the Zionist manipulation to enforce illegitimate laws to harm free speech everywhere.</p>\n<p>History portrays Adolf Hitler as both good and evil; nonetheless, 21st centurions can safely assume that he must have known something that no knew at the time; just as honorable American President John F. Kennedy did. Unfortunately, eradicating Zionists is the only way to save humanity.</p>\n", "date_published": "2021-04-23T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/cut-the-chase-get-to-the-point/", "url": "https://kiri-vadivelu.ca/blog/cut-the-chase-get-to-the-point/", "title": "Cut the Chase, Get to the Point", "content_html": "<p>Most people are afraid to engage in difficult conversations. Because humans are driven to be at peace and harmony by default; not at conflict. That is a blessing and a curse at the same time.</p>\n<img alt=\"Social oppression of most vulnerable\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/AiqSwP3rA2-300.jpeg\" width=\"300\" height=\"300\" />\n<p>An iron rod does not become knife without facing the heat nor a caterpillar can become a butterfly without accepting transition. It is ok to be wrong and it is ok to have misunderstanding but it is never ok to remain in comfort.</p>\n<p>Most corporatists are not afraid to call the vulnerable people lazy but avoid difficult conversation themselves in fear of change. The people who pretend to care are the ones investing in military complex to kill unknown humans overseas.</p>\n<p>Simple questions can help cut the chase, get to the point, be productive at workplaces and find real friends; who genuinely care about the wellbeing of humanity, planet and our community.</p>\n<p>For instance, asking where do one stand on Israel Palestine Conflict and why; will save years of misunderstandings. Ability to think, reflect and change when necessary are key factors of real good company.</p>\n<p>I was often asked as to why I support the people of Palestine. My simple answer is that I always stand in solidarity with the oppressed everywhere.</p>\n", "date_published": "2021-04-25T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/what-is-wrong-with-our-society/", "url": "https://kiri-vadivelu.ca/blog/what-is-wrong-with-our-society/", "title": "What is Wrong with Our Society?", "content_html": "<p>Nothing. Our society is fine. We are the problem. All of our actions have have consequences. That social, economical and political conflicts as result of our direct actions and inactions. We must stop using violence and start peaceful means to communicate with one another.</p>\n<img alt=\"Funding war and destruction instead of social welfare\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/w19lynNBHe-300.jpeg\" width=\"600\" height=\"592\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/w19lynNBHe-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/w19lynNBHe-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Over 90 percent of the world is organized through one and only capital means of production. Unfortunately, capitalism thrives on the ability to exercise violence. For an example, United States have the best military; therefore, all countries must agree to contribute to capital means of transactions. No country that produce goods can demand anything, should they do, will be faced with military intervention.</p>\n<p>In a capitalistic society; also misunderstood as free society, all transactions are completed with the potential threat of violence for non-compliance. For an example, countries such as Cuba are excluded from free trade and sanctioned to death due to fair compensation for all workers. However, the ability of Cuba to provide free education, healthcare and housing for all; regardless of poverty indicates the power of sharing.</p>\n<p>The reason American people participate in social, economical and political violence is because of lack of knowledge and awareness about the economy and the world around. When a child starts to eat sugar, there is no understanding about the consequences of sugar consumption but only fulfilling the instant desires; in return, is detrimental to health.</p>\n<p>The financial institution is the cornerstone of American economy. Our banks exercise violence on poor people without any social, economical or political consequences. Indeed, we have laws in place to protect the banks; not individuals from banks. For an example, bank decide that poor people must pay high price for bank accounts because of poverty. In a free society, that is violence but the ugly side is placed in the shadow.</p>\n<p>There are more than one ways to organize our society. North Americans have surrendered to sole capitalistic way of doing things because it helps the rich get rich and poor get poorer in the absence of government interference. The only real purpose of our government is to collect taxes, declare wars and protect the financial interest of the big corporations.</p>\n", "date_published": "2021-04-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/three-pillars-of-social-system/", "url": "https://kiri-vadivelu.ca/blog/three-pillars-of-social-system/", "title": "Three Pillars of Social System", "content_html": "<p>Based on the classification system, RULING CLASS does not benefit directly from the wars. However, ruling class require expressing the interest of the OWNER CLASS to remain in power. For instance, Deputy Prime minister of Canada, Chrystia Freeland attending Ukraine support rally to carry Ukraine-Nazi flag is an expression of owner class interest; instead of anti-poverty flag.</p>\n<img alt=\"Ruling class governance of workers\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Si25xe1BAO-300.jpeg\" width=\"600\" height=\"306\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Si25xe1BAO-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Si25xe1BAO-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Although, true solution to the Ukraine Russia war is on the table, ruling class of all nations would advocate for war mongering efforts. For instance, sending weapons to conflict zone under the banner of peace and democracy to promote war is the perfect irony of all rather than de-escalation through peaceful resolutions. Casualties of all warfare are truth, environment and WORKING CLASS.</p>\n", "date_published": "2021-04-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/will-smith-slapped-chris-rock-nonsense/", "url": "https://kiri-vadivelu.ca/blog/will-smith-slapped-chris-rock-nonsense/", "title": "Will Smith Slapped Chris Rock Nonsense", "content_html": "<p>Most people found out about the elite hand picked clown award show after Will slapped Chris. Why the heck the entire social media is talking about the nonsense? Well, elites know how to play the game. Millionaires played their usual trick to turn the attention of pay-cheque hostages on them.</p>\n<img alt=\"Will Smith slaps Chris Rock on stage\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/1-svFLfewL-300.jpeg\" width=\"600\" height=\"399\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/1-svFLfewL-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/1-svFLfewL-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Apparently, elites have feelings but they cannot understand inequities and biggest transfer of wealth in the history from the bottom to the top of the food chain. Now, elites wants mortgage slaves to talk about their feelings. Just follow the pattern, COVID, Ukraine, Grammy, what is next new world order? In between, both elites doubled their wealth with one slap.</p>\n<p>Sadly, masses are the sheep, only useful for war recruitment, wake up wake up. You are more important than them, your feelings matter, your family more important than them. What keeps everyone prisoned in the cruel society needs to be challenged, let us not be distracted.</p>\n", "date_published": "2021-04-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/who-votes-in-municipal-elections/", "url": "https://kiri-vadivelu.ca/blog/who-votes-in-municipal-elections/", "title": "Who Votes in Municipal Elections?", "content_html": "<p>Who votes in Toronto municipal elections? This landmark study identifies significant variations in voter turnout among eligible voters across the city’s 44 wards and 140 official neighbourhoods over the past three civic elections of 2003, 2006 and 2010. We are especially interested in identifying how an area’s proportion of immigrants, visible minorities, tenants and its median household income impacts voter turnout. We conclude that Toronto has a distinctly uneven geography and demography of municipal voting. An excerpt from MayTree Policy Research.</p>\n<img alt=\"Toronto from sky view\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/io58zH0-U8-300.jpeg\" width=\"600\" height=\"399\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/io58zH0-U8-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/io58zH0-U8-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p><a href=\"https://maytree.com/wp-content/uploads/Who_Votes-final.pdf\">PDF</a></p>\n", "date_published": "2021-04-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/kick-the-can-down-the-road/", "url": "https://kiri-vadivelu.ca/blog/kick-the-can-down-the-road/", "title": "Kick the Can, Down the Road", "content_html": "<p>There are many strategies to solve real problems rather than to let them persist. A primary method employed in politics is kicking the can down the road instead of reaching for the solution. Every problem is an opportunity for profit under capitalism. Hence, elected officials are loyal to the profit of big corporations than the needs of the people.</p>\n<img alt=\"Political inability to solve social problems\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ithDogGAvJ-300.jpeg\" width=\"600\" height=\"386\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ithDogGAvJ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ithDogGAvJ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Solving any problem first requires genuine intent to admit the problem. Then, collective efforts need to be in place to find real solutions. However, that means people need to accept the wrongs and willing to do right. Taking responsibility and finding solution to problems are too much work, time consuming and no one gain profit. And, any attempt is likely to receive backlash and be isolated from main players.</p>\n<p>Therefore, community problems are often left unresolved and used for political gains and corporate profit. Often blamed on vulnerable such as minorities, immigrants, non-christians, liberals, media and the deep state. Ever noticed that financial institutions are free from all forms of criticism? For an example, the bank account fees are decided based on quarterly performances to meet the unrealistic greed of next quarter.</p>\n<p>Interestingly, our half baked economists argue inflation without analyzing the exponential growth of corporate profit from 1970 to 2020 or CEO salaries along with the expansion of corporate welfare toward greenwashing corporations. That is what happens to our tax dollars under the illusion of democracy.</p>\n", "date_published": "2021-04-29T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/rise-and-fall-of-great-america/", "url": "https://kiri-vadivelu.ca/blog/rise-and-fall-of-great-america/", "title": "Rise and Fall of Great America", "content_html": "<p>In most developing countries, American dream is still the ultimate achievement of true happiness and satisfaction. But, those who are already in North America and hostage to financial institutions argue that a great American nightmare. When you build American Empire using blood and sweat of working class Americans by looting the planet under the pretext of democracy, that is nothing but armed robbery of world peace.</p>\n<img alt=\"The rise and fall of America\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/_V-vYEv19h-300.jpeg\" width=\"600\" height=\"315\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/_V-vYEv19h-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/_V-vYEv19h-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The 200 plus years of countless war campaigns consumed over 1.5 million American soldiers and wounded nearly 2 million, all outside of American borders. All wars were proactive and no one were invading America; where, Americans were defending their sovereignty. Advancement of American military has rotten our planet with cluster bombs and broken glasses on every part of the world, where a toddler may be forced to walk. Although the world is a place for all, BlackRock bankers decided who get to live and where, the outcome of inhumane colonization culture.</p>\n<p>Yet, wise woke Americans resisted industrial revolution since 1970 through 20th century, the minority voices were ignored by the elites and defeated at the election every time. Keeping the left and right divided under the illusion of progress really helped shift the blame, sell war and cause destruction with consent instead of peace, unity and harmony. Greed of ruling class to produce more of everything while staring at the stock market screens without sustainability has coerced the earth to become a place of trash storage.</p>\n<p>America became the largest empire in the history of humankind with most sophisticated weaponry system. Today, American military complex is the sole guardian of trash planet and pool filled with the innocent blood. Environmental code red means 90 percent of water is unsafe to consume. Greatest North American Empire owns everything in a planet that is uninhabitable for all humans.</p>\n", "date_published": "2021-04-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/labour-day-with-kurdistan-community-at-thomason-s-park/", "url": "https://kiri-vadivelu.ca/blog/labour-day-with-kurdistan-community-at-thomason-s-park/", "title": "Labour day with Kurdistan Community at Thomason’s Park", "content_html": "<p>Labour day celebration with Kurdistan community in Thomason’s Park, Scarborough. Unlike any other celebration, labour day bring all workers across the communities together in the same spirit. Workers build the country; not corporations. Thats why union of working people always strive to protect the communities everyday as oppose corporate green-washing for media coverage to mask everyday exploitation of labour and resources.</p>\n<img alt=\"Labour day celebration with Kurdistan community at Thompson's park\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ETWtY1JQAV-300.jpeg\" width=\"600\" height=\"800\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ETWtY1JQAV-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ETWtY1JQAV-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The non-corporate event was broadcasted on Facebook. <a href=\"https://www.facebook.com/RadioPeshang2012/videos/694608471851267/\">Video</a>.</p>\n", "date_published": "2021-04-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/housing-is-essential-no-covid-evictions/", "url": "https://kiri-vadivelu.ca/blog/housing-is-essential-no-covid-evictions/", "title": "Housing is Essential: No Covid Evictions", "content_html": "<p>Thursday, May 27 at 7 pm, “No COVID Evictions” with Rob McBean of Socialist Action and ACORN. Host: Elizabeth Byce. Discussants: Maryanna Lewycky, East York ACORN, founding member of CAPREIT Tenants’ Union, Euridice Baumgarten, Tenant Worker, Federation of Metro Tenants’ Associations, and Kiri Vadivelu, Scarborough ACORN, founder of Scarborough Tenants’ Union.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Zl9JfA2GGJ-300.jpeg\" width=\"600\" height=\"309\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Zl9JfA2GGJ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Zl9JfA2GGJ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Please watch the entire debate on Youtube. <a href=\"https://www.youtube.com/watch?v=_OJ7aPevVgU\">No Covid Evictions</a></p>\n", "date_published": "2021-05-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/destruction-of-english-language/", "url": "https://kiri-vadivelu.ca/blog/destruction-of-english-language/", "title": "Destruction of English Language", "content_html": "<p>English, a 1500 years old German language, British adapted and universalized through European colonizations. Fluency of English or any language is unrelated to human Intelligence, through socially constructed illusion as such.</p>\n<img alt=\"Evolution of English language\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/KA5MNIdX8T-300.jpeg\" width=\"600\" height=\"401\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/KA5MNIdX8T-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/KA5MNIdX8T-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The words with dual and confusing meaning enabled people to interpret different meanings. Additionally, avoiding distinctive characteristics, prioritizing non-verbal cues and masking of true meaning of words for corporate advantage only demised the quality of language. For instance, weasel words such as “reorganization” have no purpose in communication but a tool for deception and eliminate jobs in corporate environment.</p>\n<p>The colonial system facilitated the grounds for destruction of English through masking real meaning in conversations, written text and legal atmosphere; in order to portray anti-civil nature of corporations to look appealing to the public. Since corporations view economical and social equality as hostile to profitability, the language manipulation was necessary to conduct government and business transactions.</p>\n<p>Most corporations; particularly financial institutions operate in a manner to promote the system of manipulation. The ability of a person to communicate without revealing political and individual preferences is considered to be an asset in such environment. Hence, feel good liberal democratic politicians are judged to be the most dishonest individuals.</p>\n<p>Unfortunately, evolution is a two way street, English has reached the peak and then began downward slope as profit was the only pulling direction. Today, English is the only universal language that can be used to communicate lies, deception and misinformation without facing social or cultural consequences.</p>\n<p>A language is an important identity of any culture in a civilized society. Pursuit of language neutrality in English language, the Great British paved the path for destruction of its own. Historically, the one with the gun won the negotiation but the narrative shifts when everyone owns one.</p>\n", "date_published": "2021-05-27T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/report-on-acorn-led-protest-against-big-bank-fees/", "url": "https://kiri-vadivelu.ca/blog/report-on-acorn-led-protest-against-big-bank-fees/", "title": "Report on ACORN-led Protest Against Big Bank Fees", "content_html": "<p>On July 13, 2021 Socialist Action members joined in solidarity with 40 ACORN activists to protest the policies of the big banks. The Toronto action was part of a cross-country set of rallies to demand lowering NSF (Not Sufficient Funds) penalties from $45 to $10, waiving the minimum bank balance of $4000 to end discriminatory fees and stopping the financing of predatory lenders like EasyFinancial. In the heart of downtown Toronto, the march for fair banking touched major financial institutions in the Bay and King street zone.</p>\n<p>Protesters with signs occupied space inside Scotia Bank for about 15 minutes to share the message, and then occupied the front entrance of other banks, since entry doors were locked. A leading spokesperson of Indigenous people, as well as Toronto Centre NDP MPP Suze Morrison, addressed the gathering.</p>\n<img alt=\"Poof rally in Toronto\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/2m3simxk2Q-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/2m3simxk2Q-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/2m3simxk2Q-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>On the same platform, SA member Kiri Vadivelu spoke on the megaphone about his personal experience with banking, as well as what needs to be done to protect vulnerable people from corporate exploitation. Campaign for nationalization of the big banks under a worker’s government was the message, loud and clear. After the speak-out, protesters occupied the Bay and King intersection, displaying banners and signs. Some 15 police watched the live event from the sidewalk.</p>\n<p>City TV news provided national coverage of the story, which can be seen on ACORN’s site. <a href=\"https://acorncanada.org/acorn-members-take-big-banks-demand-bank-fees-back\">Acorn Members Take on Big Banks</a></p>\n", "date_published": "2021-07-13T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/do-not-abandon-the-vulnerable-act-now/", "url": "https://kiri-vadivelu.ca/blog/do-not-abandon-the-vulnerable-act-now/", "title": "Do not Abandon the Vulnerable. Act Now!", "content_html": "<p>On Saturday, September 18, 2021, a small crowd rallied in Toronto at the Yonge and Dundas intersection calling for an end to discriminatory funding to ODSP and OW programs. POOF Protecting ODSP OW Funding is a community group striving to end Homelessness and Poverty for people on ODSP, Ontario Disability Support Program and OW, Ontario Works benefits. The event organizer, Isabella Gamk, said that people on ODSP and OW benefits are abandoned by all 3 levels of Canadian Government and left to fend for themselves with less than a livable income support. Sadly, the City of Toronto has no tangible plans to help marginalized people living on a poverty income.</p>\n<img alt=\"Poof rally in Toronto\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/cn5tAmNIqf-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/cn5tAmNIqf-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/cn5tAmNIqf-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Average Market Rent for a Room in Toronto is needed when 93% of OW clients DO NOT actually live in Subsidized Housing according to the Income Security Advocacy Center. Rooms start at $800.00 per month, but the OW Rent/Shelter Allowance is only $390.00 per month per single client. 88% of ODSP clients DO NOT live in Subsidized Housing according to ISAC and face the same problem with single clients only getting $497.00 for a Shelter Allowance/Rent. Isabella asked how can any human being already disadvantaged Socially and Economically afford to live in the city with any Dignity and Respect? She recalled that several people she knew who were on the ODSP and OW benefits are no longer alive, having either committed suicide or died early due to poor health, living standards and a loss of hope. The question remains how politicians in power are able to get away with such disgraceful treatment of people they supposedly serve in the city.</p>\n<img alt=\"Poof rally in Toronto\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/2ZCiI29-Q9-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/2ZCiI29-Q9-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/2ZCiI29-Q9-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Recently, Homeless people who lived in the Encampments at Trinity Bellwoods Park and near Lamport Stadium were violently removed by city of Toronto Police Services and charged with various offenses. Jon Sanderson, who runs a YouTube channel called The Canadian Commie, said to the crowd, “Instead of Housing the Homeless people, our City spent over 2 million dollars to violently remove the people from the parks with no permanent Housing Solutions”. To add insult to injury, police also charged many Encampment Workers, Social Support Staff and Community Activists, who defended people from police violence, with numerous dubious charges including ‘obstructing a peace officer.’</p>\n<p>Barry Weisleder, federal secretary of Socialist Action, expressed solidarity with protesters at the POOF rally. He assured that under a Workers’ Government everyone will have food, housing, medical care and decent living conditions. He said that capitalism is the Root Cause of the Social and Economic Injustices to people — particularly those who come from Marginalized Communities. Several Social Science Academics from University of Toronto and Ryerson echoed this view that, profit system greed does not prioritize the Basic Necessities of Humanity, and growing Wealth Inequality is unsustainable.</p>\n", "date_published": "2021-09-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/climate-crisis-eco-socialism-or-extinction/", "url": "https://kiri-vadivelu.ca/blog/climate-crisis-eco-socialism-or-extinction/", "title": "Climate Crisis: Eco Socialism or Extinction", "content_html": "<p>On September 24, 2021 over a thousand environmental activists took to the streets of Toronto as part of a worldwide climate strike. The event, organized by Fridays for Future Toronto, shouted “Save Our Planet” loud and clear. The protesters, including students, workers, women and children, walked together to end violence against the nature, the planet and humanity.</p>\n<img alt=\"Students lead climate strike in Toronto\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/XvRwZ4rJ1_-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/XvRwZ4rJ1_-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/XvRwZ4rJ1_-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Students carried signs and banners: “We Need a Revolution”, “Stop the Lies, Stop Funding Crisis, No Planet B”. A large black banner “Code Red” led the march. Environmentalists are furious due to inaction by capitalist politicians. Burning of fossil fuel is the primary cause of global warming today. While most climate deniers changed their position from denial to acceptance, the problem remains unsolved. Most Canadian provinces are in the process of banning straws and polythene bags — too late to make a tangible difference.</p>\n<p>Fossil fuel extraction qualitatively increased in the 1950s. Corporate profit ruled ruthlessly. Policy makers relied on the reports of environmental offenders to make policy. They were blind-sided by the cruel nature of capitalism. Fast forward to 2021, people are disrupting the comfort zone of those in power. No more lies, we demand climate justice.</p>\n<img alt=\"Students lead climate strike in Toronto\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/CHybWjI_F--300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/CHybWjI_F--300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/CHybWjI_F--600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Socialist Action members were prominent with red flags and a banner with the slogan “Eco Socialism or Extinction”. A leading member of Socialist Action, Julius Arscott, stated that capitalism is killing the planet; that working people need to rise together to save our planet. Volcanoes are erupting, nations are being flooded; thunder, lighting and hurricanes are occurring with unprecedented speed and strength, while the rulers still contend with denial of the emergency. Dozens of folks, mostly youths, signed up for more information at the SA canopy and spent over $100 on socialist literature and buttons.</p>\n<p>Hundreds of years ago, Indigenous people signed treaties with the colonial settler state to protect land, water and wild life pre-Confederation. None of the conditions were obeyed, resulting in the present calamity. Many Indigenous people, including Miguel Martin Avila Velarde from Toronto Community Housing, say that Truth and Reconciliation is a shameful process to conceal the responsibility of those in power. The truth is climate justice is Eco-socialism or extinction.</p>\n", "date_published": "2021-09-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/tupac-why-the-good-leave-too-early/", "url": "https://kiri-vadivelu.ca/blog/tupac-why-the-good-leave-too-early/", "title": "Tupac, Why the Good Leave Too Early?", "content_html": "<p>From a philosophical point of view, good things tend to not last very long. It is a blessing and curse at the same time. If the good remains for longer duration, it becomes the norm; therefore, good only last a while. Like the early morning mist that disappears when the sun light appear, good things evaporate before we digest.</p>\n<img alt=\"African American Rapper Tupac Shakur\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/PRLj_YK4_G-300.jpeg\" width=\"600\" height=\"658\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/PRLj_YK4_G-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/PRLj_YK4_G-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>On the revolutionary front, people yarn for great leaders but then disappointment follow soon after their departure. For the most part, visionary leaders know that they have very little time to make an impact. Unlike the corporate fat cats in coat suit and tie, civil rights movement leaders as the Great Malcolm X do not expect red carpet gratitude for their work. He dedicated his life to liberate the black people from social slavery while did many good for the benefit of humanity.</p>\n<p>The most riskiest work in a capitalist society is community mobilization for the good of humanity. Those leaders do not get rich but often make unimaginable personal sacrifices for the benefit of society we live today. However, wild corporate cats view the great social work as threat to wealthy in society. Capitalism, a product of colonialism, supports military mobilization for war but demonize social unification that benefit workers and the oppressed.</p>\n<p>For instance, rapper Tupac Shakur was not a humanitarian but attempted to unite the divided African American people who were subject to systematic poverty in United States. Although, he pursued a risky hiphop lifestyle, he really inspired people using his music for the good of humanity. He shared his knowledge, experience and wisdom with intent to make life better for the people in the hood.</p>\n<p>Let us examine few lyrics of Tupac that are still relevant today. Those lyrics really highlights many social issues that we are up against the system that continue to benefit the few. Normally, I do not like foul language in any form that disrespects people or nature but when Tupac does, I am irresistible.</p>\n<h3>War</h3>\n<p>“Before we find world peace, we gotta find peace and end the war in the streets.” (‘Ghetto Gospel’ 2004)</p>\n<h3>Discrimination</h3>\n<p>“And since we all came from a woman, got our name from a woman and our game from a woman, I wonder why we take from our women, why we rape our women, do we hate our women?” (‘Keep Ya Head Up’ 1993)</p>\n<h3>Slavery</h3>\n<p>“Only thing they ever did wrong was bein’ born black in this white man’s world.” (‘White Man’z World’, 1996)</p>\n<h3>Violence</h3>\n<p>“Here on Earth, tell me what’s a black life worth? A bottle of juice is no excuse, the truth hurts.” (‘I Wonder If Heaven Got a Ghetto’ 1997)</p>\n<h3>Racism</h3>\n<p>“And why the hell am I locked in jail? They let them white boys free, we be shocked as hell.” (‘God Bless The Dead’ 1998)</p>\n<h3>Oppression</h3>\n<p>“They got me trapped, can barely walk the city streets without a cop harasskin’ me, searching me, then askin’ my identity. Hands up, throw me up against the wall, didn’t do a thing at all.” (‘Trapped’ 1991)</p>\n<h3>Poverty</h3>\n<p>&quot;They got money for war, but can't feed the poor”. (‘Keep Ya Head Up’ 1993)</p>\n<h3>Injustice</h3>\n<p>“So we live like caged beasts waitin’ for the day to let the rage free. Still me ’til they kill me.” (‘Holler If Ya Hear Me’ 1993)</p>\n<p>The list is long but few handpicked examples are suffice to get the point across. After reading Tupac’s lyrics, why would any police force employed by the corporate government would ever want to solve the murder of Rapper Tupac? Since Tupac is too popular to provide a false closing, traitors of working class left the case unresolved long enough to please the ruling powers.</p>\n<p>While reasons for leaving early may vary for such an artist like Tupac due to place of living, choice of associations and type of lifestyles; however, that does not eliminate the possibilities of corporate employment.</p>\n", "date_published": "2021-10-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/who-controls-toronto-people-or-developers/", "url": "https://kiri-vadivelu.ca/blog/who-controls-toronto-people-or-developers/", "title": "Who Controls Toronto - People or Developers?", "content_html": "<p>In the 2018 Toronto Municipal Election, 34% of all campaign contributions came from people with ties to the development industry. Many important decisions on the right to housing are being influenced by these donors, to the detriment of regular people in Toronto. An excerpt from Acorn Canada Research.</p>\n<img alt=\"Save affortable housing\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/NJYAsWxZo6-300.jpeg\" width=\"600\" height=\"338\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/NJYAsWxZo6-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/NJYAsWxZo6-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>In 2018’s election for Toronto City Council Toronto over four million dollars was donated to the winning candidates alone, not to mention countless other donations to those who lost or dropped out. The election was a strange one, with newly elected Premier Doug Ford intervening mid-election to cut the number of wards eligible for representation on council in half, from 47 to 25.</p>\n<p>Of the 23 councillors elected, who still sit on council, to represent all Torontonians, donations totalled $2,776,359 and Mayor John Tory received $1,288,650 in donations to his campaign for reelection. This money all came from private donors, who did not necessarily live in the City but who were motivated to play a role in who would make important decisions on how the city was run for the next four years. <a href=\"https://acorncanada.org/wp-content/uploads/2021/10/Who-Controls-Toronto-People-or-Developer-0.pdf\">PDF</a></p>\n", "date_published": "2021-11-14T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/omicron-crisis-workers-on-the-frontline/", "url": "https://kiri-vadivelu.ca/blog/omicron-crisis-workers-on-the-frontline/", "title": "Omicron Crisis: Workers&#39; on the Frontline", "content_html": "<p>On Tuesday, January 11, 2022 at 7p.m. over 300 front-line workers from coast to coast joined a Zoom Conference in response to the Omicron crisis. The conference host, Justice for Workers Organization, was overwhelmed by the participation and passion of frontline workers from variety of sectors, including health, education, transportation, agriculture and newly emerging freelance/ gig workers. The conference included special guest Ontario New Democratic Party (ONDP) Member of Provincial Parliament (MPP) Peggy Sattler from London West, guest speaker Dr. Naheed Dosani, and observers from the Migrant Rights Network, along with Ontario Federation of Labour (OFL).</p>\n<img alt=\"Workers' on the Frontline through Omicron\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/GWW--jNZnE-300.jpeg\" width=\"600\" height=\"323\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/GWW--jNZnE-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/GWW--jNZnE-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The conference began with an Indigenous land acknowledgement; then, workers from nursing, teaching and migrant workers led the presentations by sharing their first hand experiences on the front-line. All speakers expressed how they are painfully exhausted and let down by the support system and questioned the great failings of political leadership to save lives in the current pandemic. A migrant personal support worker reported that she is not eligible for any benefits due to her temporary worker status and lacks enough money to purchase Advil and Tylenol that she needed in order to pull through 12 hour shifts regularly – the new norm of worker exploitation in developed countries.</p>\n<p>Demanding justice for workers is not a radical demand. Insisting to save lives of the socially, economically and politically vulnerable in the crisis is not a radical demand. What is radical is having no empathy for workers. Allowing systemic racism, ableism and classism to be used as an excuse to deny justice is undeniably, radically outrageous. “Governments have abandoned the workers through promoting the idea that Omicron as less severe without scientific evidence” said Dr.Naheed. Furthermore, reducing isolation from 10 to 5 days instead of expanding 10 paid sick days is a cynical business decision.</p>\n<p>The conference unanimously agreed that worker issues in the pandemic are human rights violations. The loopholes within existing laws, the two-tier system, and the lack of enforcement was destroying the health and safety of workers even prior to the pandemic; then, COVID-19 just accelerated the destruction. After two years of pandemic, government has still not shown any determination to adopt better policies to improve working conditions for front-line workers. Workers of all industries were among the first victims of the pandemic – determined to connect with one another despite the health crisis.</p>\n<p>The Migrant Rights Advocacy group argued that workers are pitted against each other through distribution of benefits based on citizenship status. All workers need to be treated fairly and provided the help needed in the pandemic. Justice for workers is undeniably necessary. Due to increasing Omicron infections, outraged workers expressed their discontent through hundreds of phone calls and email messages to office of Prime Minister Justin Trudeau, Finance Minister Chrystia Freeland, and to regulatory agencies. Sadly, the meeting failed identify capitalism as the root cause of the crisis that all workers face today. However, the courage and determination to fight to free workers from horrendous conditions took on a pre-revolutionary tone not heard in a long time.</p>\n", "date_published": "2022-01-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-lies-deception-and-the-romance/", "url": "https://kiri-vadivelu.ca/blog/the-lies-deception-and-the-romance/", "title": "The Lies, Deception and the Romance", "content_html": "<p>When we ask, why most people dislike politics, the answer is pretty obvious. No one likes being lied or asked to believe a false reality. Therefore, working people shy away from politics; which reflects in the statistics that only a small percentage of eligible working people actually vote in local politics. If all the workers actually caste vote, status quo will change in a heartbeat, that is the great nightmare of ruling class.</p>\n<img alt=\"Romantic of lies and deception\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/NHxKR8skOX-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/NHxKR8skOX-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/NHxKR8skOX-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Ruling political parties always act in the interest of the few; that is why minimum wage do not change, our living conditions do not improve but cost always rise. Ruling class is filled with greed and views working people as their enemy; that is why police are over funded for security while schools and hospitals are underfunded. The power hungry politicians use all fancy and buzz words to come to power but if you look closer, it is same old shit.</p>\n", "date_published": "2022-02-19T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/vaccine-mandates-unite-left-and-right/", "url": "https://kiri-vadivelu.ca/blog/vaccine-mandates-unite-left-and-right/", "title": "Vaccine Mandates Unite Left and Right", "content_html": "<p>For long time, people on the left and right were divided; however, pandemic closed the gap. Ruling class is on the edge of falling into the ocean; yet, holding onto the greed of wealth by funding the paramilitary structures and wars. Regardless, vaccine mandates elegantly united the left and right in a way that no one have ever imagined. Mask is not the problem, the slavery wage is that both sides now agree except the ruling class.</p>\n<img alt=\"Church, government and the corporations\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/hfqnlE946b-300.jpeg\" width=\"600\" height=\"589\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/hfqnlE946b-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/hfqnlE946b-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Ever wondered why minimum wage never translated into living wage in the richest US and Canada? Because workers complied to demands of the ruling class.</p>\n", "date_published": "2022-03-06T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/pandemic-ceos-and-fake-guru-market/", "url": "https://kiri-vadivelu.ca/blog/pandemic-ceos-and-fake-guru-market/", "title": "Pandemic CEOs and Fake Guru Market", "content_html": "<p>Regardless of political standing, we can all agree that pandemic have exposed many issues in our society. One the core issue was unjust wages that resulted in people earning less and losing more through the pandemic; meanwhile, those at the top get richer. The status quo argument was that CEOs earn their salary but poor workers are not. The conversation took a 360 turn after pandemic where front line workers were working the hardest under dangerous conditions while CEOs were watching Netflix.</p>\n<img alt=\"Fake gurus and pandemic CEOs\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/uRwzeWpkNj-300.jpeg\" width=\"600\" height=\"335\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/uRwzeWpkNj-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/uRwzeWpkNj-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>&quot;I worked very hard for it&quot; to justify your position as a billionaire is one of the most absurd things I can imagine when there are people working multiple jobs who still do not make enough to feed their children and pay the rent. - Clint Smith.</p>\n<p>The fake gurus continue to sell the myth that hard work pays off. But, we all know that is the gimmick to sell something no one needs. Not only the pandemic exposed status quo fake gurus but bankrupted many through making people become more vigilant to everyday scams.</p>\n", "date_published": "2022-03-08T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/corporate-misuse-of-canadian-tax-revenue/", "url": "https://kiri-vadivelu.ca/blog/corporate-misuse-of-canadian-tax-revenue/", "title": "Corporate Misuse of Canadian Tax Revenue", "content_html": "<p>Despite previous assurances that it would not result in additional costs, a new report says the TTC will spend millions of dollars more on fare collection each year by using the Presto smartcard instead of tickets, tokens and passes. Skeleton in the closet is the breach of privacy and violent enforcement of the broken fare system. An excerpt from Toronto Star.</p>\n<img alt=\"TTC, Metrolinx and the Presto scam\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/__byY0vHZ0-300.jpeg\" width=\"600\" height=\"424\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/__byY0vHZ0-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/__byY0vHZ0-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The TTC board agreed to adopt the fare card in 2011 under pressure from the provincial government, which made the allocation of gas tax proceeds to the city contingent on the deal.</p>\n<p>At the time, a TTC report said the fees the agency would pay to Metrolinx to operate Presto “would be offset by other TTC fare collection operating savings and should result in no net increase to TTC’s overall fare collection operating costs.”</p>\n<p>Corporations cannot solve transit problems without extorting profit. Our elected officials not only dump founded but screwed public in exchange fancy new toys and luxury dine ins. Scam is a scam regardless of how they phrase it. <a href=\"https://www.thestar.com/news/gta/2018/06/08/presto-to-cost-ttc-millions-more-than-current-fare-system.html?fbclid=IwAR2SEDJ6TFj53MEsOoZ6MGz9LxTFh8UALIbLqe5WxPmI2gaVGsZsYz1fYzw\">Read more</a>.</p>\n", "date_published": "2022-04-09T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/inflation-gimmick-in-status-quo-politics/", "url": "https://kiri-vadivelu.ca/blog/inflation-gimmick-in-status-quo-politics/", "title": "Inflation Gimmick in Status Quo Politics", "content_html": "<p>Instead of throwing around fancy terms, we must stop and define all the buzz words. What is inflation? where does it begin? Is it caused by nature? Who wins and who loses? Answering the four questions would set one on the right path to realize inflation is just an economical gimmick to justify the status quo. The buzz word inflation is political forgery to protect the ruling class.</p>\n<img alt=\"Political fraud use of inflation\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/YLO6DTwiDV-300.jpeg\" width=\"600\" height=\"369\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/YLO6DTwiDV-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/YLO6DTwiDV-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Big corporations will do anything to sell the myth that inflations occurred by everything except corporate greed. In 1970s, anyone with minimum wage job can buy a house but in 2020, minimum wage earner cannot even afford to rent and eat at the same time. Meanwhile corporate CEO salary went up by over 1000 percentage. The common logic is that money incentivize performance but the same logic do not apply to minimum wage workers. That is the gimmick of status of politics.</p>\n<p>Why? The 50 years of corporate greed made few rich and many broke while decimating the public trust in government. Who wins, the ruling class, big corporations and the churches. Who loses, the workers, unions and the vulnerable.</p>\n", "date_published": "2022-05-03T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/confronting-genocide-in-canada-regretfully/", "url": "https://kiri-vadivelu.ca/blog/confronting-genocide-in-canada-regretfully/", "title": "Confronting Genocide in Canada Regretfully", "content_html": "<p>The Canadian Museum for Human Rights recognizes that the colonial experience in Canada, from first contact to the present, constitutes genocide against Indigenous peoples. The Indian residential school system was one key component of this genocide.</p>\n<img alt=\"Indigenous children in Catholic residential school in 1900 century\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Jng0VNENYM-300.jpeg\" width=\"600\" height=\"545\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Jng0VNENYM-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Jng0VNENYM-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>That is how residential schools started but then how it ended was inconceivable to anyone. What happened in the dark in secrecy those children are unforgivable in history.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/b_CQQE4CSQ-300.jpeg\" width=\"600\" height=\"438\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/b_CQQE4CSQ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/b_CQQE4CSQ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Paying respect is not enough. Ruling powers must act without delay to prosecute all those involved and restore democracy.</p>\n<img alt=\"No covid evictions protest online\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ierpYDTtax-300.jpeg\" width=\"600\" height=\"444\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ierpYDTtax-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ierpYDTtax-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2022-05-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/key-facts-about-residential-schools/", "url": "https://kiri-vadivelu.ca/blog/key-facts-about-residential-schools/", "title": "Key Facts About Residential Schools", "content_html": "<p>Residential schools were government-sponsored religious schools that were established to assimilate Indigenous children into Euro-Canadian culture. Although the first residential facilities were established in New France, the term usually refers to schools established after 1880. Residential schools were created by Christian churches and the Canadian government as an attempt to both educate and convert Indigenous youth and to assimilate them into Canadian society. However, the schools disrupted lives and communities, causing long-term problems among Indigenous peoples. The last residential school closed in 1996. An excerpt from The Canadian Encyclopedia.</p>\n<img alt=\"Residential school children in Canada\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/i-EgfC1Ml3-300.jpeg\" width=\"600\" height=\"542\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/i-EgfC1Ml3-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/i-EgfC1Ml3-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>What were residential schools? Residential schools were government-sponsored schools run by churches.</p>\n<p>What was the purpose of residential schools? The purpose of residential schools was to educate and convert Indigenous youth and to assimilate them into Canadian society.</p>\n<p>How many students attended residential schools? An estimated 150,000 children attended residential schools.</p>\n<p>How many children died at residential schools? An estimated 6,000 children died at residential schools (records are incomplete).</p>\n<p>How many residential schools were there in Canada? In total, over 130 residential schools operated in Canada between 1831 and 1996.</p>\n<p>In 1931, there were 80 residential schools operating in Canada. This was the most at any one time.</p>\n<p>When did the first residential school in Canada open? The Mohawk Institute in Brantford, Ontario, accepted its first boarding students in 1831.</p>\n<p>When did the last residential school in Canada close? The Gordon Residential School in Punnichy, Saskatchewan, closed in 1996. It was the last federally-funded residential school in Canada. [Learn More](https://www.thecanadianencyclopedia.ca/en/article/residential-schools</p>\n", "date_published": "2022-05-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/brand-politics-legitimize-dictatorship/", "url": "https://kiri-vadivelu.ca/blog/brand-politics-legitimize-dictatorship/", "title": "Brand Politics Legitimize Dictatorship", "content_html": "<p>In Canada, we have four mainstream political parties but only two ruled almost the entire time. The red liberal lies and the blue conservative crooks. Although both parties appears to have difficult political platform, in reality, both are just the same with altered words. If we analyze the decisions of each party historically, we would be shocked to know that both parties are just the same brand packaged under different names. Sadly, Obama dropped more bombs, killed more people and replaced legitimate leaders in third world countries than than Trump did.</p>\n<img alt=\"Obama politics of legitimate dictatorship\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/5pXKdE22Fo-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/5pXKdE22Fo-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/5pXKdE22Fo-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Neither of the mainstream party serve the needs of the people but the interest of the ruling class. Big corporations have full control over both parties, they know there is a price tag for everyone. In the modern era, no politician ever have gone broke or homeless after defeat in election.</p>\n<p>That is why, politicians must be honest with people before getting elected and even more after getting elected. Instead of selling the interest of the people to big corporations and transfer public assets to CEOs, politicians must be loyal to the people and the country; not greed.</p>\n", "date_published": "2022-05-24T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/green-washing-while-earth-on-fire/", "url": "https://kiri-vadivelu.ca/blog/green-washing-while-earth-on-fire/", "title": "Green-washing While Earth on Fire", "content_html": "<p>Big corporations from oil to tech continue to green wash the economy for the purpose of more tax dollar extraction. We see that everyday on the television but somehow we are customized to accept the gimmick as real solution. Real solution include raising the standards of living for the people but that would upset the profit margins so green washing the way to go.</p>\n<img alt=\"Big corporations green washing the economy\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/vGnhedTDNL-300.jpeg\" width=\"600\" height=\"445\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/vGnhedTDNL-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/vGnhedTDNL-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2022-05-28T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/inflation-crisis-or-economical-scam/", "url": "https://kiri-vadivelu.ca/blog/inflation-crisis-or-economical-scam/", "title": "Inflation Crisis or Economical Scam?", "content_html": "<p>COVID indicates that inflation is a not a natural cause but a planned economic disaster to make the rich get rich while poor get poor. Instead of being complicit, there are solutions to the problem that status quo leaders do not want people to know. The pandemic have transferred the wealth upwards and proved that the whole banking system is just a scam.</p>\n<img alt=\"Banking scam that keeps people poor\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/P2VpZFZ09K-300.jpeg\" width=\"600\" height=\"566\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/P2VpZFZ09K-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/P2VpZFZ09K-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>We must redefine the problem and address the root causes rather than the symptoms. Our status quo leaders have no interest in solving social problems. It could not be anymore obvious. <a href=\"https://www.instagram.com/p/CcGTvBnF0gh/\">Video</a></p>\n", "date_published": "2022-06-05T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/why-ndp-support-apartheid-crimes/", "url": "https://kiri-vadivelu.ca/blog/why-ndp-support-apartheid-crimes/", "title": "Why NDP Support Apartheid Crimes?", "content_html": "<p>The Federal New Democratic Party (NDP) not only lost the mainstream elections in Canada since early 1990 but also lost its roots to serve the working people completely. Of course, corporate extremists eroded unions, labours and labour party but that is not an an excuse to tangle in internal politics to silence labour and human rights activists within the NDP. Sadly, NDP proved it has no interest in standing up for human rights inside or outside the borders through dropping an elected candidate in Vaughan.</p>\n<img alt=\"Elected Candidate Barry Weisleder\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/eQeHv9c7cD-300.jpeg\" width=\"600\" height=\"519\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/eQeHv9c7cD-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/eQeHv9c7cD-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Weisleder left key information off nomination disclosure form, party claims\nCBC News · Posted: Sep 07, 2011 6:22 PM ET | Last Updated: September 7, 2011\nOn the first official day of the Ontario election campaign, the NDP has dropped its candidate in the Thornhill riding, saying Barry Weisleder's campaign forms fell short of the full disclosure the party requires.</p>\n<p>In an interview with CBC.ca, NDP MPP Gilles Bisson (Timmins-James Bay) confirmed the party dropped Weisleder as a candidate.</p>\n<p>Weisleder has been critical of Canada’s support of Israel.</p>\n<p>He has posted articles on socialist websites, including one that described Israel as &quot;a death trap&quot; for Jews.</p>\n<p>&quot;Instead of a haven for historically persecuted world Jewry, Israel is more and more evidently a death trap for the Jews there, millions of whom would rather be somewhere else,&quot; he wrote on the Socialist Action website in a posting that appeared in December of last year.</p>\n<p>Weisleder has also argued against an attempt by some NDP members to remove any mention of the word &quot;socialism&quot; from the party's constitution during a federal convention in June.</p>\n<p>But Bisson said Weisleder’s political views were not a factor in the decision to drop him as a candidate.</p>\n<p>&quot;The disclosure form is to make sure candidates disclose things that may or may not be used against them in an election,&quot; said Bisson. &quot;He did not accurately fill out his disclosure form, some of that information was not accurate and so we withdrew his nomination.&quot;</p>\n<p>When asked what information was missing, Bisson said the contents of the disclosure form are confidential.</p>\n<p>&quot;That’s a personal matter,&quot; said Bisson. &quot;We’re not going to get into a conversation about what was or wasn’t in the document.&quot;</p>\n<p>Bisson played down the affair, saying: &quot;every party goes through this, there’s nothing extraordinary about this.&quot;</p>\n<p>&quot;There are candidates in every party that represent different parts of the party and the different political spectrum.&quot;</p>\n<p>The NDP plan to nominate a new candidate in Thornhill at a meeting tentatively set for Sunday. <a href=\"https://www.cbc.ca/news/canada/ndp-drops-thornhill-candidate-1.1071170\">CBC</a></p>\n", "date_published": "2022-06-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/alternative-to-pandemic-era-housing-crisis/", "url": "https://kiri-vadivelu.ca/blog/alternative-to-pandemic-era-housing-crisis/", "title": "Alternative to Pandemic-Era Housing Crisis", "content_html": "<p>Whether a couple is planning to settle down or a family is seeking a place to raise kids in the province, they are sure to feel the heat in the Canadian housing market. The question: ‘How did we get here?’ often leads to inconclusive answers and simply pointing a finger at the easiest target. The predatory nature of housing market big players means they have no interest in addressing the needs of the people. For them, housing is a commodity designed to make shareholders happy. Actually, the housing market is doing very well to meet its mandates – funneling wealth upwards.</p>\n<img alt=\"City of Toronto from the sky view\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Tenants in Toronto are well aware of the predatory nature of corporate landlords. The notice below was issued to tenants at 945 Midland Ave, Toronto during the hot July in 2022. Tenants are expected to live in sauna- like conditions; air conditioning is portrayed as a luxury by giant Toronto landlords. Tenants who used portable air conditioners to keep children and elders safe in the sauna like apartments were slapped with extra $120 penalty attached to the rent. Illegal intimidation tactics were old but true tactics for the big landlords to continue issuing notices to demand more rent — by any means necessary.</p>\n<p>The province of Ontario acknowledges illegal acts by predatory landlords but it does nothing to discourage criminal behavior. For a wary tenant, the illegal rent notice is a threat, but for organized tenants in Scarborough it is an annual reminder that landlords do not have their best interest at heart to provide housing solutions. A line-by-line analysis of the notice along with knowledge of Ontario Residential Tenancies Act would confirm the creativity employed to harass, intimidate and threaten tenants with evictions. All levels of governments have clearly failed to serve the needs of the people.</p>\n<img alt=\"Rent notice from Scarborough Landlord\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/jYYC4tykpi-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/jYYC4tykpi-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/jYYC4tykpi-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The current housing system is designed to put profit before people. In order to challenge the status quo and to solve the problems faced by working people in the province in terms of housing, education, healthcare and transit, the Municipal Socialist Alliance presents a real alternative in the upcoming city elections – for public ownership, construction of rent geared to income, accessible housing, seize vacant units in large buildings — to put the needs of people first. The grass-roots movement has attracted many young, first-time candidates to run in the October 2022 municipal elections. Stayed tuned for inspiring results.</p>\n<p>#housingcrisis #electionstoronto #postpandemic</p>\n", "date_published": "2022-06-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-campaign-for-socialism-and-democracy-in-ndp/", "url": "https://kiri-vadivelu.ca/blog/the-campaign-for-socialism-and-democracy-in-ndp/", "title": "The Campaign for Socialism and Democracy in NDP", "content_html": "<p>After nearly four years of the most regressive, incompetent and corrupt Ontario government in decades, opinions polls show the Doug Ford Conservatives leading and the New Democratic mired in third place, well behind Liberals, on the eve of June 2 provincial election.</p>\n<img alt=\"Campaign for Socialism and Democracy in NDP\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/73gtpHtiGO-300.jpeg\" width=\"300\" height=\"391\" />\n<p>How is this possible? Only exceptionally weak NDP policy and leadership can account for this disturbing situation. It’s certainly not a function of popular satisfaction with the status quo.</p>\n<p>Before the onset of the current third wave of the pandemic, the economy was slowly emerging from depression. Suddenly, millions of workers found themselves without emergency benefits, without employment insurance, and still without extended paid sick leave. Giant corporations, including retail chains, big-pharma, telecoms and banks, have reaped billions of dollars in profit over the past two years.</p>\n<p>Not only do they pay minimal taxes -- they derive huge subsidies from the government. The priority of the bosses remains to build super-highways, not homes; to fund pipelines, police and the military, not provide clean water on Indigenous lands; to extend licenses for private profit-gouging Long Term Care firms rather than to extend non-profit quality public health care to include seniors, medical drugs and mental health.</p>\n<p>Inequality is rising, stoked by the flames of inflation. Staggering increases in the cost of food, fuel and rent are a cause of stress that is taking a high toll, especially on young workers who see no future for themselves, or for the natural environment, under the capitalist system.</p>\n<p>But there are signs of growing resistance. In- creasing strike activity indicates organized labour is emboldened at a time of staff shortages in some sectors. In September there were 44 work stoppages, the most in one month since 2018. Casino workers in Belleville negotiated a 13 per cent pay increase over 3 years. Thousands of workers at a Cargill meat packing plant in Alberta threatened strike action and made gains. Thousands of public sector workers went on strike in New Brunswick to blunt the attacks of the Higgs-Tory regime. Congratulations to Canada Goose employees in Winnipeg who won union recognition. Even non-union workers are doing better, posting increases of 9 per cent over the past two years, according to Statistics Canada.</p>\n<p>The rank and file are restless. That was evident in substantial support for the radical Workers’ Action Movement candidates for executive at recent conventions of the Ontario Federation of Labour in early November and at the Canadian Labour Congress in June 2021.</p>\n<p>A strike wave is underway in the United States. Teamsters for a Democratic Union won control of the giant North American Teamsters’ Union in a ground-breaking election. Canadian economist David Card won the Nobel Prize in economics for showing that a rise in the minimum wage does NOT reduce employment. In other words, 'Dare to struggle, dare to win!'.</p>\n<p>But how daring, how bold has the NDP leadership been? The federal election on September 20 was a saddening milepost along the wrong road. While the NDP is a party based on working class institutions, with trade unions represented directly at NDP conventions, it is burdened by a right wing, pro-capitalist, undemocratic leadership. More undemocratic than ever, the NDP brass increasingly hand-picks candidates without holding a local nomination meeting.</p>\n<p>This is done often to exclude social- ist contenders. NDP officials spent most of the party’s federal campaign money on the Leader’s tour and TV ads, over half of an unprecedented treasure chest of $25 million. <a href=\"https://ndpsocialists.ca/wp-content/uploads/2022/02/turn-left-winter-2022-3.pdf\">Read more</a></p>\n", "date_published": "2022-06-30T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/cruel-nature-of-faith-culture/", "url": "https://kiri-vadivelu.ca/blog/cruel-nature-of-faith-culture/", "title": "Cruel Nature of Faith Culture", "content_html": "<p>The faith systems exist to protect the ruling class. Of course, we do not have control over some things in life; however, we do have control over many things including politics. The faith system regardless of religion work together with the ruling powers to justify the status quo and protect the corrupted politics. When corrupted politicians make collective decision to exploit people for profit, churches sell the myth that it is god’s fault.</p>\n<img alt=\"Church, government and the cruelty\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/DwS1CxrBcl-300.jpeg\" width=\"600\" height=\"334\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/DwS1CxrBcl-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/DwS1CxrBcl-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Indeed, it is the fault of greedy politicians. If there are no faith system in place, people will quickly realize bad politics hurts our society. The truth is that, for the part, our lives are negatively impacted not because of god but because of bad politicians and dishonest faith business. Under all circumstances, if you prefer status quo, go to church, if you prefer solution, go to local politicians office.</p>\n<p>In case, if you feel excluded because I only used church as an example, simply replace church with your preferred religious structure.</p>\n", "date_published": "2022-07-07T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/church-government-and-the-corporation/", "url": "https://kiri-vadivelu.ca/blog/church-government-and-the-corporation/", "title": "Church, Government and the Corporation", "content_html": "<p>There is great relationship between churches, corporations and governments of all types. Under all conditions, they not go against each other. Either they stand together or remain silent to support each other. All three are perfectly united evil friends who make sure masses are controlled in a way to protect the interest of the ruling class.</p>\n<img alt=\"Church, government and the corporations\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/42YV3vGqhq-300.jpeg\" width=\"600\" height=\"404\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/42YV3vGqhq-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/42YV3vGqhq-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>A food for thought. Have you ever wondered why churches care about abortions but not death of workers on the job? I have never seen a church protester holding a sign saying &quot;Kill a Worker, Go to Jail&quot; even though that happens every year in Canada.</p>\n<p>Churches in capitalist society exist to reinforce the believe that the nastiest of men for the nastiest of motives will somehow work for the benefit of all.</p>\n", "date_published": "2022-07-11T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/poverty-crime-and-the-insanity/", "url": "https://kiri-vadivelu.ca/blog/poverty-crime-and-the-insanity/", "title": "Poverty, Crime and the Insanity", "content_html": "<p>We all know that doing the same thing over and over will not lead to different outcome in life but when it come to politics, we do just that. We keep electing the same political parties to maintain the status quo and then get disappointed of our actions. Our education and healthcare, the most vital services cannot be improved when de-funded; however, we expect to improve nonetheless.</p>\n<img alt=\"Eat broccoli; not candies\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/mVnBwHQ8Hb-300.jpeg\" width=\"600\" height=\"453\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/mVnBwHQ8Hb-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/mVnBwHQ8Hb-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Meanwhile, inequality is directly linked to crime rates but we allow politicians to provide more funding for police to reduce crimes year after year. Well, that is insane. Our logic is reversed, we must over fund healthcare and education in order to improve while de-fund the police to reduce inequality. Of course, candies are easier sell than broccoli. After all, social awareness is the key to change the status quo.</p>\n", "date_published": "2022-07-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/either-stand-for-justice-or-support-injustice/", "url": "https://kiri-vadivelu.ca/blog/either-stand-for-justice-or-support-injustice/", "title": "Either Stand for Justice or Support Injustice", "content_html": "<p>We must be brave and bold to demand justice. Corporate puppets always find a way to liberalize justice movements, notably Black Lives Matter. Instead of calling out the bread crumbs of slavery, traitors of working class bullied the working class movement. Police are tools of the ruling class to maintain the status quo for the owner class. Regardless of the environment, if diversity, equity and inclusion efforts are separate from the pursuit of justice - do not join.</p>\n<img alt=\"Justice must be everywhere or no it is no where\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/f4GEovsdmC-300.jpeg\" width=\"300\" height=\"299\" />\n", "date_published": "2022-07-14T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/double-genocide-of-ceylon-tamils/", "url": "https://kiri-vadivelu.ca/blog/double-genocide-of-ceylon-tamils/", "title": "Double Genocide of Ceylon Tamils", "content_html": "<p>A misconception as common as it is incorrect, is that the weeklong violence of Black July was retaliation for the LTTE’s killing of 13 soldiers. In fact, what took place was not a spontaneous outburst of mob violence; rather, it was a systematic and intentional GoSL-sponsored genocide.</p>\n<img alt=\"Black July Tamil Massacre in 1983\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/0gKcFykIb_-300.jpeg\" width=\"300\" height=\"412\" />\n<p>I wish more people would ask why I became refugee of Canada. But, those did ask, really inspired me to put together a <a href=\"https://github.com/kiri-vadivelu/project-108/blob/main/src/tamil-genocide.pdf\">story</a>.</p>\n", "date_published": "2022-07-22T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/legal-prescription-to-eliminate-crimes/", "url": "https://kiri-vadivelu.ca/blog/legal-prescription-to-eliminate-crimes/", "title": "Legal Prescription to Eliminate Crimes", "content_html": "<p>Most people in Toronto are concerned about rising violent crimes in the city. Unfortunately, crime is not the sole responsibility of the police but collective responsibility of everyone in the city. As people of Scarborough, we can not only work toward eliminating crimes but make our communities safer for everyone. We just have to make the punishment fit the crime. The recipe is simple to execute but our status quo politicians will not do it. The ruling class is only interested in using crime as a weapon to further exploit working and the poor people of our city.</p>\n<img alt=\"Speed radar in the street\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/OjI6djyqvR-300.jpeg\" width=\"600\" height=\"567\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/OjI6djyqvR-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/OjI6djyqvR-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Many parts of the Europe successfully eliminated or reduced crimes using common sense and modern laws. Just one example of how to modernize our law is to make speeding fines according to level of income.</p>\n<p>Currently, whether one earns minimum wage or 3 million salary is paying the same penalty for the same crime. However, the one earning 3 million less likely to change the behavior because the penalty have no effect financially. It is not a final solution but should be beginning of great discussion, policy and research.</p>\n<p>Using existing policing infrastructures, the one simple policy would make our city really crime free and save lives on the streets. Yes, we can change our city for the better without exploiting working people. The change begins at the ballet box, let us vote to change the status quo.</p>\n<p><a href=\"https://www.facebook.com/john.clarke.771282\">Credits: John Clarke</a></p>\n", "date_published": "2022-07-25T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/financial-facts-on-canadian-prisons/", "url": "https://kiri-vadivelu.ca/blog/financial-facts-on-canadian-prisons/", "title": "Financial Facts on Canadian Prisons", "content_html": "<p>Total (federal, provincial and municipal) public spending on criminal justice in Canada per year is about $20 billion. (The Parliamentary Budget Officer did a careful breakdown in 2011-12). About 70% of this spending is provincial/municipal. The total amounts to about $550 in taxes per person in Canada per year. An excerpt from John Howard Society.</p>\n<img alt=\"Canadian prisoners inside the jail\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/6JXSny4Adw-300.jpeg\" width=\"600\" height=\"390\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/6JXSny4Adw-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/6JXSny4Adw-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Now let’s translate that into costs per prisoner. According to federal data the average annual cost per prisoner in federal prisons is about $115,000. Higher security levels are more expensive. Costs for women prisoners are much higher.</p>\n<p>$115,000 is nearly triple the yearly tuition cost at Harvard (about $45,000 US per year in 2015). According to the Parliamentary Budget Officer, in the ten years after 2000 annual public spending per capita on criminal justice went up by 23% while crime rates went down by 25%. <a href=\"https://johnhoward.ca/blog/financial-facts-canadian-prisons/\">Read more</a>.</p>\n<p>The bible approach to social problem is not only expensive for Canadians but inhuman. Instead, adequately funding social programs, keeping families together and raising children outside of poverty landscape reduce crimes.</p>\n", "date_published": "2022-08-09T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/war-statistics-from-1945-to-2001/", "url": "https://kiri-vadivelu.ca/blog/war-statistics-from-1945-to-2001/", "title": "War Statistics from 1945 to 2001", "content_html": "<p>Wars launched between 1945 - 2001, US 81% other countries 19%. Stats do not lie. Imperial wars from Iraq to Ukraine is a disaster for humanity. Dismantling United States military complex is the only way to feed the poor and bring world peace. Sadly, that is not even possible anymore.</p>\n<img alt=\"War statistics from 1945 to 2001\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/MnYUbLKeJo-300.jpeg\" width=\"600\" height=\"743\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/MnYUbLKeJo-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/MnYUbLKeJo-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2022-08-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/corporate-media-and-the-manipulation/", "url": "https://kiri-vadivelu.ca/blog/corporate-media-and-the-manipulation/", "title": "Corporate Media and the Manipulation", "content_html": "<p>Corporate media have mastered the art of manipulation to uphold injustice and status quo throughout the century. Today, one cannot deny the fact that not reading news makes us uninformed while reading news keeps us misinformed. Where do we go from here?</p>\n<img alt=\"Corporate media and the manipulation\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/nhOLGP0vMG-300.jpeg\" width=\"600\" height=\"547\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/nhOLGP0vMG-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/nhOLGP0vMG-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>On the left is The Economist after Bush invaded Iraq. On the right is The Economist after Putin invaded Ukraine. Spot the difference. May be that is why corporate America do not want Americans to learn colonial history.</p>\n", "date_published": "2022-08-14T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/covid-death-profit-using-science/", "url": "https://kiri-vadivelu.ca/blog/covid-death-profit-using-science/", "title": "COVID Death Profit Using Science", "content_html": "<p>As the wave of COVID struck, the most poorest parts of the earth experienced the highest deaths. While the loss of lives were unbearable, most ugliest things were COVID profiteers. Some millionaires embarrassingly returned the COVID benefits in the developed countries while big corporations tweaked the numbers to make sure the extreme covid profits does not create unusual attention.</p>\n<img alt=\"Vaccine Profit Graph\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/V9yGqbyz7Y-300.jpeg\" width=\"600\" height=\"379\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/V9yGqbyz7Y-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/V9yGqbyz7Y-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The global pandemic comes from capitalism, from its need to exploit nature for profit. It has nothing to do with ethnic origins. Challenge attempts to blame, harass, or cause violence against our Asian community. Confront hatred and all forms of discrimination. Anti-pandemic measures, including mandatory vaccination, are urgently needed. Follow the advice of medical professionals about wearing masks, social distancing, and hand hygiene.</p>\n<p>We need to insist that all workers, especially those in front-line health care, are provided with Personal Protective Equipment (PPE). Ensure that private profit is never put ahead of health and safety concerns. Nationalize private for- profit Long Term Care companies.</p>\n<p>The big players in the market controlled who receive vaccines based on the economic interest as opposed to saving lives. Thereby, capitalism proven itself as a death cult that needs to be dismantled to save humanity.</p>\n", "date_published": "2022-08-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/no-tech-for-apartheid-google-employees/", "url": "https://kiri-vadivelu.ca/blog/no-tech-for-apartheid-google-employees/", "title": "No Tech for Apartheid, Google Employees", "content_html": "<p>Google Workers Push for Cancellation of Secretive $1.2B Project with Israel - Sep 1, 2022 - A national day of action is planned next Thursday as protests grow against Google's secretive $1.2 billion program known as Project #Nimbus, which will provide advanced #artificialintelligence tools to the Israeli government and military.</p>\n<img alt=\"No Tech for apartheid Google employees\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Kb623m5KaE-300.jpeg\" width=\"300\" height=\"168\" />\n<p>We speak with two of the leaders of the protest: Ariel Koren, a former Google employee who says she was pushed out for her activism, as well as Gabriel Schubiner, who currently works at #Google and is an #Alphabet Workers Union organizer. ​​&quot;#Cloudtechnology is extremely powerful, and providing that power to a violent military and to an #apartheid government is not a neutral act,&quot; says Schubiner on Project Nimbus. The pair also detail how workers are rising up against what Koren says is Google's &quot;culture of retaliation.&quot;</p>\n<p><a href=\"https://www.youtube.com/watch?v=gPW4y9Bw988\">Video</a></p>\n", "date_published": "2022-08-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/labour-history-more-important-than-nutrition/", "url": "https://kiri-vadivelu.ca/blog/labour-history-more-important-than-nutrition/", "title": "Labour History, more Important than Nutrition", "content_html": "<p>Most of us are graduating from college and universities with no knowledge of surplus value of labour. Read that again, let that sink in. We must not stop learning even after school but that exactly what happens when some enter for profit school system. Schools controlled by the capitalist class replaced history, music and arts with fake career courses that ensure students cannot think outside the scope of profit.</p>\n<img alt=\"Labour history must be taught in schools\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/MyoobQeo3Q-300.jpeg\" width=\"600\" height=\"509\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/MyoobQeo3Q-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/MyoobQeo3Q-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Instead of teaching, students are fed political propaganda to become slaves of the system. Why would anyone go to school to become ignorant?</p>\n", "date_published": "2022-08-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/trails-of-nuclear-propaganda/", "url": "https://kiri-vadivelu.ca/blog/trails-of-nuclear-propaganda/", "title": "Trails of Nuclear propaganda", "content_html": "<p>Trails of nuclear propaganda from Iraq to Ukraine. When we come to realize that saviours of democracy are the destroyers of peace, our heartaches. We are not standing on a level ground to be able to see everything objectively. Therefore, it is vital for us to question everything. The corporate America have no interest in preserving human rights but profit only.</p>\n<img alt=\"Trails of nuclear propaganda from Iraq to Ukraine\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/g1RKtD_I4M-300.jpeg\" width=\"600\" height=\"750\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/g1RKtD_I4M-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/g1RKtD_I4M-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n", "date_published": "2022-09-11T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/why-democracy-is-failing-in-the-west/", "url": "https://kiri-vadivelu.ca/blog/why-democracy-is-failing-in-the-west/", "title": "Why Democracy is Failing in the West?", "content_html": "<p>People agree that democracy is failing is the west without any reservations. But, the reasoning of why decimate the debate even before the start. If one was to ask, do you know your city councillor in your ward or member of parliament? Most voters would respond yes but in reality, voters barely know the candidate name.</p>\n<img alt=\"Toronto City Council\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/cz5GtJreZi-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>It is not the fault of the voters but the status quo system that elegantly tricks the masses through selective bias. Because, politics is a manipulation game, status quo candidates only reveal what they want voters to know in order to get elected; not to serve the needs of the people. Media is just another corporations seek to preserve the status quo that continue to exploit people.</p>\n<p>Let us review some Toronto city council candidates who are ignored the mainstream media to preserve the status quo. These are candidates from grass-root movements across Toronto that barely known to the public.</p>\n<p>These candidates are not endorsed or backed by any corporations except people's movement such as Municipal Socialist Alliance (MSA). These candidates are visually hidden from public in order to support the status quo candidates.</p>\n<h2>Danny Drew, Mayor of Guelph</h2>\n<p>Danny Drew is a non-binary activist running to be mayor of Guelph. Born and raised in Oshawa, they moved to attend the University of Guelph in 2009, graduating with a bachelor’s degree in mechanical engineering. Danny worked in a wide range of jobs, always encouraging co-workers to exercise their rights and push for unionization. Currently seeking to win rights for thousands of workers via reclassification, they’ve supported many striking workers on picket lines.</p>\n<p>Danny is a steadfast ally of ongoing social justice movements – such as Indigenous Land Back and Black Lives Matter – actively resisting the rising tide of fascism.Their main focus has always been poverty relief; offering labour, organizing capabilities, and vast quantities of recovered supplies for those in need. At the onset of the COVID pandemic Danny co-developed a renter’s union as well as helped to operate a Food Not Bombs project.</p>\n<p>In the municipal arena, Danny pledges to fight tooth-and-nail for every possible concession from Capital and its state. That includes a high-powered harm reduction strategy involving: reformed social housing systems and relations, expanded and improved public transit, increased funding for mental health and drug user support programs, worker co-op and community land trust formation and expansion, and a drastically altered and reduced police force.</p>\n<p>Danny, as part of the Municipal Socialist Alliance, commits to expose the propaganda that keeps the bourgeoisie in power and the majority oppressed. In other words, a campaign for a Workers’ Government to increase class consciousness, and spur unionization, mutual aid, and local self-organization to enable working people to improve their lives.</p>\n<h2>Sarah Szymanski, Mississauga Ward 3</h2>\n<p>Sarah Szymanski is a student and worker running in Mississauga Ward 3. She is a proud member of UNIFOR Local 1285 and CUPE Local 3906. Sarah works as a part-time autoworker and as a teacher's assistant, holding the position of Recording Secretary since January 2022 in the CUPE Local. Sarah has a B.A. in Global Studies and Sociology from Wilfrid Laurier University, and a Master's of Sociology from McMaster University. She is passionate about social research, particularly in the field of gender, sexuality and work, and is devoted to the labour movement and workers’ rights.</p>\n<p>She has been involved in Toronto's Labour May Day Committee for the past two years, and was co-chair at its May 1, 2022 rally. Sarah Szymanski demonstrated her commitment to working class solidarity at picket lines and rallies, such as in support of locked-out workers at the Molson Brewery (CUBGW Local 325) and in aid of the people of Palestine and Cuba. Sarah will be a powerful voice for women, workers and socialist policies on Mississauga city council.</p>\n<h2>Mark Freeland, Mississauga Ward 7</h2>\n<p>Mark Freeland is a unionized construction worker, running for city council in Ward 7 Mississauga. As a worker, Mark recognizes the need for solidarity — twice Mark helped unionize his workplace, including IATSE local 58 and LIUNA 183. He strives to end municipal politics being dominated by careerist politicians who shove money into developers’ pockets while social justice issues are ignored. Workers need a real voice in municipal politics.</p>\n<p>To know why a Workers’ Agenda at City Hall is needed just look at Patrick Brown, Dipika Damerla and Doug Ford. Mark Freeland says that the fight for free mass transit, accessible and supportive housing for all who need it, to preserve crucial farmland, to end racist policing, and to tax giant corporations and the rich requires a mass social movement.</p>\n<h2>Miguel Avila, Toronto Centre Ward 13</h2>\n<p>Miguel Avila is an Indigenous man who lives in Toronto Centre Ward 13 -- an activist advocating for his community at City Hall and on the streets since 2010. Miguel stands for social and environmental justice, with an emphasis on housing, food security, police accountability and animal rights issues. He ran in 2014 when Toronto had 44 Council seats and obtained close to 800 votes. He has three children: Michelle, Meliss and Michael. Currently, there is no Indigenous representation on council. Miguel Avila will be a strong voice for diversity and for fundamental change on city council.</p>\n<h2>Adam Golding, Toronto Ward 11</h2>\n<p>Adam Golding was born in Toronto, raised in Barrie, Ontario and has lived in University-Rosedale for 20 years where he is currently the MSA candidate in Ward 11. Adam teaches piano from his home in Kensington Market -- you may have seen the posters for &quot;Anarchist Piano Lessons&quot;. At U of Toronto, he studied Philosophy, Mathematics, Cognitive Science, Artificial Intelligence, Linguistics, Psychology and Computer Science, and got heavily involved in student politics.</p>\n<p>Adam focused on municipal politics when Mayor John Tory sued Khaleel Seivwright for erecting tiny shelters to save lives amid a state of emergency that Tory himself declared. He witnessed mass evictions and police violence at encampments last summer, where he was physically harmed and arrested along with dozens of others. That’s when TorCH: The Toronto Coalition for Housing, was formed. Following these events, Adam Golding worked on voter ID and fundraising for NDP campaigns, and joined the Socialist Alliance launched by leftists who are fed up with the status-quo AND fed up with the status-quo opposition to the status-quo.</p>\n<h2>Kiri Vadivelu, Scarborough Centre Ward 21</h2>\n<p>Kiri Vadivelu is a social justice activist running with the MSA for the seat in Scarborough Centre Ward 21. Kiri, who immigrated from Sri Lanka as a child, successfully resisted illegal eviction of his family at the Ontario Landlord and Tenant Board during the 2020 emergency lock down. He passionately strives to make housing a human right in Ontario.</p>\n<p>A founding member of the Scarborough Tenants’ Union, Kiri is a leading voice of Toronto ACORN and a committed member of Justice for Workers. He was a shop steward of the United Steelworkers Union where he fought for better working conditions, and was recipient of a 2019 leadership award from USW headquarters in Pittsburgh, USA. Kiri Vadivelu acquired a Bachelors of Arts (BA) in Criminology, Justice and Policy Studies at the University of Ontario in 2010.</p>\n<h2>Wali Abro, Toronto Danforth Ward 14</h2>\n<p>Wali became a Canadian citizen last winter, having immigrated from Pakistan nearly 10 years ago. He subscribed to the clichéd image of Canada: that it was fair, compassionate, and built in partnership with the Indigenous peoples. That image was quickly shattered.</p>\n<p>Now, he's fighting for the Canada that was promised. Wali has long been an advocate for electoral reform, holistic social supports, and de-colonization. He is an active community volunteer, keeps close to the grassroots, and is a passionate activist for Indigenous rights from Turtle Island to Palestine.</p>\n<p>He is taking his fight forward by running, as part of the Municipal Socialist Alliance team, to be Councillor for Ward 14 - Toronto-Danforth on a platform that features immediate housing for people experiencing homelessness or precarious housing; improved public safety by significantly de-funding the police and investing in community well-being; and rebuilding Toronto's infrastructure with climate change and population growth in mind.</p>\n<h2>Corey David, Scarborough Southwest Ward 20</h2>\n<p>Corey David, a resident of Scarborough Southwest for decades, is the MSA candidate in Ward 20. Corey was the Socialist Action candidate in the January 2021 Scarborough Agincourt by-election. He championed social housing, quality public long-term care and health care, workers’ power and police abolition. Corey has worked as a machinist for 7 years.</p>\n<p>Before that he supported individuals with developmental disabilities working as front-line staff at Community Living Toronto and the Toronto District School Board. In 2020 Corey David campaigned to stop the for-profit housing development at the Quarry Lands, which destroyed the natural habitat and park space — another reason radical change is needed at City Hall.</p>\n<h2>Sandra Griffith-Bonaparte, Ottawa school Trustee</h2>\n<p>Sandra Griffith-Bonaparte emigrated in 1988 to Canada from Grenada in the south-east Caribbean. For 16 years she has been President of Local 70607 of the Union of National Defense Employees, a component of the Public Service Alliance of Canada. Sandra, a member of Socialist Action, was the Workers’ Action Movement candidate for Second Vice-President of the Canadian Labour Congress in June 2021. Based on a life-time commitment to high quality public education, with special attention to the needs of racialized students, teachers and staff, Sandra is now running as an MSA candidate for school trustee in Ottawa.</p>\n<h2>Daniel Tarade, Parkdale-High Park Ward 7</h2>\n<p>Daniel Tarade immigrated to Canada as a child refugee from Bosnia and Herzegovina. Inspired by the story of the discovery of insulin, and prompted by his brother’s experience with type 1 diabetes, he committed himself to changing the world for the better as a scientist. Daniel obtained his PhD from the University of Toronto in the Department of Laboratory Medicine &amp; Pathobiology in 2021. When he saw that science alone cannot resolve the systemic issues plaguing society, Daniel set out to organize in the streets and in the workplace against exploitation and oppression in all forms.</p>\n<p>Daniel is a proud union steward in CUPE Local 3902 and ran for Secretary-Treasurer at the 2021 Ontario Federation of Labour (OFL) convention as a candidate of the Workers' Action Movement. Today, Daniel lectures at both the University of Toronto and Toronto Metropolitan University in the Life Sciences, is a member of Socialist Action, and is running for Toronto District School Board (TDSB) trustee in Parkdale-High Park (Ward 7).</p>\n", "date_published": "2022-09-15T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/have-honest-conversations-with-children/", "url": "https://kiri-vadivelu.ca/blog/have-honest-conversations-with-children/", "title": "Have Honest Conversations with Children", "content_html": "<p>If wars are so bad, why does it still exist? Adults are smart enough to sort out the differences unlike kids in the playground; yet, commit the most atrocities crimes against innocent children, women and the elderly. Honest answer would not only help the child but also the parent to become better community members.</p>\n<img alt=\"Why do wars exist in society?\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Hlvt5tERkA-300.jpeg\" width=\"600\" height=\"531\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Hlvt5tERkA-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Hlvt5tERkA-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>An interesting answer that crossed my way. Well, you see Timmy, we are ruled by an elite class of psychopaths, who own the bank that control the governments and media. They fund both sides of war for profit and they manufacture the consent of the public through propaganda of the mainstream media.</p>\n", "date_published": "2022-09-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/canada-must-rise-to-the-challenge/", "url": "https://kiri-vadivelu.ca/blog/canada-must-rise-to-the-challenge/", "title": "Canada Must Rise to the Challenge", "content_html": "<p>Canada is at a crossroads. We are facing multiple pressing challenges that need immediate action: The ongoing impact of Covid-19, inflation gnawing at stagnant paycheques, a health care system squeezed to the limit, the climate crisis, and the ongoing need to dismantle colonialism and systemic racism. An excerpt from Centre for Policy Alternatives.</p>\n<img alt=\"Canada must rise to the challenge\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/frcvMCFVmU-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/frcvMCFVmU-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/frcvMCFVmU-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The Alternative Federal Budget (AFB) is a bold approach to addressing the concerns that directly affect Canadians. The AFB advances solutions and places the responsibility for change squarely on the federal government, working with the provinces and territories, to rise to the challenge—because public leadership is needed now more than ever.</p>\n<p>This year’s AFB tackles affordability, inflation, climate change, inequality, and health care:</p>\n<p>Affordability: The AFB provides non-market and co-op housing, funding support for child care, income support to end food insecurity, equitable access to the labour market, poverty reduction and income security, as well as affordable and accessible post-secondary education. The AFB also takes action to eliminate homelessness;</p>\n<p>Inflation: The AFB tackles inflation through fiscal levers such as using mortgage-regulation tools to moderate house prices by targeting investors as well as providing high-quality public services to reduce what Canadians pay for things like child care, dental care, and prescription drugs;</p>\n<p>Climate change: The AFB slaps stricter national standards on large carbon emitters—including a green strings strategy for federal funding— to make way for a fossil-fuel-free economy by 2040;.</p>\n<p>Inequality: The AFB takes swift measures to cut poverty in half by 2026, to invest in First Nations infrastructure, First Nations climate leadership, direct support for truth, reconciliation, and healing, food security and sovereignty as well as implementing a federal Anti-Racism Act. The AFB also increases taxes on the wealthiest and on corporations reaping excess profits during the pandemic; and</p>\n<p>The care economy: The AFB tackles Canada’s health care crisis by adequately funding our universal public health care system and long-term care—saying no to privatization—as well as implementing new national care programs dental care, mental health care, substance use health, and national pharmacare. The AFB also provides a comprehensive plan to ensure health equity for all.</p>\n<p>Because we are facing a number of pressing issues in Canada, the AFB goes beyond these key measures and invests in arts and culture, agriculture, inclusive infrastructure, and a review of the immigration program. <a href=\"https://policyalternatives.ca/sites/default/files/uploads/publications/National%20Office/2022/09/AFB%202023%20-%20Rising%20to%20the%20Challenge%20.pdf\">PDF</a></p>\n", "date_published": "2022-09-29T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/the-purpose-of-linkedin-today/", "url": "https://kiri-vadivelu.ca/blog/the-purpose-of-linkedin-today/", "title": "The Purpose of LinkedIn Today", "content_html": "<p>This platform is essentially a capitalist culture app, a market for the trade of organizational snake oils, disguised as &quot;networking.&quot; The fact that we're able to create meaningful bonds and even organize on here is testament to how resilient we can collectively be, even amidst this sea of classist exploitation. And that fills me with immense hope. Justice belongs in ALL spaces including LinkedIn regardless of what the status quo enforcers say.</p>\n<img alt=\"LinkedIn networking application\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/yLDM2fdJ9L-300.jpeg\" width=\"600\" height=\"338\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/yLDM2fdJ9L-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/yLDM2fdJ9L-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Excerpt from Farzin Farzad</p>\n", "date_published": "2022-10-01T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/barrier-to-democracy-status-quo-benefiters/", "url": "https://kiri-vadivelu.ca/blog/barrier-to-democracy-status-quo-benefiters/", "title": "Barrier to Democracy, Status Quo Benefiters", "content_html": "<p>The housing is a crisis situation in Toronto. Average wait time to receive a rent geared to income housing in the big city is 10 years. Sadly, poverty does not wait that long but the status quo does not care. If one was to ask, why does things get worse year after year, the answer is simple. Those who represent the people have no interest in addressing the root cause of the problem such as poverty.</p>\n<img alt=\"Example of barrier to democracy, Toronto shelter\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/T6SVO0sNqq-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/T6SVO0sNqq-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/T6SVO0sNqq-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Instead of solving inequities, status quo politicians only interested in accumulating personal wealth and transfer public to private corporations; where they end up retiring as board members with public pension.</p>\n<p>At the same time, status quo politicians ensure the system that make wealth for the few does not change. Why would they? Often, the working poor pays the price regardless of political leaning.</p>\n<p>The status quo administrations further exploits the poor through not removing real barriers to democracy. When those who care to change the status quo become involved in politics, the status quo ensure barriers exist prevent political enlightenment.</p>\n<p>As a candidate for Scarborough Centre, Ward 21, my campaign primarily focuses on building housing for all and solving inequities. When I attended a city run shelter at 1229 Ellesmere Road in Scarborough to speak to residents, I was denied entry by the city staff and escorted out of the building on October 9, 2022 during canvassing ours.</p>\n<p>The justification was that I did not book an appointment. After realizing, Birkdale Shelter made terrible mistake by denying me access, the following day response, apparently city did not deny access but I did not make an appointment to visit.</p>\n<p>Truth is that our city is being run by psychopaths who have no respect for the lives of the working poor. If making appointment was necessary during canvassing hours, that places enormous burden on the candidate; thus, status quo does not change.</p>\n<p>City does not want poor people to vote, the actions of the city staff speak louder. The demand to make an appointment confirms the psychopathic nature of status quo administrations.</p>\n<p>I have been to many private buildings and high secure residences to speak to residents, not a single one denied entry nor demanded I make an appointment but the city did. What a shame to our democracy.</p>\n<p>Status quo does not care and also do not want anyone else to care about poverty. Therefore, democracy is an illusion in Toronto. City hall is just an elected tyranny exist to legalize tax dollar extortion without public inquiry.</p>\n<p>If one was to care about fair elections in the city, public outrage is guaranteed. When there are obvious barriers to democracy, there is no democracy.</p>\n", "date_published": "2022-10-10T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/what-drives-me-to-fight-for-change/", "url": "https://kiri-vadivelu.ca/blog/what-drives-me-to-fight-for-change/", "title": "What Drives Me to Fight for Change?", "content_html": "<p>Most often, we strive to fight against the system that degrades humanity but at some point, we lose energy and motivation to fight. Thats the way our status quo system is designed so no change can happen from the grassroots. Working class people have no choice but to fight till the end or surrender to the status quo.</p>\n<img alt=\"King Pandara vanniyan 1700\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/yMHv8wyGLu-300.jpeg\" width=\"300\" height=\"403\" />\n<p>Our political administration is a corrupted tyranny leadership that put profit before people. Ever wonder why injured people have to fight for benefits that they already insured through employment? It is a perfect example of deny by design system. Or the 10 year wait for affordable housing in the city.</p>\n<p>Today, we have no democracy but suffering from housing to education, from employment to economical equality. Those psychopaths rather have our future doctors, lawyers and teachers grow in poverty so few can fly in private jets and pursue inhuman lifestyle.</p>\n<p>Those at the top of the food chain have vested interest in keeping the system to benefit the few. Therefore, any input at any level goes to deaf ears. Going to court in a capitalist society is a gamble since the case can be dropped at any point, even justice can be bought in the end.</p>\n<p>My hero, the last standing King Pandara Vanniyan never surrendered but died in the battlefield against European colonizers in 1700. He knew what was coming 300 years ago, the oppression and exploitation in coat, suit and tie. As a child, playing under his statue in my second home town Katchilaimadu must have embraced something in me.</p>\n", "date_published": "2022-10-12T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/in-politics-elect-policy-not-personality/", "url": "https://kiri-vadivelu.ca/blog/in-politics-elect-policy-not-personality/", "title": "In Politics, Elect Policy; Not Personality", "content_html": "<p>Politics is often thought of as a complicated subject but its not. If we apply common sense instead of feelings, it would be crystal clear and simple to understand. Politics is a manipulative blame game of power and greed without responsibility in western society.</p>\n<img alt=\"Socialism vs capitalism in western society\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/zdC4Tp7qH2-300.jpeg\" width=\"600\" height=\"600\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/zdC4Tp7qH2-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/zdC4Tp7qH2-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Regardless of media portrayal, focusing on the policy is more useful than personality when it come to politics. Personality is the trick and the policy is the treat. Using the corporate media, ruling powers keep the public confused or misinformed.</p>\n<p>By default, all governments serve the interest of corporations; not people. Since corporations cannot vote; therefore, people vote is required to rule. What people actually should do is to demand policy while campaigning instead of being carried away with single issue slogan driven sentiments. Asking for policy questions would force candidates to be accountable and reveal themselves to the public.</p>\n<p>In practice, majority of Liberal and Conservative status quo politicians prey on the innocence of general public to win elections. Political candidates tries to appeal to everyone by campaigning using deceptive buzz words and once elected write policy to benefit few. It’s a vicious cycle of politics.</p>\n<p>Keeping people divided is a strategy that worked well for centuries. Politicians know that if people start to ask questions about real solutions to social problems and rising inequality, the deceptive buzz word politics is over. When public come to understand the inner nature of manufactured fear driven politics, ruthless rulers would be terrified of the public and honesty would become the baseline.</p>\n<p>Everyone wants democracy but no one can have one, it is system perfectly designed to create conflict so status quo remains unchanged. Capitalism competes and do not corporate; capitalism breeds culture of violence; not peace and order. Putting people before profit is no go zone for corporate government of all kinds.</p>\n<p>Therefore, electing policy instead of personality may be the only way to reduce economical inequality in the violent capitalist society.</p>\n", "date_published": "2022-10-18T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/corruption-and-destruction-of-ndp-trust/", "url": "https://kiri-vadivelu.ca/blog/corruption-and-destruction-of-ndp-trust/", "title": "Corruption and Destruction of NDP Trust", "content_html": "<p>For class conscious voters, New Democratic Party (NDP) aka Canadian labour party was the only source of hope for democracy. However, the hope was shattered through executive committee of the British Columbia (BC) NDP party decision to disqualify a candidate recommended by its members. The radical decision of NDP executive reflected the true disconnection between the interest of working people and the party leadership ambitions.</p>\n<img alt=\"BC NDP leader, choosen by the people\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/Ev8m762r5Y-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/Ev8m762r5Y-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/Ev8m762r5Y-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>The B.C. NDP’s provincial executive council voted to disqualify Anjali Appadurai from the party’s leadership race last night, against strong objections from party members and elected NDP representatives across the province and country who called on the party to let her run.</p>\n<p>The party’s decision paves the way for former attorney general and minister responsible for housing David Eby to assume the party leadership — and premiership — unopposed.</p>\n<p>The B.C. NDP announced the decision late last night, after refusing to allow Appadurai to state her case before the executive council.</p>\n<p>The ruling followed a recommendation, leaked to the press on Tuesday night, from the chief electoral officer (CEO) tasked with running the B.C. NDP leadership contest and investigating allegations of wrongdoing by Appadurai’s campaign.</p>\n<p>Responding to the CEO’s leaked report, Appadurai said that the CEO, Elizabeth Cull, changed the rules of the leadership race mid-campaign and applied them retroactively. Cull applied the new rules to a virtual event that predated the official launch of Appadurai’s campaign, Appadurai said.</p>\n<p>Report by Alex Cosh for The Maple. <a href=\"https://www.readthemaple.com/b-c-ndp-disqualifies-anjali-appadurai-despite-against-members-objections/?ref=The+Maple-newsletter\">Full report</a></p>\n", "date_published": "2022-10-20T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/victory-in-difference-not-numbers/", "url": "https://kiri-vadivelu.ca/blog/victory-in-difference-not-numbers/", "title": "Victory in Difference; Not Numbers", "content_html": "<p>Thank you to my people of Scarborough. Our victory is work in progress. I am proud of our collective achievement against the status quo and so you should be too.Thank you Scarborough Tenants Union, Acorn Canada, This Time in History, Municipal Socialist Alliance, Socialist Action, Stop the Split and to all those endorsed, volunteered and stood in solidarity. We moved the immovable, please see the full statement.</p>\n<img alt=\"Toronto City Hall\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/ZjWaLEPRO5-300.jpeg\" width=\"600\" height=\"337\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/ZjWaLEPRO5-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/ZjWaLEPRO5-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>My sadness is not in the outcome of the election but rather in the amount of eligible voters, nearly 70 percent who did not add their voice. It speaks to the condition of our society that have brutally let down by the ruling class; to benefit the few. However, I am more than optimistic with 10 percent of Scarborough who already placed trust in me by choosing socialism over capitalism and fascism. <a href=\"https://github.com/kiri-vadivelu/project-108/blob/main/src/statement-kiri-vadivelu.pdf\">Full Statement</a></p>\n", "date_published": "2022-10-25T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/slaves-in-uniform-with-big-dreams/", "url": "https://kiri-vadivelu.ca/blog/slaves-in-uniform-with-big-dreams/", "title": "Slaves in Uniform with Big Dreams", "content_html": "<p>Big corporate criminals in coat, suit and tie behind the screens do more harm to workers than the COVID itself. Those parasites such as CEO John Campbell do not work or contribute to economy in any meaningful way but thrives by sucking the blood of employees. Even at the heights of pandemic killing workers, profit was the main priority for the secret scum family. Workers must stand up to the domestic terrorism or else our children would become homeless in the richest nations.</p>\n<img alt=\"Securitas Canada employees on minimum wage\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/CUq0NOdUdV-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/CUq0NOdUdV-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/CUq0NOdUdV-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>&quot;Security is an essential industry,&quot; states <a href=\"https://www.linkedin.com/in/john-h-campbell-cpp-mba-bb237b16/\">John Campbell</a>, President of <a href=\"https://www.securitas.ca/\">Securitas Canada</a>. &quot;What we're facing today, with the COVID-19 crisis, is clearly unprecedented. Securitas is committed to helping our clients, both current and new, maintain the safety of their people and properties.”</p>\n<p>Note that he made no mention of safety of employees. And, he had enough time to provide false information <a href=\"https://www.newswire.ca/news-releases/securitas-canada-ltd-is-seeking-thousands-of-security-guards-across-canada-during-covid-19-pandemic-804621096.html\">report</a>.</p>\n<p>The same CEO refused to respond to me at the same time when psychopathic manager <a href=\"https://www.linkedin.com/in/marc-eskander-90664412b/\">Marc Eskander</a> and slave supervisor <a href=\"https://www.linkedin.com/in/radko-radkov-a2a52242/\">Radko Radkov</a> were breaking <a href=\"https://www.ontario.ca/page/workplace-health-and-safety\">workplace safety</a> and <a href=\"https://www.ontario.ca/document/your-guide-employment-standards-act-0\">employment laws</a> in Ontario to terminate my employment; while threatening my <a href=\"https://usw.ca/\">United Steelworker</a> union of terminating contract should they intervene by tactically delaying contract renewals.</p>\n<p>Securitas Canada terminated my 10 years of services without any benefits in May 2020 and <a href=\"https://www.canada.ca/en/employment-social-development/programs/ei/ei-list/reports/fraud-serious.html#h2.4-h3.2\">fraudulently</a> falsified my record of employment stating that I quit. The stated reason “Quit” was false because I did not quit my job voluntarily. I was unable to continue working due to ongoing harassment during COVID and as a result of the injury occurred on Sunday, April 5, 2020.</p>\n<p>Securitas Canada forced me to take unemployment insurance from tax payer dollars instead of paying my benefits from their corporate account. Big corporations like Securitas Canada, operate in ways to make sure they do not get caught for any violations and transfer all liabilities to the government.</p>\n<p>Although it is a criminal offense to falsify record of employment in Canada, corporations do it anyways. 1. Employees are not diligent enough to figure out the complicated laws. 2. Corporations have lawyers ready to defend at all cost or wear out government through abusing judicial system. 3. The penalties for corporations breaking law is low and reward is high. These are just few reasons but surely you get the point by now.</p>\n", "date_published": "2022-10-26T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/treatment-of-migrant-workers-in-ontario/", "url": "https://kiri-vadivelu.ca/blog/treatment-of-migrant-workers-in-ontario/", "title": "Treatment of Migrant Workers in Ontario", "content_html": "<p>My employment experience exposes the systematic flaws that needed to make employees of my kind safer at work places. The Ontario Occupational Health and Safety body along with Labour Relations Board is inadequate to protect employees from workplace violence. The notion of expectation that Union is to protect employees from bullying, harassment and discrimination is only as good as any April fool pranks.</p>\n<img alt=\"Province of Ontario\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/YAIKtrhuI1-300.jpeg\" width=\"600\" height=\"491\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/YAIKtrhuI1-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/YAIKtrhuI1-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>I have been employed with <a href=\"https://www.securitas.ca/\">Securitas Canada</a> at 155 Consumer Road, North York since June 2010 as a full time Mobile Security officer in the Toronto East Mobile Services Branch. During the pandemic in April 2020, Securitas Canada terminated my 10 years of services without any benefits after filing health and safety complaint. On termination, company provided record of employment stating that I quit. The stated reason “Quit” was false because I did not quit my job voluntarily. I was unable to continue working due to ongoing harassment in the midst of COVID and as a result of the injury occurred on Sunday, April 5, 2020.</p>\n<p>Supervisor <a href=\"https://www.linkedin.com/in/radko-radkov-a2a52242/\">Radko Radkov</a> attended work site and caused the injury; which resulted in my psychological inability to continue working safely. Thus, I returned home immediately after reporting to Supervisor Lito Jacla. Mr.Radkov held the title of supervisor on the day of incident and still employed with the company. In prior to the incident, I filed a harassment complaint against Radkov that company and Union acknowledged; however, did not take appropriate measures to prevent retaliation. <a href=\"https://www.linkedin.com/in/marc-eskander-90664412b/\">Marc Eskander</a>, the branch manager was informed about the incident and took no action. Assistant to CEO <a href=\"https://www.linkedin.com/in/john-h-campbell-cpp-mba-bb237b16/\">John Campbell</a> acknowledged the complaint without intervention.</p>\n<p>Another harassment complaint was registered with Local 5296 of United Steelworkers Union <a href=\"https://usw.ca/\">USW</a>. Mr.Chow See Kwong investigated the Occupational health and safety <a href=\"https://www.ontario.ca/page/workplace-health-and-safety\">OHS</a> complaint, acknowledged the nature of harassment; however, was unable to provide any remedy or restore my employment. Subsequently, reprisal complaint was registered with Labour Relations Board <a href=\"http://www.olrb.gov.on.ca/\">OLRB</a> that delayed due to COVID; hearing was not scheduled till June 2021. Eventually, Labour Relations Board and the Union attended the hearing where the case was dismissed without resolution. An appeal was filed and again struck down by the same board member Derek L. Rogers <a href=\"https://www.linkedin.com/in/derek-rogers-26238511/?originalSubdomain=ca\">who</a> first dismissed the case.</p>\n<p>Mr.Rogers did not consider any facts I presented, exploited the lack of legal representation and refused to order reinstatement of my job or any assistance to recover from sustained injury. While sitting as a board member on public payroll to judge reprisal cases, Mr. Rogers operate a private <a href=\"https://dlrbitration.com/\">firm</a> that provide consultation services to employers to reduce liabilities from employee lawsuits. To characterize the work of Mr.Rogers as gross moral and ethical violation of public interest would be an understatement.</p>\n<p>Application to Occupational Health and Safety, Labour Relations Board, Human Rights Tribunal, material evidences and their decisions are available upon request.</p>\n<p>My employment experience exposes the systematic flaws that needed to make employees of my kind safer at work places. The Ontario Occupational Health and Safety body along with Labour Relations Board is inadequate to protect employees from workplace violence. The notion of expectation that Union is to protect employees from bullying, harassment and discrimination is only as good as any April fool pranks.</p>\n<p>Through my suffering, the wisdom guides me to believe that my race and political preferences may be the motivational factors for the lack of support made available to me when I needed the most. I do not have the moral strength to constructively review policy inadequacies. I was referred to Workplace Safety Insurance Board <a href=\"https://www.wsib.ca/en\">(WSIB)</a> where my request for help was dismissed without remedy and directed to seek social assistance. The word &quot;help&quot; only existence on their website and the mission statement do not make any sense. The province of Ontario under Premier Doug Ford <a href=\"https://www.ontario.ca/page/premier\">regime</a> returned nearly 1.5 Billion dollars back to employers that became <a href=\"https://toronto.citynews.ca/2022/02/16/ford-government-wsib-premium-payment-rebate-businesses/\">surplus</a> after denying basic services to insured workers.</p>\n<p>I began experiencing emotional outbursts due to systematic barriers in accessing the services in Ontario. Sadly, pre-existing barriers only compounded with COVID-19 pandemic. Furthermore, people of colour experience additional barriers in seeking and securing prosperous employment. Meanwhile, the psychological condition as result of the workplace injury further limits potential employment. Overall, my pandemic induced work experience exposed the eroded structure of public service in Ontario.</p>\n<p>As I bring out the truth of my experience, I am driven to change the status quo even at the expense of my future opportunities. Raising awareness of systematic racism, discrimination and barriers to accessing essential services in Ontario helps build network and provide assistance to those denied help. I believe that no employee who walk in my shoes with shattered dreams have to suffer in silence.</p>\n<p>A copy of this report was sent to Securitas Canada, Occupational Health and Safety, Labour Relations Board, Workplace Safety Insurance, Human Rights Tribunal and Ministry of Labour but no response received.</p>\n", "date_published": "2022-10-28T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/jews-who-leave-israel-for-good/", "url": "https://kiri-vadivelu.ca/blog/jews-who-leave-israel-for-good/", "title": "Jews Who Leave Israel for Good", "content_html": "<p>Every Jewish immigrant that enters Israel is unwittingly taking part in a continual referendum on its chances of survival. But many of those who enter Israel also choose to leave it. Nearly, half of those who emigrated in 2003 from the US went back, rare statistics not covered in the mainstream media.</p>\n<img alt=\"Father of Modern Zionism, Theodor Herzl\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/a3knExRT6j-300.jpeg\" width=\"300\" height=\"374\" />\n<p>Every Jewish immigrant that enters Israel is unwittingly taking part in a continual referendum on its chances of survival. But many of those who enter Israel also choose to leave it. Nearly, half of those who emigrated in 2003 from the US went back, rare statistics not covered in the mainstream media.</p>\n<p>For many of them, involvement in actively subjugating Palestinian refugees in the Occupied Territories and the pressure of living the Zionist ideology every day is just too much. Igor Dzhadan describes his situation simply. He emigrated to Israel in 1990 but returned home in 2001, blaming what he called the country’s “sectarian nature”.</p>\n<p>“I feel more comfortable in Russia. My life prospects wouldn’t be worse than in Israel. I didn’t like it. I’m used to operating in an open society where people don’t ask you to what community you belong.”</p>\n<p>Apartheid state spends billions on advertisements to attract tourism, investments and return of Jewish people into Israel while confiscating Palestine lands at gun point. Israel bank on the fact that when a lie is told repeatedly people will start to believe it as true. Sadly, that is not the case anymore and we do not live in 1930.</p>\n<p>The reasons for Jews leaving Israel is complex. However, most do not agree with the way Israel handling civil disputes and land grabs at gun point. The authoritarian mode of managing disputes have only intensified violence on both sides of Israel and Palestine with no room for justice.</p>\n<p>Those who enter Israel with abroad life experience not only disagree with the administration of Israel but leave Israel for the good. The inhuman characteristic of apartheid state that Jewish people do not want to be identified with. Unlike holocaust, acts of terrorism against Palestine women and children is not a pride worth sharing with everyone.</p>\n<p>For well informed Jewish people, living abroad is the only means to uphold morals, happiness and balanced view of universe in skewed political and economical conditions.</p>\n<p>Full report at https://www.aljazeera.com/news/2004/8/10/jews-who-leave-israel-for-good</p>\n", "date_published": "2022-10-29T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/jordan-peterson-a-snake-oil-expert/", "url": "https://kiri-vadivelu.ca/blog/jordan-peterson-a-snake-oil-expert/", "title": "Jordan Peterson, A Snake Oil Expert?", "content_html": "<p>During my early years, I was really interested in clinical psychology. I would often spend my evening watching his lectures and learning from his approach to investigating and solving complex social and psychological issues. After a while though, his approach to understanding social problems were narrow and limited - particularly his tendency to blame the victim and empathize with those in control was starting to be obnoxious.</p>\n<img alt=\"Jordan Peterson, sitting on chair, legs crossed, arms in front\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/l5cIUEncMv-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/l5cIUEncMv-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/l5cIUEncMv-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Consequently, I searched for alternative methods and solutions to examine problems of inequality, injustice and corruptions. Ironically, the primary reason for my interest in clinical psychology was to get into the mind of a bully. Although, I benefited from his intellectual capacity to articulate problems to atomic precision, his inability to relate to the powerless in society made me opt out of his lectures, eventually.</p>\n<p>In the outer scope, the western justice system is highly regarded because of its structure that defend the interest of victims even at the expense of offenders walking free. But, Jordan strike the core of justice through deception, where he portrays himself to be victim, then defend the interest of the offender through his explanations. His work reinforces the dangerous campaign to believe the offender; not the victim or powerless in society. Most scholars naively look over his controversies because no one expects someone in his caliber to be academically sneaky.</p>\n<p>Not surprising to see academics pursue thriving business models such as Mr. Peterson’s but extremely disgraceful to see well respected scholars act with malice for profit; rather than social goods. His audiences are young inexperienced men looking to find their masculinity in social democracy; clients are primarily corporations recruiting employees with borderline narcissistic personalities. By knowingly selling twisted narratives of scientific research with his own flavours, he joins the snake oil market.</p>\n<p>In my view, he went from Clinical Psychologist to Snake Oil Expert in a highly competitive fake guru market. Using his academic achievement and mainstream media, he jumped leap years ahead of many. Indeed, his ability to rationalize and extract fascist ideologies for the benefit of parasites is a masterpiece. Nevertheless, the long term walk on eggshell to sell more books, actually places his past academic achievement in jeopardy.</p>\n<p>Realistically, the academic suppression of working class needs have rewarded Mr. Peterson with wealth and fame. The joy ride is unlikely to provide any incentive for Jordan to change the course of his politics that demonize victims at the expense of self privilege and irrationality. Meanwhile, Jordan is at the retirement phase; thus, unlikely to have new awakening to unlearn the principles of bible that justify the residential school massacre.</p>\n<p>Although inequity is not a concern for Jordan, he does vibrate the frequency to support for some democracy in capitalism. Due to such lenience of democratism, he may not be swept off the feet by liberal breeze. Interestingly, he has not ruffled any big feathers in the conservative party; nonetheless, conservatives are not doing terrible enough to send an open invitation.</p>\n<p>In the past, Jordan has caused friction with left leaning personalities due to his right wing fused authoritarianism and intolerance toward gender libertinism. However, Mr. Peterson’s political alienation is not convincing enough to deviate from the interest of science and humanities. Then, why did JP cross the line? It remains a mystery, surely a trick or treat.</p>\n", "date_published": "2022-10-31T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/dealing-with-half-brained-freedom-fighter/", "url": "https://kiri-vadivelu.ca/blog/dealing-with-half-brained-freedom-fighter/", "title": "Dealing with Half Brained Freedom Fighter", "content_html": "<p>Most recently in Ontario, Trucker Convoy who stood up to defend the liberty of Canadians against vaccine mandates seem to be standing back when education workers' rights are infringed. John Clarke's experience with the ring wing fused social media commentator just exposes the eroded nature of our society. John says &quot;I never debate with right wing social media users but I did note with interest some of their responses to something I sent out suggesting that education workers in Ontario would be taking action on behalf of all wage earners and users of public services&quot;.</p>\n<img alt=\"Trucker convey on route to Ottawa\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/sntU02Y27a-300.jpeg\" width=\"600\" height=\"399\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/sntU02Y27a-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/sntU02Y27a-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Clarke's remarks:</p>\n<p>One particularly aggrieved beer hall patron thundered that my comment was an example of 'idiotic babbling' and it's certainly true that any attempt to convey notions of common interests and working class solidarity would seem meaningless to this chump. I could have responded with an explanation of how workers' struggles impact the general balance of forces between labour and capital and set out the need to act collectively in defence of public services that have been won through past struggles. However, there is no common language with people like my accuser and it would have been useless to try and communicate.</p>\n<p>Those who have been caught up in the present wave of reactionary rage express this ideology of self-interest to an extreme degree. To them, it seems self-evident that their right to remain unmasked completely outweighs the responsibility to help prevent the spread of a lethal virus. However, the distorted notion of individualism extends beyond the far right and effects the thinking and action of ordinary working class people.</p>\n<p>This society reinforces at every point the elevation of the individual and the corresponding underestimation of collective rights and common interests. The capitalist class do work together to some extent, especially when the seek to stifle working class resistance and intensify that rate of exploitation. However, their sense of class unity is tempered by the fact that they compete with each other. They are, as Marx put it, a 'band of warring brothers.’</p>\n<p>For the working class, however, things are altogether different. For our class, common interests and the need for united action are paramount. It is the stranglehold of an oppressive and exploitative system that prevents us from comprehending this as we should.</p>\n<p>Education workers in Ontario are, indeed, fighting for all of us and their struggle is our struggle. Let's offer every measure of support to them and, in doing so, clean off some of the 'muck of ages' and elevate the sense of common interest and united action that we so desperately need in these bitter times.</p>\n<p>In extension to Clarke's remarks, the right wing fused half brained freedom fighters are informed enough to not to upset the slave masters. Indeed, the actors of trucker convey is nothing more than a display of inflated ego in a privilege society with no respect for true civil liberty, freedom or justice.</p>\n<p>Ultimately, Where the woke freedom convey stand on the education workers' fight for liberty would reveal the amount of fascism, hate and bigotry contained in the movement. Only time will tell the remaining story.</p>\n<p>Credits: <a href=\"https://www.facebook.com/john.clarke.771282\">John Clarke</a></p>\n", "date_published": "2022-11-01T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/ontario-education-workers-must-struggle-to-win/", "url": "https://kiri-vadivelu.ca/blog/ontario-education-workers-must-struggle-to-win/", "title": "Ontario Education Workers, Must Struggle to Win", "content_html": "<p>The enemy ‘Thug Ford’ is a viciously reactionary but erratic and incompetent regime headed by a blustering buffoon. This fight can serve as a beacon to workers and hard pressed communities to find hope, take courage and be part of a sweeping fight back. The demand to “Dump Thug Ford with A General Strike” is rising out of necessity.</p>\n<img alt=\"Ontario Education Workers on Strike\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/kxN00qTNKZ-300.jpeg\" width=\"600\" height=\"400\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/kxN00qTNKZ-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/kxN00qTNKZ-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Some key points that are worth considering in the fight for fair wages to education workers in Ontario against the rising cost of living are:</p>\n<ol>\n<li>\n<p>Ford is by default. In the last election, his party held onto power with the votes of only 18% of those eligible to cast ballots. He is far more the product of oppositional weakness than his own strength.</p>\n</li>\n<li>\n<p>Their fight takes place in the context of a global cost of living crisis, an unfolding slump and a round of intensified austerity. It isn't an isolated skirmish but a decisive confrontation, the outcome of which will have much wider implications.</p>\n</li>\n<li>\n<p>There exists on our side a much greater power than Ford can muster but it has to be unleashed. This comes down to a readiness to defy and an ability to mobilize.</p>\n</li>\n<li>\n<p>The effort to slash real wages through the crudest form of legislated political thuggishness is creating shock and anger. If CUPE digs in and other unions act as the situation demands a great deal is possible.</p>\n</li>\n</ol>\n<p>Credits: <a href=\"https://www.facebook.com/john.clarke.771282\">John Clarke</a></p>\n", "date_published": "2022-11-02T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/racism-the-strange-fruit-of-capitalism/", "url": "https://kiri-vadivelu.ca/blog/racism-the-strange-fruit-of-capitalism/", "title": "Racism — the strange fruit of capitalism", "content_html": "<p>“Strange Fruit” has been described as “a declaration of war ... the beginning of the civil rights movement”. When Billie Holiday first performed the song, in a New York nightclub in 1939, it had an electrifying effect. “There wasn’t even a patter of applause when I finished. Then a lone person began to clap nervously. Then suddenly, everyone was clapping”, she later wrote.</p>\n<img alt=\"Racism - the strange fruit of capitalism\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/HR_zdzVI5y-300.jpeg\" width=\"600\" height=\"439\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/HR_zdzVI5y-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/HR_zdzVI5y-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Holiday was singing about the thousands of African Americans who were tortured and murdered by racist thugs, usually with total impunity. The last recorded lynching took place as late as 1981. But the killing of Blacks by police and racist vigilantes continues to this day. Trayvon Martin, Freddy Grey, Daunte Wright, Tamir Rice, Breonna Taylor, George Floyd—the list goes on and on.</p>\n<p>Racism is built into the fabric of US society, impacting every aspect of life. African Americans are nearly twice as likely as other Americans to live in poverty and to be unemployed; and the imprisonment rate of Blacks is more than five times the rate among whites.</p>\n<p>Racism is a modern phenomenon, the legacy of slavery. It developed in the seventeenth and eighteenth centuries as a new class of capitalists scrambled to exploit the opportunities offered by the opening of the Americas, and as the great powers sought to extend their empires.</p>\n<p>Today, it’s this capacity of racism to divide the working class that is most useful to the capitalists. They understand that when workers accept racist ideas, it undermines class solidarity and unity. The scapegoating of particular groups divides workers against each other, blunts their understanding of who their real enemies are and thus weakens their capacity to resist exploitation.</p>\n<p>The capitalists don’t rule directly: they rely on governments to enact and enforce laws and policies in their interests. The state is not some neutral, independent body standing above society; it’s an instrument of class rule. It’s not that the politicians, judges, the heads of the public service and armed forces who run the state are racists—though of course some of them often are. But as members of the ruling class, they are committed to the maintenance of exploitation and the protection of the interests of their “own” capitalists vis-à-vis those of other countries.</p>\n<p>Since the dawn of capitalism, the capitalists, politicians and bureaucrats who run the world have consciously and deliberately used racism to further their class interests. Racism is deeply embedded in capitalist society and all its institutions, and it’s too useful a weapon for them ever to give it up.</p>\n<p>In other words, to eradicate racism, we have to get to the source of the problem. The strange and bitter fruit of racism will disappear from society only once we tear out the whole capitalist system, root and branch.</p>\n<p>An except of Tess Lee Ack from <a href=\"https://redflag.org.au/article/racism-strange-fruit-capitalism?\">RedFlag</a></p>\n", "date_published": "2022-11-02T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/educations-workers-fight-for-economical-justice/", "url": "https://kiri-vadivelu.ca/blog/educations-workers-fight-for-economical-justice/", "title": "Educations Workers’ Fight for Economical Justice", "content_html": "<p>The large corporate funded misinformation campaign in the United States have lead all to believe communism is evil or at least cause fear about community sharing principles in the democratic society. Historically, corporate funded elections elected candidates in favour of banking industry. Hence, it provided a breeding grounds for state violence on civil movements, labour strikes and hate toward union members in North America. Ontario Education workers are rising from the ashes to defend democratic right to strike and demand living wage from the corporate government.</p>\n<img alt=\"Ontario Education Workers on Picket line\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/BfHz95v2EW-300.jpeg\" width=\"600\" height=\"300\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/BfHz95v2EW-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/BfHz95v2EW-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Today, working people across the country are exploited to the era of slavery and denied the right to fightback in a democratic country. Unfortunately, voter apathy is being the elephant in the room continue to elect government based on fear not freedom, which undercut the democracy for corporate welfare system.</p>\n<p>A quick dictionary definition of 'apathy' is 'lack of interest, enthusiasm, or concern.' Indeed, the general mood of working class people is anything but apathetic. There's lots of fear, confusion, uncertainty and an ocean full of as yet imprecise anger but very little apathy. Working people understand very clearly that things are bad, getting worse and heading for catastrophe. What is less clear to them is how they can possibly fight back and make a difference.</p>\n<p>Of course, greedy bankers behind the screen moving every needle to profit more from the inflation. While increasing pay and benefits to their fat cat CEOs, economic crooks use fudged data points to benefit shareholders; not clients who use banks. Ruling class accept bank manipulation of economic system as long as it benefit the wealthy. That is why when bank fight against inflation that does not translate into fair wages for workers.</p>\n<p>As a conscious participant of democracy, to make a useful contribution is to stop going on about how useless people are and how hopeless it all is. Today, education workers are taking defiant and powerful action and, in doing so, they are pointing the way forward and creating a sense of hope and possibility.</p>\n<p>Underpaid education workers are up against a lot and it's not possible to promise in advance a morale boosting result. This, however, is a moment to offer a note of optimism and to appreciate that, defeats, limitations and contradictions notwithstanding, the class struggle is far from over and those who intend to win it are not crying in the wilderness.</p>\n", "date_published": "2022-11-05T00:00:00Z" },{ "id": "https://kiri-vadivelu.ca/blog/logic-reasoning-to-trump-fear-fascism/", "url": "https://kiri-vadivelu.ca/blog/logic-reasoning-to-trump-fear-fascism/", "title": "Logic + Reasoning to Trump Fear + Fascism", "content_html": "<p>Nearly a year into Ukraine Russia conflict, people in the West and Europe continue to be divided while North American Treaty Organization (NATO) add fuel to the fire instead of diplomacy. Keeping the war prolong does not benefit humanity but only ruins innocent lives on both sides and accelerate planet destruction. Ironically, the weapon manufactures began celebrating Christmas since February 2022 and the cheering is going strong, still.</p>\n<img alt=\"President Putin and Biden back against each other\" loading=\"lazy\" decoding=\"async\" class=\"image\" src=\"https://kiri-vadivelu.ca/assets/images/generated/1_1fFsOAbI-300.jpeg\" width=\"600\" height=\"450\" srcset=\"https://kiri-vadivelu.ca/assets/images/generated/1_1fFsOAbI-300.jpeg 300w, https://kiri-vadivelu.ca/assets/images/generated/1_1fFsOAbI-600.jpeg 600w\" sizes=\"(min-width: 100px)\" />\n<p>Meanwhile, bankers found an excuse to jack up pay and compensation to their bosses. Of course, corporate landlords and grocery chains in capitalist society do not share profits but expenses only. Ultimately, the NATO sponsored war bill lands on the shoulders of small businesses and the people in which countries are parties to the war.</p>\n<p>Being an impartial in this conflict would risk being identified as Russian Bot, I still choose not join the devious party. As a Canadian who escaped a 30 year civil war to find a new home, war of any kind is not my cup of coffee. I truly wish peace and stability for both Ukraine and Russia although NATO war machine driven mainstream media have no interest in such rationality.</p>\n<p>The long term injection of misinformation and disinformation about the conflict only derails the perception of reality for people in the respective nations particularly in Canada and the United States. In Toronto, I find it is easier to rationalize with people of China and Russia about the Ukraine Russia conflict than to a Canadian on war steroid after consuming mainstream media.</p>\n<p>Most importantly, the criticism of Russia in the west have no logical reasoning but driven through emotional fear of communism taking over the planet. Again, the philosophy of communism is misunderstood in the west due to anti-communist campaign from the early 1930s when Toronto and Ontario Police assembled to issue death blow to the Communist Party in Canada.</p>\n<p>Ultimately, the defenders of capitalism were successful in making communist party illegal in Canada; however, the ripple effect of profit driven decision costed Canadians lack of knowledge and awareness about political ideologies till today. Sadly, only salt and peppers were sold in the political market for Canadians over 100 years while rest of the world enjoyed all different flavours.</p>\n<p>The general public in North America have no real understanding of communism, the people of Russia or sharing principles of socialism in any context. Embarrassingly, Canadians and American support the war because they fear communism as an evil vampire of some sort and therefore hate Russia. At the same time, if Russia continue to lead its people with reasoning as it does, the global transformation is irresistible. Likewise, if China continue to dominate the economy with low cost options, market is likely to stabilize long term growth for Chinese market.</p>\n<p>For most North Americans though, going to gym is good for health is understood but learning about political ideologies is still a no go zone and overridden by fear and anxiety. Upton Sinclair once said, “It is difficult to get a man to understand something, when his salary depends on his not understanding it” so barriers to democracy are everywhere.</p>\n<p>Like anything in life, Chinese Socialism or Russian Communism is not a perfect political ideology but that is not reason to marry colonial capitalism that promoted war and violence with no regard for people and planet for 500 plus years. Realistically, the social bankruptcy of political knowledge in Canada and America continue to allow to consume political propaganda; not seek factual information.</p>\n<p>The relentless effort of war profiteers and business driven media to feed misinformation to general public only destroy the health and well being of our people. The merciless manufacturing of fear gives no room for rationality but to build hate and anger instead of love and compassion toward one another based on true understanding of our differences.</p>\n<p>The butterfly effect is my dream but how we achieve that depends on our collective efforts. On a larger scale, I believe Canadians have the potential to walk a new path to freedom, justice and liberty instead of money, profit and bullshit; but will the status quo allow the change of direction?.</p>\n", "date_published": "2022-11-05T00:00:00Z" } ] }
